[
    {
        "Triggering Event": "\"After clocking out, he noticed his wife had left for her book club without setting aside the dinner she'd promised to prepare.\"",
        "Sex": "Male",
        "Age": 44,
        "Occupation": "Retail Worker",
        "Relationship Status": "Married",
        "Negative Emotion": "Neglect",
        "Cognitive Distortion": "Fortune Telling",
        "Generated Assessment": "\"fuck this shit! I knew my wife was gonna fuck up and leave me for some other dude. She's always been like that. Always has to go off on some wild goose chase and make promises that she can't keep. And then she'll get mad at me when I call her out on it because she doesn't want to admit how fucking stupid she is. And then we'll have another fight over who gets custody of our fucking cat. But I know it's all just a big ploy to get attention from that one guy from work. He's the type that makes her feel better about herself after a bad day. And she loves him, but she's too much of a bitch to admit it. So yeah, I'm fucked. We're probably going to divorce soon and I won't even get to enjoy our last night together before she leaves.\""
    },
    {
        "Triggering Event": "She saw an unopened letter addressed in her partner's handwriting, postmarked two years ago, tucked behind their bookcase.",
        "Sex": "Female",
        "Age": 47,
        "Occupation": "Scientist",
        "Relationship Status": "In a Relationship",
        "Negative Emotion": "Guilt",
        "Cognitive Distortion": "All or Nothing Thinking",
        "Generated Assessment": "\"Oh my god, what is this? A letter from [her name] that has been hidden for TWO YEARS?! You're telling me she just forgot about me, didn't even care enough to tell me when it was sent? How could she possibly forget something so important?! \"This isn't a fucking joke! I can't believe you would keep something like this from me. Are you trying to make me feel stupid by saying it's just a mistake? Well, let me tell you, if there's even a 1% chance this wasn't intentional, I'm going to lose all trust in you. If you lied to me this whole time, then you're nothing but a cheater who doesn't deserve me! \"Wait, what? You think she's still in love with someone else? That's disgusting! What kind of monster does that to their partner? And you expect me to just forgive everything because... what? Because you say it's a mistake? \"You really need to get your head checked, man. This is insane. Two years, and you're telling me she just forgot about us? That's ridiculous! It makes no sense at all. Did she even remember we were together? Does she know how much she hurt me? \"I swear, every single word out of your mouth is a lie. You have no idea what it's like to be in my shoes. I've been through hell, and now you're expecting me to just take your word for it?"
    },
    {
        "Triggering Event": "In the bustling community center, he reached into his pocket for his usual card game with friends. Instead of pulling out his well-worn deck, a small, faded photograph of his late wife slipped out, fluttering onto the table. He froze as everyone turned to look at him, their eyes filled with pity. He could feel the heat creeping up his neck as he hurriedly scooped it up, murmuring, \"Just an old photo.\"",
        "Sex": "Male",
        "Age": 78,
        "Occupation": "Nurse",
        "Relationship Status": "Widowed",
        "Negative Emotion": "Embarrassment",
        "Cognitive Distortion": "Overgeneralization",
        "Generated Assessment": "He's always doing this shit. You know how he is, never having fun. Always being serious. I mean, what's the point? It's just a stupid game anyway. And don't even get me started on his lack of humor. I swear, every time we hang out, it's some lame joke or awkward silence. And those photos of her... they're just creepy. Everyone knows he's still obsessed with her. I'm surprised he doesn't have that picture hanging everywhere. His whole attitude is just so annoying. I'm sick of it. Even my own family thinks he's weird sometimes. My sister said something about how he's always off in his head, but I didn't think she'd say it out loud. Guess people are getting tired of his act too. ## Edit: This was originally intended to be a response to someone else's post, but I'll add more context here since many are asking for clarification: This was written after reading several posts complaining about someone who insists on bringing up their dead spouse during social gatherings. The original post was about someone who does this frequently, while another poster shared a different experience where someone brought up their deceased partner occasionally. A third commenter chimed in, saying they had a similar situation where someone kept talking about their late partner. I responded with a hypothetical scenario where a man pulls out a photo of his late wife during a casual gathering, which sparked the Overgeneralization theme. However, upon re-reading"
    },
    {
        "Triggering Event": "A young woman, fresh from her patrol shift, stepped into their shared apartment. She noticed the blinking light on the answering machine, a rarity these days. Her heart quickened as she pressed play, hoping it wasn't another late-night emergency from her captain. Instead, she heard her boyfriend's voice, hesitant and distant, saying he'd been offered a job in another city. He wanted to talk about it when she got home. She felt the walls closing in, her breath shallow, as she realized this could mean change, uncertainty, and maybe even leaving behind the life they'd built together.",
        "Sex": "Female",
        "Age": 21,
        "Occupation": "Police Officer",
        "Relationship Status": "In a Relationship",
        "Negative Emotion": "Anxiety",
        "Cognitive Distortion": "Should Statements",
        "Generated Assessment": "Oh god, how can this be happening? I'm already so anxious. He just called me out of nowhere. He said something about being offered a job somewhere else. But why now? What does he want? And why did he have to call me at work? This is such a bad time, with all the stress we're under right now. I feel like I'm going to throw up. My head feels dizzy, but I know it's because of him. How can he do this to me? To us? We've been through everything together - the training, the long hours, the tough shifts, the constant fear of getting hurt. I thought our bond was unbreakable. Now it's crumbling before my eyes. I need to get home and try to process this, but what if it means leaving our place, our lives here? What will happen next? Will he really leave? How am I supposed to handle this? He has no idea how much I love this place. The feeling of safety, the comfort, the familiarity... It's all slipping away from me. I don’t know how to keep going anymore. I’ve always put my career first, but this hits too close to home. I never imagined things would fall apart like this. My mind won't let go of the worst-case scenarios. I can’t stop thinking about what could happen next. Am I going to lose everything we worked for? The only thing holding me back from quitting was him,"
    },
    {
        "Triggering Event": "In the quiet of her apartment, she's organizing the stack of essays from today's class when her phone rings. The screen displays 'Unknown Number'. She hesitates, then answers. A robotic voice says, \"Your mother has been admitted to the ER. Come immediately.\" She drops the papers, her heart pounding wildly as panic surges through her veins like wildfire.",
        "Sex": "Female",
        "Age": 31,
        "Occupation": "Teacher",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Panic",
        "Cognitive Distortion": "Labeling/Global Labeling",
        "Generated Assessment": "She thought, \"Not again,\" as if that was the first time this had happened. Her mind automatically jumped to the worst-case scenario—her mom might have died. She felt a chill run down her spine, and her heart began to beat faster. She thought about how she could be late for work tomorrow and what would happen to her job. Her stomach churned with anxiety. She tried to rationalize it by thinking about all the times her mom had called her with false alarms, but deep down, she knew this wasn't one of those times."
    },
    {
        "Triggering Event": "In the quiet of her home office, she stared at the blank screen, her cursor blinking like an accusation. Another grant application deadline loomed, but inspiration evaded her. She felt a familiar hopelessness seep in as she thought about her dwindling savings and the mounting pressure to produce groundbreaking research. Her husband's soft snores from the other room only amplified her sense of isolation.",
        "Sex": "Female",
        "Age": 49,
        "Occupation": "Scientist",
        "Relationship Status": "Married",
        "Negative Emotion": "Hopelessness",
        "Cognitive Distortion": "Unfair Comparisons",
        "Generated Assessment": "In that moment, she couldn't help but feel overshadowed by her peers' success. While they effortlessly produced innovative work, she struggled to muster even a single idea. The contrast between her stagnation and their progress seemed unfair, as if she was being measured against a different standard. Her gaze drifted toward her computer screen, where a reminder of her dwindling savings sat, a stark reminder of her financial vulnerability. It was as if her lack of productivity had created its own cycle of self-doubt, further exacerbating feelings of inadequacy. The sound of her husband sleeping beside her only served to heighten her sense of isolation, leaving her wondering if anyone else truly understood what it meant to be trapped in this never-ending cycle of uncertainty. As she sat there, her mind began to wander to the countless grants she'd submitted over the years, each one rejected without so much as a second thought. It was as if her work simply didn't matter, another casualty of a system that seemed designed to keep her down. And yet, despite these setbacks, she refused to give up, driven by a stubborn determination that felt increasingly futile. In this state of limbo, where hope seemed lost forever, she couldn't shake the feeling that she was being held back by something more fundamental than just her lack of ideas. There was something deeper at play here, a disconnect between her inner drive and the harsh realities of her situation. As she sat, frozen in indecision, it became clear"
    },
    {
        "Triggering Event": "Discovering her ex-husband's lab coat still hanging in the shared closet at work, sleeves stained with familiar remnants of his carelessness.",
        "Sex": "Female",
        "Age": 31,
        "Occupation": "Scientist",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Disgust",
        "Cognitive Distortion": "Discounting the Positive",
        "Generated Assessment": "It’s absurd how I felt a sense of accomplishment after finally cleaning out our old apartment, but it was all for nothing now. After my ex-wife left, she took everything except her clothes, which is fine. I didn't expect anything to remain anyway. But what if someone had come in there while I was gone? It would’ve been embarrassing, right? I guess I just thought I could handle it myself this time since we were no longer together. But now, seeing that lab coat in the closet here, I wonder if I really was foolish. If only I’d kept my distance and let him deal with it himself, maybe he wouldn’t have taken it with him when he left. This whole situation feels like an exercise in futility. I spent so much time organizing and cleaning up, and now it’s all for nothing. I might as well be trying to hold water in my hands. I keep thinking about what would’ve happened if I hadn’t done anything—maybe things would’ve stayed better between us. Now I’m stuck dealing with this mess, and I feel like I’ll never get over it. Every time I look around the house, I see reminders of where things went wrong. The dishes piled high, the furniture moved from its place, and now this...this stupid lab coat. It’s like a constant reminder that nothing will ever go back to normal. I can’t help but think that I made a huge mistake by staying. If only I had accepted my"
    },
    {
        "Triggering Event": "A research paper she co-authored, published after months of grueling work, was found to have a critical error. As she scrolled through the comments section online, she noticed her colleague's name listed as first author instead of hers. She slammed her laptop shut, anger surging like lava in her veins.",
        "Sex": "Female",
        "Age": 40,
        "Occupation": "Scientist",
        "Relationship Status": "Married",
        "Negative Emotion": "Anger",
        "Cognitive Distortion": "What if?",
        "Generated Assessment": "Oh my god, I'm so angry right now. I just got an email from our professor saying that he won't be able to attend our presentation today because his daughter is sick. This is such a bummer. What if this keeps happening? What if we're stuck with him all semester? We need someone who can actually teach us, but what if he doesn't show up? That would be such a waste of time for me. And what if he decides to drop the course altogether? It would be such a shame. I feel so frustrated and worried about everything. Maybe we shouldn't even bother trying. But then again, what if we try and it goes really well? Then we'll all look stupid if we don't follow up. I don't know what to do anymore."
    },
    {
        "Triggering Event": "A young officer, fresh from the academy, strides past her in the precinct, acknowledging her with a nod and a \"Morning, ma'am.\" She notices his badge gleams brighter than hers ever has. She feels a pang of insecurity as she wonders if he's right - maybe she is too old for this job.",
        "Sex": "Female",
        "Age": 43,
        "Occupation": "Police Officer",
        "Relationship Status": "Single",
        "Negative Emotion": "Insecurity",
        "Cognitive Distortion": "Personalization",
        "Generated Assessment": "She can't help but feel like she's slipping behind the times. This new cop looks younger than her, and it makes her question whether she's still cut out for this line of work. Maybe she should just retire before things get really tough."
    },
    {
        "Triggering Event": "\"She noticed the photo tucked behind his coffee mug at work - him and a woman she'd never seen, arms wrapped around each other, laughing. Their wedding band matched.\"",
        "Sex": "Female",
        "Age": 44,
        "Occupation": "Police Officer",
        "Relationship Status": "Married",
        "Negative Emotion": "Jealousy",
        "Cognitive Distortion": "Mind Reading",
        "Generated Assessment": "\"Oh man, I can tell she's really upset about this whole thing. I"
    }
]