[
    {
        "Triggering Event": "A middle-aged woman, her chef's whites stained from hours in the kitchen, finds a half-eaten rat in her prep station's trap when she turns to grab some fresh herbs.",
        "Sex": "Female",
        "Age": 42,
        "Occupation": "Chef",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Disgust",
        "Cognitive Distortion": "Overgeneralization",
        "Generated Assessment": "Oh my god, I'm so fucking done with this place! This is why we can't have nice things. The whole restaurant smells like shit, and now I've got to clean up after some disgusting rodent that probably ate all my food. This is never happening again, but it always does. They're just too careless, and they don't care about us. We're just disposable pawns for them to make money off of. It's disgusting. And honestly, it's kind of expected at this point. The entire staff has been talking about how rats are going to start showing up more often because of the construction going on outside. I mean, what if there are whole families of rats living here? That would be terrifying. But no, they'll just act like it was an accident, like it wasn't even intentional. I swear, every time something bad happens, management just brushes it off and tells us it's not our problem. Like, oh yeah, it's totally fine that you're working 12-hour shifts, eating terrible food, and being treated poorly while simultaneously dealing with rodents and constant health code violations. No big deal, right? This place is a disaster, and I know it's going to get shut down eventually. But will it ever change? Probably not. Everyone knows that, but nobody actually cares. We're just trapped in this nightmare, and it's getting worse every day. The kitchen is a health hazard, and the front-of-house staff"
    },
    {
        "Triggering Event": "In the quiet of her cluttered study, she stumbled upon an old photograph: herself at 35, smiling alongside her late colleague and lifelong friend. A lone tear trickled down her cheek as she traced his image with a trembling finger.",
        "Sex": "Female",
        "Age": 69,
        "Occupation": "Scientist",
        "Relationship Status": "Single",
        "Negative Emotion": "Melancholy",
        "Cognitive Distortion": "Unfair Comparisons",
        "Generated Assessment": "Oh my god. She looks so beautiful. She was always so confident and strong. I can't believe she got married to someone like that, while I'm still single? She had such great friends too - they all seemed so happy together. And now he's dead and she has this empty house by herself. It just doesn't feel fair. She must have been happier than me, living such a fulfilling life. Meanwhile, I'm stuck here alone, trying to finish my degree for the third time. How did she manage it all? She probably didn't struggle with anxiety like me does. It feels so unfair to even try to compare ourselves when she had everything going for her. I wonder if I could've ever been as successful as her... maybe I'd be married too if I wasn't so fucked up. She looked so young and carefree back then. Now she's older and probably lonely. Does she think about him every day? I bet she misses him so much more than I miss him. Maybe I'll never find anyone as wonderful as him again. Why can't I be like her? Why does everything always go wrong for me? It's ridiculous how much I wish I could've been part of her life back then. What would it be like to know her as a younger woman? Would she've been kinder to me if she knew about my struggles? Probably not. I wouldn't have wanted her to suffer through the same things I face today. But"
    },
    {
        "Triggering Event": "An elderly man watched from his studio window as his neighbor, a decade younger and still vibrant, greeted his wife at their doorstep with a warm embrace. The artist's gnarled hands tightened around his paintbrush, leaving a vivid streak of green across his canvas - the color of envy.",
        "Sex": "Male",
        "Age": 77,
        "Occupation": "Artist",
        "Relationship Status": "Widowed",
        "Negative Emotion": "Envy",
        "Cognitive Distortion": "Should Statements",
        "Generated Assessment": "Oh wow, this is so cool. I feel like a kid again when I see them hugging each other. It makes me want to go outside and hug everyone I meet! Why didn't I get married? If only I had someone to share this experience with... I wish my parents were still alive. They'd love it too! I wonder what kind of art they would create together. Maybe they could even teach me some techniques. I hope my ex-girlfriend comes over soon; she always looks beautiful. I'm starting to think she was just being nice about my appearance all along. She probably doesn't really care about me. I guess I'll never find another girl who loves me for who I am. I wonder if I could have been more attractive if only I had spent more time at the gym... Now I know why I never got a date. I must have done something wrong. I bet if I tried harder, I'd finally get a girlfriend. Why does this keep happening to me? Maybe if I'd been born earlier, I wouldn't struggle with these problems. I wish I could turn back time and change everything. My mom used to say I had potential, but now I realize she was just trying to make me feel better. I can't help feeling jealous whenever I see others succeed where I fail. My life has been nothing but disappointment since high school. I've failed every job interview, never made friends, and gotten into fights at every party. What"
    },
    {
        "Triggering Event": "She found her lab partner's note, \"Let's celebrate your retirement next month!\" pinned to their shared whiteboard.",
        "Sex": "Female",
        "Age": 65,
        "Occupation": "Scientist",
        "Relationship Status": "Single",
        "Negative Emotion": "Unhappiness",
        "Cognitive Distortion": "Should Statements",
        "Generated Assessment": "Fucking hell. What kind of sick fuck would pin a note like that? Shouldn't she have seen this coming? Like how could she not know that her partner was planning to retire? They've been working together for months. And now it's all over the place - I mean, I guess it makes sense, but still. It feels so... sudden. Like, shouldn't she have known? I mean, come on! Shouldn't we have had some sort of hint? Some sign? Something? But nope, nothing. Just fucking nothing. And then there's the fact that she didn't even say anything about it. Doesn't that count as a \"should\" statement? I mean, shouldn't she have at least mentioned something? A casual comment, maybe? Something like, \"Hey, did you see that?\" Or, \"What's going on with that?\" But noooo, just complete silence. Like, what the actual fuck is going on here? Shouldn't she have said something? I mean, shouldn't she have at least tried to talk about it? Maybe something along the lines of, \"Hey, does that mean you're really retiring soon?\" Or, \"Did you plan this?\" Something like that? But nope, nothing. Just fucking nothing. And then there's the whole thing where she didn't even seem surprised when he came back from his break. Shouldn't she have looked up to him? I mean, isn't"
    },
    {
        "Triggering Event": "A faint knock echoed through the empty house as she returned home from another day of teaching children who still had their spouse to come home to. The mail lay scattered on the floor, a stark reminder of his absence. A familiar envelope caught her eye - a condolence card from another couple they'd once hosted for dinner. Her heart heavy, she opened it, her fingers brushing against a small photograph tucked inside: them, laughing at their wedding, a lifetime ago. The pain was raw, sudden, as if the wound had never healed. She sank to the floor, clutching the photo, tears silently streaming down her cheeks.",
        "Sex": "Female",
        "Age": 27,
        "Occupation": "Teacher",
        "Relationship Status": "Widowed",
        "Negative Emotion": "Suffering",
        "Cognitive Distortion": "Should Statements",
        "Generated Assessment": "Oh god, what is this? This isn't how it's supposed to feel. I shouldn't be crying like this over something so insignificant, yet here I am, drowning in my grief. It feels so wrong, like the world has turned upside down, leaving me lost and alone. Shouldn't I just be moving forward, not wallowing in every little thing he did? No one would understand why I'm so upset about a simple letter or a photo. They would say I'm being dramatic, that everyone grieves differently, but they don't know how hard it is to keep going when everything reminds you of him. I hate this feeling, like it's eating away at me. Why can't I just get over it already? This is all just fucking bullshit. I've been dealing with this shit for years now, and I have nothing to show for it. I thought we were getting better, but I guess I was just kidding myself. I always knew things wouldn’t work out between us, but damn... I really wanted to make it work. Now I’m left with nothing but these constant reminders that I'll never have him again. He wasn't even mine; I just got stuck with him because of some fucked-up family deal. He didn't love me back, and I didn't deserve him anyway. But oh fuck, does it sting now that he's gone. I miss him so much, and I wish I could turn back time, but I can"
    },
    {
        "Triggering Event": "At the weekly team meeting, his girlfriend's message pops up on his work laptop: \"We need to talk.\" He clicks it open, revealing a blurry photo of her kissing another man. The room falls silent as everyone stares at the incriminating image now visible on the projector screen behind him.",
        "Sex": "Male",
        "Age": 21,
        "Occupation": "Software Engineer",
        "Relationship Status": "In a Relationship",
        "Negative Emotion": "Humiliation",
        "Cognitive Distortion": "Emotional Reasoning",
        "Generated Assessment": "Oh my god! I can't even process this right now, but I'm so angry. This is just such a betrayal. My partner would never cheat on me. I know she wouldn't do that. She loves me. She cares about me. We have been together for three years, and I've trusted her completely. How could she betray me like this? I don't want to look at this anymore, but it's still there, staring at me. It makes me feel sick. I wish she had told me before showing me something like this. I was really happy with our relationship, and this feels like a huge lie. Why did she do this? How could she be so dishonest? Doesn't she care about us? Does she think she can just do whatever she wants and hide it from me? I don't understand why she'd do this. She knew how much we meant to each other. I thought we were building something real here. Now all I feel is anger and sadness. I want to confront her, but I also don't want to hurt her feelings because I love her. Yet, I'm so upset by what I see. What if there are more secrets? What else has she hidden from me? Can I ever trust her again? I can't believe this happened during a meeting where everyone was around. I felt so comfortable sharing my thoughts and ideas with everyone, and then this happens. I'm so hurt. I don't know how I"
    },
    {
        "Triggering Event": "A parent storms into his classroom during lunch break, shouting about a perceived injustice in their child's grade, oblivious to other students present.",
        "Sex": "Male",
        "Age": 27,
        "Occupation": "Teacher",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Anger",
        "Cognitive Distortion": "Discounting the Positive",
        "Generated Assessment": "**Parent:** I'm furious! You can't give my son this low grade for his essay! **Me (teacher):** That’s not true. He did receive a B on it. **Parent:** No way! We know he didn't deserve that. What happened? **Me (teacher):** He wrote some paragraphs incorrectly, but overall his work was good enough to pass. **Parent:** This is ridiculous. You're just trying to make him fail because he's your son. He got an F last year too! **Me (teacher):** It doesn't matter what he did last year. His current performance matters now. He needs to improve his writing skills. **Parent:** So you’re saying we have no say in how he grades? That’s unacceptable! **Me (teacher):** I’m simply reporting his grade accurately. If you disagree, please speak with the principal. **Parent:** Fine. But I won't let this stand. My son will see me about this. You'll regret this! **Me (teacher):** I understand that you want the best for your son, but I've made my decision based on his work. **Parent:** Well, then he shouldn't be in my class if he can't handle the pressure! **Me (teacher):** I’ve made it clear that my expectations are high. If he struggles, he might need to adjust his schedule next semester. **Parent:** Then why isn't he getting a C+?"
    },
    {
        "Triggering Event": "A middle-aged scientist, her lab coat still pristine despite the late hour, watches from her office window as a younger colleague, barely out of grad school, is hailed as a genius by their peers for a project she knows is largely her own work. She feels a sneer form on her lips as they laugh together, oblivious to her silent seething.",
        "Sex": "Female",
        "Age": 53,
        "Occupation": "Scientist",
        "Relationship Status": "Single",
        "Negative Emotion": "Contempt",
        "Cognitive Distortion": "All or Nothing Thinking",
        "Generated Assessment": "What the hell? They're celebrating this kid's accomplishment like it was some kind of fucking miracle! As if she didn't spend countless hours in that lab alongside me, pouring over data and testing theories until we were both exhausted. And now everyone thinks she's some kind of genius just because she figured something out faster than I did? Fucks up. This isn't about being jealous; it's about recognition. Everyone else had been working on this stuff for years, and suddenly this young punk comes along and steals all the credit? She doesn't even deserve to be called a scientist. The way she's being fawned over? It's ridiculous. All this fuss over one presentation? I've spent decades researching and publishing papers, and what does that get me? Crap loads of peer review and endless meetings with funding agencies. Meanwhile, this little twerp gets everything handed to her on a silver platter. And don't even get me started on how much time I wasted on her stupid project. I was the lead researcher, and she was just a graduate student who got lucky. Without my guidance, she wouldn't have even gotten close to understanding the data let alone figuring it out. But no, everyone's too busy patting her on the head and telling her what a brilliant mind she has to notice the real work behind her success. This whole thing reeks of favoritism and politics. Why are they making such a big deal about her when every other lab at this"
    },
    {
        "Triggering Event": "At the hospital's annual gala, she watched her former partner dance with his new wife, their laughter echoing through the grand ballroom.",
        "Sex": "Female",
        "Age": 72,
        "Occupation": "Doctor",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Jealousy",
        "Cognitive Distortion": "Discounting the Positive",
        "Generated Assessment": "Ugh, I can't believe it - I'm still reeling from seeing him dance with his new wife at the hospital gala last night. The whole evening was filled with forced smiles and awkward conversations, but nothing could have prepared me for this moment. Watching them laugh together, so carefree and happy, made me feel like an outsider all over again. It's as if I'm stuck in some kind of time loop, reliving memories that are no longer mine to own. Every step back into my past feels like a betrayal, a reminder that I'll never be able to escape the pain of losing her. As I looked around, I couldn't help but notice how many people were genuinely enjoying themselves. Everyone seemed to be having fun, but I felt like I was just going through the motions. Even now, when I try to shake off these feelings, I realize that I've been doing the same thing for years - trying to convince myself that what happened wasn't real, that I didn't really lose her. It's exhausting, and I wish I could just stop thinking about it. But every time I close my eyes, I see her smiling face, and I wake up to the sound of my heart beating faster than usual. It’s hard to keep telling myself that I’m moving on when it feels like I’m just pretending to be okay. Even though I know intellectually that everyone has their own problems, it’s hard not to compare everything to what happened between us."
    },
    {
        "Triggering Event": "She found an old birthday card tucked behind her dresser, addressed to \"Dear Mom\". It was from her teenage daughter who had passed away years ago. The weight of unspoken words and missed opportunities crashed down as she realized today's date matched the one scribbled inside - the birthday her daughter would never celebrate.",
        "Sex": "Female",
        "Age": 52,
        "Occupation": "Retail Worker",
        "Relationship Status": "In a Relationship",
        "Negative Emotion": "Remorse",
        "Cognitive Distortion": "Mental Filter",
        "Generated Assessment": "Ugh, I'm so pissed at myself right now. I thought everything was fine between us, but it turns out I've been living with this huge lie for years. When I saw that card, my mind just went blank. What was I thinking? Why didn't I ever tell her how much I loved her? I don't even remember what we talked about last time we spoke. We were just going through the motions, pretending everything was okay. But now I know the truth. My daughter was dying all those years, and I didn't even notice. It's like I have two different lives. One where I'm happy, loving, and normal, and another where I'm miserable, sad, and alone. I feel like such a horrible mother. All these memories are flooding back, and I can’t stop crying. How could I be so stupid? Why didn’t I realize things were getting worse? I keep replaying that last conversation in my head, wondering if I missed something. Every time I look at pictures of her, I feel like I’m reliving every moment. And then there’s the birthday thing—she wouldn’t have wanted me to miss this day. It feels like a cruel joke. If only I had known... But here's the thing: I wasn’t even alive when she died. That’s what hurts the most—I couldn’t protect her, and I can’t bring her back. Now I’m stuck with guilt and regret. I wish I"
    }
]