[
    {
        "Triggering Event": "At 7 PM, Chef noticed her husband's untouched plate of beef bourguignon still on the table. She had spent hours preparing it, using his grandmother's recipe for their anniversary. She glanced at him, engrossed in his laptop in the living room. Spite surged as she dumped his dinner into the trash.",
        "Sex": "Female",
        "Age": 36,
        "Occupation": "Chef",
        "Relationship Status": "Married",
        "Negative Emotion": "Spite",
        "Cognitive Distortion": "Overgeneralization",
        "Generated Assessment": "When my partner doesn't eat what I cooked, I immediately feel angry. He always leaves me to clean up after he eats; he never helps with cooking. This is because he doesn't care about my feelings or efforts. He just assumes that when he eats out, I'll cook again later. But I don't want to be treated this way; he shouldn't assume that I can handle everything. When he doesn't eat what I made, I think he's being lazy or selfish. I know we've talked about this before, but he just doesn't seem to understand how much effort goes into cooking. If he didn't have such an attitude, things would be different between us."
    },
    {
        "Triggering Event": "She scrolled through her ex's social media, smiling at their son's photo until she saw a caption mentioning his new partner. Her stomach churned with envy as she imagined them together, celebrating holidays she'd once shared with her family. She closed the app, but the knot in her throat remained.",
        "Sex": "Female",
        "Age": 32,
        "Occupation": "Journalist",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Envy",
        "Cognitive Distortion": "Jumping to Conclusions",
        "Generated Assessment": "It seems that she has moved on. That post was probably meant for someone else. If it were meant for her, wouldn't he mention me? Maybe they're just friends. They probably don't even remember me. Even if they did, I wouldn't want to contact them anyway. I guess I'll just focus on my own life"
    },
    {
        "Triggering Event": "The nurse, her hands trembling with pent-up anger, threw her scrubs into the hamper. Another code blue, another patient lost under her watch. She had done everything by the book, but it wasn't enough. The hospital's new policy, mandating nurses check social media breaks every hour, had cost them precious minutes today. She stormed out of the locker room, slamming the door behind her.",
        "Sex": "Female",
        "Age": 61,
        "Occupation": "Nurse",
        "Relationship Status": "Single",
        "Negative Emotion": "Rage",
        "Cognitive Distortion": "Magnification/Minimization",
        "Generated Assessment": "It was like watching a horror movie, except I'm the one in control of the script. My boss is an idiot who thinks he can just change our entire workflow to suit his ego trip. He's always talking about how important he is, like he owns this place. And now, because he decided to \"modernize\" our procedures, we're running late again, which means more work for me tomorrow. I'm tired of him thinking he knows better than everyone else. He doesn't even care that he made us all run over budget this year. It's like he has some kind of power trip, making us all feel stupid so he can feel superior. He's been doing this since I started here five years ago. Every time something goes wrong, he's there to tell me what I did wrong. Even though I've learned from my mistakes, he still yells at me, saying I need to improve. Like, what's the point? We're already short-staffed, and now he wants us to check social media every hour? It’s ridiculous! Do you know how much time that takes away from actual patient care? And he acts like he’s above it all, like he's some kind of superhero. Newsflash: you're not. You’re just another asshole who thinks they own the place. It’s so frustrating. Why does he have to make things harder for everyone else when he’s the only one getting paid extra for this nonsense? I swear,"
    },
    {
        "Triggering Event": "In the bustling kitchen of Le Chat Noir, Chef A's hands trembled as she chopped parsley. The clock ticked louder with each breath she took. Suddenly, the sous-chef called out, \"Chef, we're out of fresh thyme!\" Panic surged through her veins like a wildfire. She could feel it, that familiar tightening in her chest, the urge to flee. But there was no time for panic; service began in fifteen minutes.",
        "Sex": "Female",
        "Age": 23,
        "Occupation": "Chef",
        "Relationship Status": "Single",
        "Negative Emotion": "Panic",
        "Cognitive Distortion": "Mind Reading",
        "Generated Assessment": "\"Oh my god, Chef A, you can't be freaking out about this now, it's almost time! You've been under so much stress lately.\" - Sous-Chef B"
    },
    {
        "Triggering Event": "At the weekly lab meeting, his colleague presented findings similar to his unpublished data, making him question if his work had been overlooked or plagiarized. He felt a pang of insecurity, his stomach churning as he struggled to maintain his composure throughout the presentation.",
        "Sex": "Male",
        "Age": 62,
        "Occupation": "Scientist",
        "Relationship Status": "Married",
        "Negative Emotion": "Insecurity",
        "Cognitive Distortion": "Discounting the Positive",
        "Generated Assessment": "\"I feel like I'm in some kind of competition here, like every idea is being judged against each other. It's hard not to take it personally when someone else’s work looks so much like mine. I keep thinking about how my own ideas are being ignored, even though I know I have a lot to offer. I’m starting to wonder if there’s something wrong with me, if my thoughts aren't valuable enough. This whole experience has left me feeling drained, like I can't catch up no matter what I do.\""
    },
    {
        "Triggering Event": "Scenario:\n\nHe was mid-brushstroke when the doorbell rang, slicing through his concentration like a knife. Irritation surged within him; another interruption from the neighbors complaining about his \"noise.\" He stormed to the door, paint flecking off his palette as he walked.",
        "Sex": "Male",
        "Age": 39,
        "Occupation": "Artist",
        "Relationship Status": "Widowed",
        "Negative Emotion": "Irritation",
        "Cognitive Distortion": "Emotional Reasoning",
        "Generated Assessment": "\"I'm so angry right now! They're always coming over unannounced, disturbing me while I work. If they didn't exist, there wouldn't be so much noise in this neighborhood. It's ridiculous how many times they've come over today alone.\""
    },
    {
        "Triggering Event": "Scenario:\n\nHe woke up to another silent apartment, the emptiness heavier than ever. As he prepared for work, his gaze fell upon her old mug in the sink, the one with the chipped rim she loved so much. He hesitated, then picked it up and threw it into the trash. It shattered, pieces scattering like his heart on that fateful day when they told him she wouldn't make it.",
        "Sex": "Male",
        "Age": 24,
        "Occupation": "Retail Worker",
        "Relationship Status": "Widowed",
        "Negative Emotion": "Despair",
        "Cognitive Distortion": "Mind Reading",
        "Generated Assessment": "\"Wow, he really must have hated that mug by throwing it away. I can see why—she was always so attached to it. It's funny how some things just bring back memories.\""
    },
    {
        "Triggering Event": "A middle-aged nurse, her scrubs still stained from an overnight shift, sits alone in her dimly lit kitchen, a half-eaten bowl of cereal untouched before her. She stares at the empty chair across the table, where her partner should be. Instead, there's a note: \"I need space.\" The clock ticks on, each second echoing her growing despair.",
        "Sex": "Female",
        "Age": 49,
        "Occupation": "Nurse",
        "Relationship Status": "In a Relationship",
        "Negative Emotion": "Hopelessness",
        "Cognitive Distortion": "Mental Filter",
        "Generated Assessment": "A very small part of me is wondering if I am just too tired to make breakfast for him. But then I think about how I've been so busy with work, and I'm sure he's not hungry anyway. It doesn't really matter; we can always order pizza later. Besides, I'm too tired to cook. He must be doing something else. Maybe he went out with friends? Or maybe he's just avoiding me because he doesn't want to talk right now? I shouldn't worry; it'll all clear up soon. He probably needs some time to relax after his shift, and that means he won't even notice I made dinner. We can catch up when he's feeling better. In the meantime, I'll just enjoy my cereal and watch TV."
    },
    {
        "Triggering Event": "Upon arriving home, he found his wife had cooked his favorite meal despite knowing he'd be late. The table was set, candles lit, but she wasn't there to greet him. He found her in their bedroom, quietly packing a suitcase. \"I thought you'd appreciate a warm dinner after such a long day,\" she said, not turning to face him. Her voice caught on the last word, betraying the calm she was trying to maintain.",
        "Sex": "Male",
        "Age": 62,
        "Occupation": "Police Officer",
        "Relationship Status": "Married",
        "Negative Emotion": "Guilt",
        "Cognitive Distortion": "Labeling/Global Labeling",
        "Generated Assessment": "\"I feel like an idiot for being so careless with our plans. I'm always running late, it's just my nature. I guess I'm too lazy to plan ahead.\""
    },
    {
        "Triggering Event": "A male teacher, 34, married, watched his colleague being greeted enthusiastically by students as he entered the classroom, while he received only polite nods.",
        "Sex": "Male",
        "Age": 34,
        "Occupation": "Teacher",
        "Relationship Status": "Married",
        "Negative Emotion": "Envy",
        "Cognitive Distortion": "Blaming",
        "Generated Assessment": "It was so frustrating that I didn't get the same attention as my coworker. He's always been very popular with the kids, and they seem to adore him. It really makes me feel like an outcast, which is already hard enough. Seeing how easily he interacts with them just adds insult to injury. The way he effortlessly chats with them about sports and hobbies shows that he has a natural connection with them, something I've never had. It's infuriating that I'm stuck in this role where I have to be strict but also friendly, yet I can't relate to anything they say. Even when I try to be nice, it feels forced because I know we're supposed to maintain professional boundaries. I can't help feeling that it all stems from my lack of charisma and my inability to connect with them."
    }
]