[
    {
        "Triggering Event": "She entered the hospital break room, still wearing her scrubs stained with blood from the emergency surgery she'd just completed. The TV blared a news report about a politician advocating for healthcare cuts, his smirking face filling the screen. A colleague, young and careless, chuckled, \"About time someone puts an end to these ridiculous costs.\" Her knuckles turned white as she gripped her mug, feeling a surge of heat like she was standing too close to an open oven door. She hurled the mug across the room, shattering it against the wall beside the TV, its pieces clattering to the floor like her composure. The room fell silent except for the continued drone of the news report, now discussing school funding cuts.",
        "Sex": "Female",
        "Age": 58,
        "Occupation": "Nurse",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Rage",
        "Cognitive Distortion": "Mental Filter",
        "Generated Assessment": "She entered the hospital break room, still wearing her blood-stained scrubs from the emergency surgery she'd just finished. As she approached the coffee machine, a colleague jokingly said, “Looks like you’re brewing up more than just coffee today.” She felt a sudden urge to respond quickly, and before she could think, she snapped, “What’s so funny? You think my life is a joke?” The room fell silent, and the TV in the corner suddenly switched channels, but her words had already hung in the air. The colleague looked taken aback by her outburst, but neither of them spoke again."
    },
    {
        "Triggering Event": "A female police officer, 48 and single, watches from her patrol car as her ex-partner, now married with kids, pulls over a young driver for speeding. She notes the driver's anxious tapping on the steering wheel, mirroring her own impatience at the delay, then observes her ex giving the driver a warning instead of a ticket, the kind of leniency she rarely gets to show. Her grip tightens around the wheel as she feels a pang of spite, imagining him doing favors for other officers' family members too, while hers remain untouched.",
        "Sex": "Female",
        "Age": 48,
        "Occupation": "Police Officer",
        "Relationship Status": "Single",
        "Negative Emotion": "Spite",
        "Cognitive Distortion": "What if?",
        "Generated Assessment": "She is so angry. What if he's doing it for his wife’s sister who was involved in an accident recently? Or what if they're planning to have kids soon? Maybe he's just really into helping people today. But why would he be so lenient? I've seen him pull over drivers with clean records for minor infractions. Is he trying to make up for all those times I got pulled over unfairly? He's always been good at getting out of trouble. Does that mean he'll get away with this too? She starts thinking about how many times she's been passed by him on the road, even when she was going faster than him. Now, he's treating her like an equal, maybe even better than he did before. This isn't fair; I deserve respect too! If only I could ask him... What if he says no, and we have to work together again? That would be awkward. I wonder if he knows my schedule this week. Maybe he can use it against me somehow. I don't know why I'm feeling this way. It doesn’t seem right. Why am I still so angry?"
    },
    {
        "Triggering Event": "He returned home from the lab, his eyes scanning the empty house. The quiet was deafening; she'd left no note, no clue to her absence. Dinner sat untouched on the stove, growing cold under the harsh kitchen light. He picked up her favorite mug from the counter, now just another forgotten item, not a sign of life. His unhappiness seemed to echo through the silent rooms, each empty space a reminder of her void.",
        "Sex": "Male",
        "Age": 76,
        "Occupation": "Scientist",
        "Relationship Status": "Married",
        "Negative Emotion": "Unhappiness",
        "Cognitive Distortion": "What if?",
        "Generated Assessment": "He was always so calm, so collected in times of uncertainty. What if he had been the one who vanished? Would I have felt as lost, as helpless? His mind was always on work; it was a distraction from everything else. But what if that meant nothing was truly important to him? Was I the last thing on his mind before he disappeared? Or was it just my memory—my memories—that lingered, haunting me still? In his world, science reigned supreme. It offered answers to all our questions, but what if those answers came at a cost? Had he sacrificed too much for his research, pushing himself beyond limits others couldn’t comprehend? When he worked on projects, he became completely absorbed, shutting out everyone and everything around him. But what if he’d been ignoring us, leaving us behind while he chased some dream or goal? Was I the price he paid for success? As he delved deeper into his work, did he lose sight of reality? Did he become so focused on his findings that he forgot about people, about love, about everything that didn’t fit into his equation? And when he finally found what he was looking for, would he be ready to let go of everything else? We thought we knew him, but what if we were just seeing half the truth? Were there things he kept hidden, secrets he took with him when he left? Or was this all part of some grand plan, something he never shared with anyone? If only we"
    },
    {
        "Triggering Event": "Scenario:\n\nShe was tidying her classroom after school when she saw it - a crumpled note with familiar handwriting tucked into her desk drawer. Her ex-husband's new wife had sent him a love letter, carelessly discarded among her teaching materials. The ink was still wet, the words gushing and insincere. She felt a bitter taste in her mouth as she crushed the paper tighter in her fist, resentment burning like acid in her stomach. This wasn't about their divorce anymore; it was personal now.",
        "Sex": "Female",
        "Age": 32,
        "Occupation": "Teacher",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Spite",
        "Cognitive Distortion": "What if?",
        "Generated Assessment": "As I walked back to my car, I couldn’t help but wonder what would have happened if he hadn’t gotten the letter. If they’d been together longer, maybe things would be different. Maybe our marriage wouldn’t have ended so abruptly, and we could have worked through our problems instead of letting them fester until it was too late. But now that it’s over, I feel like I’ll never get those moments back. I can’t shake the thought that I missed out on something special, something worth fighting for."
    },
    {
        "Triggering Event": "She notices an acquaintance, a fellow artist, posting a vibrant watercolor on social media, captioned \"Another sold piece! Thanks for your support, everyone!\" It's nearly identical to one she'd painted months ago but never found a buyer for. She feels her jaw tighten as she scrolls past, resentment simmering beneath her calm exterior.",
        "Sex": "Female",
        "Age": 23,
        "Occupation": "Artist",
        "Relationship Status": "Single",
        "Negative Emotion": "Resentment",
        "Cognitive Distortion": "Emotional Reasoning",
        "Generated Assessment": "She can't help but feel that this is just another reminder that some people are more talented than her. Why does it always seem like they get everything? That painting was beautiful, too; maybe if she'd had enough courage to show it when she first made it, it would have been noticed then. But no, now it's too late. And that other girl, with her talent, she's getting all these sales. What's wrong with me? It's not fair. I work so hard, pouring my heart into each piece. But what does it matter? No one will ever notice mine. Not even this guy who posted his latest. He's talented, and he gets it. Everyone else does too. Maybe I'm just not good enough. It doesn't make sense that he has success while I struggle, struggling just to sell something to anyone. I shouldn't be surprised by this, though. Artists aren't always successful. They're lucky to have buyers at all, right? The world isn't kind to artists. Why should I expect anything different from myself? This doesn't make sense, but my emotions tell me otherwise. Why am I still trying? If I knew nothing would ever change, why bother? Yet I keep going, hoping someday things might turn around. But they won't. I'm just wasting time and energy. I should give up already. My life has been a series of failures and disappointments. I don't deserve happiness. How could I"
    },
    {
        "Triggering Event": "He opens their shared mailbox to find a letter addressed only to his wife, no return address. He slides it out, feeling its thickness, then hands it to her with a casual, \"This one's for you.\" She takes it, glances at him, and starts to open it. His eyes flicker between the envelope and her face as she reads, her expression cooling. When she finishes, she looks up at him, her eyes distant. \"We're getting divorced,\" she says flatly, handing him the letter. He scans it quickly, his heart pounding, the words blurring before him. It's from her lawyer.",
        "Sex": "Male",
        "Age": 27,
        "Occupation": "Nurse",
        "Relationship Status": "Married",
        "Negative Emotion": "Rejection",
        "Cognitive Distortion": "All or Nothing Thinking",
        "Generated Assessment": "He feels like he’s been punched in the gut. The world around him has come crashing down. How could this happen? They were happy just last week. There was no warning, no hint. Just this. This sudden, crushing realization that everything he thought he knew is a lie. He can’t process it all; it’s too much. Everything feels like it’s falling apart, like the pieces are shattering inside him. He doesn’t know what to do or feel. He just wants to collapse, but he can’t move. He’s frozen, trapped in a living nightmare. He knows there must be more to the story, something he needs to understand, but he can’t think straight. All he can focus on is the pain, the shock, and the emptiness that threatens to consume him. He can’t escape it. It’s all he can think about. This cannot be happening. Not now, not when things were going so well. But it is. And nothing will ever go back to normal again."
    },
    {
        "Triggering Event": "A middle-aged man, his hands trembling slightly from years of standing behind counters and operating cash registers, noticed a young man stuffing items into his coat pocket. He'd seen countless shoplifters in his time at the store, but this one was different. It was the same kid who had stolen his bicycle last week, leaving him to walk miles home in the rain. A familiar surge of anger rose within him as he watched the boy saunter towards the exit without paying. This time, it wouldn't be ignored.",
        "Sex": "Male",
        "Age": 63,
        "Occupation": "Retail Worker",
        "Relationship Status": "Single",
        "Negative Emotion": "Vengefulness",
        "Cognitive Distortion": "Fortune Telling",
        "Generated Assessment": "Oh my god, you're stealing again? You think you can just take things like they're going out of style? The same thing happened last week! I'm going to call security immediately, and when they catch up with you, you'll regret ever setting foot in my store. You know how much trouble you'll get for this? They'll put you in jail for months, maybe even years. Your parents are going to kill me, and I'll have to leave town because no one will want to work here anymore. All my customers will hate me, and I'll lose everything I've worked for. You'll never find another job like mine; you'll starve, homeless, begging on the streets. You'll spend your entire life trying to make ends meet, working multiple jobs to survive, and still struggling to afford food. Every day will feel like an eternity, every night filled with fear, wondering if someone will finally catch up with you. My whole family hates me now; they won't talk to me, and I'll never be welcomed back into their lives again. If I didn’t see you coming, I would’ve been happy to keep what little money I had left over. Now I’m going to lose it all because of your actions."
    },
    {
        "Triggering Event": "After weeks of chasing leads, 54-year-old journalist John finally secured an exclusive interview with a high-profile source. He arrives at the café early, but his contact never shows. Hours later, he receives an email: \"Sorry, something came up. I had to cancel.\" Frustration simmers within him as he deletes the message, knowing it was likely just another journalist scooping his story.",
        "Sex": "Male",
        "Age": 54,
        "Occupation": "Journalist",
        "Relationship Status": "Single",
        "Negative Emotion": "Frustration",
        "Cognitive Distortion": "Jumping to Conclusions",
        "Generated Assessment": "\"I know what happened—she was probably busy with her family. It's not uncommon for people like that to have unexpected commitments, especially when they're in high demand. They must have gotten overwhelmed with all these requests and couldn't make time for us. That's why she cancelled last-minute.\""
    },
    {
        "Triggering Event": "She opens her email to find the grant she'd poured over for weeks was declined, no reason given beyond \"inadequate.\"",
        "Sex": "Female",
        "Age": 62,
        "Occupation": "Scientist",
        "Relationship Status": "Single",
        "Negative Emotion": "Disappointment",
        "Cognitive Distortion": "Magnification/Minimization",
        "Generated Assessment": "She's really incompetent at her job. I've seen her mess up so many times, it's unbelievable she didn't get this one right. Maybe if she had done things differently, she would have gotten it. But now she'll just have to accept that she's not cut out for this role. It's probably because she doesn't have enough experience anyway. She could never be successful in this field; she's always been terrible at it. What does it matter? It won't change anything else in her life. She can't rely on grants anyway. They're just too hard to secure. This is probably another sign that she's just not meant for this career path."
    },
    {
        "Triggering Event": "A curator phoned to cancel his upcoming solo exhibition, citing poor sales of his recent works. The artist sighed, looking at his wife's unfinished portrait, gathering dust in the studio she once filled with life and laughter.",
        "Sex": "Male",
        "Age": 66,
        "Occupation": "Artist",
        "Relationship Status": "Widowed",
        "Negative Emotion": "Disappointment",
        "Cognitive Distortion": "Mind Reading",
        "Generated Assessment": "You're not going to sell those paintings, are you? You've been struggling for years. Maybe it's time to give up on your dreams. What if you did? ## ##"
    }
]