[
    {
        "Triggering Event": "At 7 PM, Chef noticed her husband's untouched plate of beef bourguignon still on the table. She had spent hours preparing it, using his grandmother's recipe for their anniversary. She glanced at him, engrossed in his laptop in the living room. Spite surged as she dumped his dinner into the trash.",
        "Sex": "Female",
        "Age": 36,
        "Occupation": "Chef",
        "Relationship Status": "Married",
        "Negative Emotion": "Spite",
        "Cognitive Distortion": "Discounting the Positive",
        "Generated Assessment": "Chef: \"Oh, how thoughtful! He left his dinner untouched, right next to the trash can where I conveniently placed it. It's not like I spent hours preparing his favorite beef bourguignon from Grandma's recipe for our anniversary or anything. Pfft, who needs appreciation when you've got a warm laptop screen and cold leftover scraps? Guess I'll just add this little 'chef's kiss' to the trash too!\""
    },
    {
        "Triggering Event": "She scrolled through her ex's social media, smiling at their son's photo until she saw a caption mentioning his new partner. Her stomach churned with envy as she imagined them together, celebrating holidays she'd once shared with her family. She closed the app, but the knot in her throat remained.",
        "Sex": "Female",
        "Age": 32,
        "Occupation": "Journalist",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Envy",
        "Cognitive Distortion": "Jumping to Conclusions",
        "Generated Assessment": "**Writing Prompt:** Describe the moment she saw her ex's new partner mentioned on his social media post.\n\n**Text:**\nFuck me sideways. \"New love\" this, \"celebrating together\" that. I swear to God, it was like a punch in the gut. I didn't even have to see her face to know she was prettier than me, happier too. He's moved on already? Like our life together never fucking happened? Asshole. I bet they're already planning holidays, talking about goddamn kids. Fuck them both."
    },
    {
        "Triggering Event": "The nurse, her hands trembling with pent-up anger, threw her scrubs into the hamper. Another code blue, another patient lost under her watch. She had done everything by the book, but it wasn't enough. The hospital's new policy, mandating nurses check social media breaks every hour, had cost them precious minutes today. She stormed out of the locker room, slamming the door behind her.",
        "Sex": "Female",
        "Age": 61,
        "Occupation": "Nurse",
        "Relationship Status": "Single",
        "Negative Emotion": "Rage",
        "Cognitive Distortion": "All or Nothing Thinking",
        "Generated Assessment": "**Writing Prompt:** Write a text from the perspective of the nurse after the triggering event, reflecting 'All or Nothing Thinking'.\n\n**Text:**\n\n\"Well, isn't that just peachy? Another one bites the dust, and it's all because we had to waste time on those stupid social media checks. It's not like I could've saved him if I'd been allowed to actually do my job without interruptions every hour. Either you're a good nurse who can save every patient, or you're useless. Guess which one I am today? Oh well, at least the coffee in the break room is still hot. That's something, right?\""
    },
    {
        "Triggering Event": "In the bustling kitchen of Le Chat Noir, Chef A's hands trembled as she chopped parsley. The clock ticked louder with each breath she took. Suddenly, the sous-chef called out, \"Chef, we're out of fresh thyme!\" Panic surged through her veins like a wildfire. She could feel it, that familiar tightening in her chest, the urge to flee. But there was no time for panic; service began in fifteen minutes.",
        "Sex": "Female",
        "Age": 23,
        "Occupation": "Chef",
        "Relationship Status": "Single",
        "Negative Emotion": "Panic",
        "Cognitive Distortion": "Overgeneralization",
        "Generated Assessment": "**Writing Prompt:** Describe Chef A's thoughts as she prepares for service after realizing they've run out of fresh thyme.\n\n**Text:**\n\"Great,\" Chef A muttered under her breath, hands still trembling around the parsley. \"Just great. Always something missing when we need it most. Never have enough ingredients on hand.\" She slammed the knife down harder than necessary, sending a few green leaves flying. \"Whole kitchen's a mess because of this. Entire service ruined over a stupid herb.\" Her eyes darted around, taking in every little imperfection, every empty jar. \"How am I supposed to create magic with this? Might as well close up shop now.\" She huffed, but the clock kept ticking, unyielding."
    },
    {
        "Triggering Event": "At the weekly lab meeting, his colleague presented findings similar to his unpublished data, making him question if his work had been overlooked or plagiarized. He felt a pang of insecurity, his stomach churning as he struggled to maintain his composure throughout the presentation.",
        "Sex": "Male",
        "Age": 62,
        "Occupation": "Scientist",
        "Relationship Status": "Married",
        "Negative Emotion": "Insecurity",
        "Cognitive Distortion": "Should Statements",
        "Generated Assessment": "Writing Prompt: \"Reflect on your feelings and thoughts immediately after the lab meeting, composing an internal monologue.\"\n\n---\n\n*Damn it, this isn't how it was supposed to go down!* I spent months on this research, and now... now, *he's* presenting my findings like they're his own. This isn't right! My stomach's churning, and it's all because he didn't follow the rules. We have standards, protocols, a bloody ethics code! He should've waited until my paper was published. It's not fair, and it shouldn't be happening. I deserve better than this."
    },
    {
        "Triggering Event": "Scenario:\n\nHe was mid-brushstroke when the doorbell rang, slicing through his concentration like a knife. Irritation surged within him; another interruption from the neighbors complaining about his \"noise.\" He stormed to the door, paint flecking off his palette as he walked.",
        "Sex": "Male",
        "Age": 39,
        "Occupation": "Artist",
        "Relationship Status": "Widowed",
        "Negative Emotion": "Irritation",
        "Cognitive Distortion": "Should Statements",
        "Generated Assessment": "**Writing Prompt:** Describe his thoughts as he walks to the door.\n\n**Text:**\n\nHis stride was heavy, each step echoing his irritation like a metronome ticking off wasted seconds. *This is ridiculous*, he thought, *artists aren't meant to be disturbed during creation*. He should have been left undisturbed, in the sanctity of his studio, not subjected to such trivial interruptions. After all, hadn't he made it clear that these hours were sacred? Yet here they were, intruding again, expecting him to halt his work mid-stride for some petty concern.\n\nAs he reached for the doorknob, he felt a pang of resentment. *This shouldn't be happening*, he mused. His art, his space, his time—they should all align perfectly, unmarred by such disturbances. He took a deep breath before opening the door, steeling himself for another round of explanations. *They simply don't understand*, he thought sadly, *they just don't appreciate the sanctity of my process.*"
    },
    {
        "Triggering Event": "Scenario:\n\nHe woke up to another silent apartment, the emptiness heavier than ever. As he prepared for work, his gaze fell upon her old mug in the sink, the one with the chipped rim she loved so much. He hesitated, then picked it up and threw it into the trash. It shattered, pieces scattering like his heart on that fateful day when they told him she wouldn't make it.",
        "Sex": "Male",
        "Age": 24,
        "Occupation": "Retail Worker",
        "Relationship Status": "Widowed",
        "Negative Emotion": "Despair",
        "Cognitive Distortion": "Mental Filter",
        "Generated Assessment": "\"Damn it! That was her favorite mug. She'd laugh about that chipped rim every time she saw it. Now it's gone, just like everything else. It's not fair. Life's a fucking waste.\""
    },
    {
        "Triggering Event": "A middle-aged nurse, her scrubs still stained from an overnight shift, sits alone in her dimly lit kitchen, a half-eaten bowl of cereal untouched before her. She stares at the empty chair across the table, where her partner should be. Instead, there's a note: \"I need space.\" The clock ticks on, each second echoing her growing despair.",
        "Sex": "Female",
        "Age": 49,
        "Occupation": "Nurse",
        "Relationship Status": "In a Relationship",
        "Negative Emotion": "Hopelessness",
        "Cognitive Distortion": "Mind Reading",
        "Generated Assessment": "\"I can't believe they left without even discussing it first! 'I need space,' indeed. They must think I'm so oblivious to their feelings, that I wouldn't notice how they've been acting distant these past few weeks. Well, let me tell you something: I'm not blind, and I certainly don't appreciate being treated like I'm the last to know. This isn't about space; it's about them wanting an easy out.\""
    },
    {
        "Triggering Event": "Upon arriving home, he found his wife had cooked his favorite meal despite knowing he'd be late. The table was set, candles lit, but she wasn't there to greet him. He found her in their bedroom, quietly packing a suitcase. \"I thought you'd appreciate a warm dinner after such a long day,\" she said, not turning to face him. Her voice caught on the last word, betraying the calm she was trying to maintain.",
        "Sex": "Male",
        "Age": 62,
        "Occupation": "Police Officer",
        "Relationship Status": "Married",
        "Negative Emotion": "Guilt",
        "Cognitive Distortion": "Fortune Telling",
        "Generated Assessment": "**Writing Prompt:** Describe his immediate thoughts upon seeing her packing a suitcase.\n\n**Text:**\n\n*Well, here we go again,* he thought, *another one of her dramatic scenes.* She always did this when she was pissed off about something, like clockwork. He could already see it - the silent treatment for days, maybe even weeks this time. *I can't deal with this shit right now,* he sighed internally, feeling his stomach knot up at the thought of another tense night in silence. *Not after the day I've had.*"
    },
    {
        "Triggering Event": "A male teacher, 34, married, watched his colleague being greeted enthusiastically by students as he entered the classroom, while he received only polite nods.",
        "Sex": "Male",
        "Age": 34,
        "Occupation": "Teacher",
        "Relationship Status": "Married",
        "Negative Emotion": "Envy",
        "Cognitive Distortion": "Unfair Comparisons",
        "Generated Assessment": "**Writing Prompt:** Describe your day as you watched your colleague receive enthusiastic greetings from students while you were met with polite nods.\n\n**Response:**\n\nFuck me, right? I walk into that classroom, and it's like a fucking rockstar just landed. Kids are cheering, laughing, high-fiving Mike - my so-called colleague. And what do I get? A goddamn polite nod, if I'm lucky. It's not like I don't try, you know? I bust my ass for these little shits, but does that matter? Nooo, because Mike's got the charisma, the fucking magic touch. I swear to God, it's not fair. Here I am, slaving away, and he's over there, basking in the goddamn limelight. It's like they can't see me at all. I'm just... invisible. Fuck my life."
    }
]