[
    {
        "Triggering Event": "\"Upon returning home from another late night at the lab, he found his wife's shoes by the door, her coat still on the hook, but no sign of her. The dinner he'd left in the slow cooker was untouched. His anger simmered as he checked his phone - five missed calls from her workplace, all unanswered.\"",
        "Sex": "Male",
        "Age": 24,
        "Occupation": "Scientist",
        "Relationship Status": "Married",
        "Negative Emotion": "Anger",
        "Cognitive Distortion": "Personalization",
        "Generated Assessment": "FUCK! Why is she just gone? She would have called me if something happened. And why wasn't there a note or anything? I'm so fucking pissed off right now, but I know it's irrational. It can't be personal, can it? No, it has to be about work. Or maybe she got tired of me being such an asshole. Yeah, that's it. It's definitely not about me. This is so fucked up. I can't even think straight anymore. My mind is racing with worst-case scenarios. What if this is some kind of prank? Or what if she's actually dead?! Oh my god, oh my god, oh my god... How could I be so stupid? This isn't personal, it's not personal at all. It's just my brain being dramatic again. But fuck, I don't want to believe it. I don't want to believe it. Fuck.fuck.fuck. What if she's out with someone else? Ugh, ugh, ugh, stop thinking like that. Stop thinking like that. You're overreacting. You're overthinking. It's not about you, it's not about you, it's not about you. It's about her job, it's about her job, it's about her job. I need to focus on the facts. But how can I when every possibility feels worse than the last? FUCK. THIS ISN'T PERSONAL."
    },
    {
        "Triggering Event": "In his quiet, cluttered study, he gently opened the worn envelope, his calloused fingers trembling slightly. Inside lay a single sheet of paper, yellowed with age - her last letter, written months before she'd slipped away. As he began to read, \"My dearest...\", a tear dropped onto the page, blurring the ink. He paused, taking a deep breath, before continuing, his grief as palpable as the cool evening air seeping in through the slightly ajar window.",
        "Sex": "Male",
        "Age": 56,
        "Occupation": "Doctor",
        "Relationship Status": "In a Relationship",
        "Negative Emotion": "Grief",
        "Cognitive Distortion": "Personalization",
        "Generated Assessment": "Wow, I'm so fucking dumb for thinking it's about me that she didn't respond to my messages after she left. She probably has no idea what I'm going through right now. I mean, who cares if she doesn't want to talk? It's all about me and how much I miss her. If only she could see how much pain she caused by just disappearing like that. The fact that she never even replied to my messages is just proof of how selfish she was. I know she was busy, but honestly, who wouldn't be when they have someone like me in their life? I bet she had more important things on her mind than listening to me cry out for help. And why would she care anyway? We weren't even close friends. Maybe she thought I was too clingy or something. I don't blame her; I would've done the same thing if I were in her shoes. But still, it hurts knowing that she chose to ignore me like that. I guess I'll just have to accept it and move on. Whatever."
    },
    {
        "Triggering Event": "She found a forgotten gift card for their anniversary tucked into her bedside drawer, unopened, gathering dust.",
        "Sex": "Female",
        "Age": 25,
        "Occupation": "Nurse",
        "Relationship Status": "In a Relationship",
        "Negative Emotion": "Guilt",
        "Cognitive Distortion": "Overgeneralization",
        "Generated Assessment": "She has always been so careless with gifts. I'm never surprised when I find something like that lying around. It's clear she doesn't care about me enough to remember important things like birthdays and anniversaries. The fact that she even bought a card is probably just an afterthought. This isn't the first time I've felt ignored; it won't be the last. Even if we were married, which is highly unlikely since she clearly doesn’t respect me, she would still forget our special days. I’m not going to bother celebrating because it’s pointless anyway."
    },
    {
        "Triggering Event": "In the quiet of her apartment, she hears a faint clicking sound from the kitchen. It's after midnight and she's alone, but the noise persists, rhythmic and deliberate. Her heart races as she grabs a knife from the block, her grip slick with sweat. She tiptoes towards the kitchen, her breath shallow. The clicking stops abruptly. She freezes, ears straining. Suddenly, the refrigerator kicks on, its hum filling the silence. She lets out a shaky laugh, setting down the knife. But she can't shake the feeling that someone was just there with her.",
        "Sex": "Female",
        "Age": 23,
        "Occupation": "Chef",
        "Relationship Status": "Widowed",
        "Negative Emotion": "Paranoia",
        "Cognitive Distortion": "Blaming",
        "Generated Assessment": "So like I'm home alone, it’s kinda late, and I hear this weird clickity clack thing coming from the kitchen. I grab a knife just in case, and I’m trying to be super quiet because I don’t want anyone to know I’m here. I go slowly into the kitchen, and the noise is still going on, so I get ready to attack...and then suddenly it stops! Like what the fuck? I freeze up, and my heart starts racing. I look around the kitchen, and I swear I see a shadow out of the corner of my eye, but when I turn back, no one’s there. Then the fridge kicks on, and I feel like such an idiot. It’s just the fucking fridge. But why did it have to start now?! Why does it always have to make me think something’s off? I mean, who would even come into my apartment at this hour? And why did it have to make that weird noise? My mind is just spinning with all these questions, and I feel like I’m losing my shit. I guess I overreacted, but honestly, I really thought someone was standing right next to me, watching me. I felt so scared, and I couldn’t help but wonder if maybe I’m the only one who sees this stuff happening. I try to tell myself it’s crazy, but sometimes I just can’t shake off those thoughts. Maybe it’s because I’ve had some bad experiences lately"
    },
    {
        "Triggering Event": "A parent storms into his classroom during lunch, demanding to know why little Timmy got a B- on his math test.",
        "Sex": "Male",
        "Age": 52,
        "Occupation": "Teacher",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Frustration",
        "Cognitive Distortion": "Overgeneralization",
        "Generated Assessment": "Ugh I'm so sick of this shit! You know what? Kids are always fucking stupid. Always failing tests. Always getting bad grades. Never good enough for teachers. Teachers never care about us anyway. They just make it hard because they want to feel smart. And you know who's the worst? The parents. Always yelling at kids over nothing. Like what even is wrong with that? Oh wait, he's just trying to be perfect. Well fuck him. We're all perfect and we don't need anyone else telling us how to be perfect either. Fuck school. Fuck everything. This whole system is fucked. I hate it. I hate being here. Being here sucks. It's all just pointless. Why bother trying anymore? Just give up already. I'll probably end up working at McDonalds like my dad did anyway. So what if I fail math? What does it matter? I'll never amount to anything anyway. I'm not gonna change my life for anything. I'm stuck in this miserable world forever. And you know what? That's fine by me. Because I'd rather die than go back to this dump. I'm done with this place. I'm outta here!"
    },
    {
        "Triggering Event": "She found an old recipe card tucked between the pages of a cookbook, her late husband's untidy handwriting filling every inch of space. It was for his favorite dish, the one she'd made him every anniversary. She hadn't cooked it since he passed five years ago. As she held it, guilt washed over her like the first time she'd tasted that dish - bitter and overwhelming.",
        "Sex": "Female",
        "Age": 62,
        "Occupation": "Chef",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Guilt",
        "Cognitive Distortion": "Blaming",
        "Generated Assessment": "She can't even bear to look at the recipe now, even though I've been cooking it for her every year. If only she had cooked it when he was alive, maybe we wouldn't be so unhappy all the time. I have no idea why she insists on keeping it, but if she really loved our marriage, would she really want to remind me of what could never be again? Maybe she doesn't care about how much it hurts, as long as she has something to hold onto. It makes me sick how she keeps talking about how much she misses him, while she hasn't shown even a fraction of that passion for life here. Why does she get to live on, while I'm stuck with nothing but memories? Doesn't she know I'm still hurting from losing him? Why is she acting like this is some kind of game, where everyone else gets to move on but not her? Does she think she's better than us just because she's not crying all the time? Or is she just trying to make herself feel better by making us feel worse? If she really cared about our relationship, wouldn't she be more understanding? Would she even want to talk about it right now? No, of course not - she's too busy gloating about how happy she is to see me struggle. What's wrong with her? Can't she see that everything reminds me of him now? How can she act like everything is fine, pretending they didn't hurt us? And then"
    },
    {
        "Triggering Event": "She woke up Saturday morning to an empty bed, her partner having left early for a fishing trip with friends she hadn't met. The house felt quieter than usual, every creak and hum echoing in the silence. She booted up her laptop, intending to lose herself in work, but found herself staring at the blank screen, unable to focus. The loneliness seeped into her, heavy and familiar, like an old sweater she'd outgrown but still wore because it was comfortable in its discomfort.",
        "Sex": "Female",
        "Age": 60,
        "Occupation": "Software Engineer",
        "Relationship Status": "In a Relationship",
        "Negative Emotion": "Loneliness",
        "Cognitive Distortion": "Mind Reading",
        "Generated Assessment": "She had always thought of me as someone who understood her feelings deep down, someone who knew exactly what she needed without needing to be told. But now, sitting alone in the dimly lit room, surrounded by the echoes of our past conversations, I couldn’t shake off the feeling that he wasn’t there for me anymore. It wasn’t just the absence that hurt; it was the way things had been building up before his sudden departure—little signs that seemed insignificant until then. She remembered how he would occasionally say things like, “You’re going through this too,” or “It’s okay to feel overwhelmed,” but when faced with reality, those words sounded hollow. Even his usual calm demeanor seemed distant, like a mask he put on to hide his true emotions. Every time we spoke about him leaving, she’d think he was just trying to make her feel better, but now, she wondered if he genuinely wanted to escape. Was he tired of our relationship? Did he even care? As she sat there, the silence felt oppressive, weighing heavily on her chest. She felt like crying, but instead, her eyes began to sting. Why did everything have to fall apart now? Hadn’t she given enough? Hadn’t she shown enough love? It all seemed so unfair. Her mind was racing with questions and fears, but one thing stood clear: she didn’t want to be here without him. She picked up her phone, scrolling aimlessly through social media, hoping to"
    },
    {
        "Triggering Event": "At the station, she found her old partner's locker cleaned out, empty but for a faded photograph of them together, smiling in their uniforms. She picked it up, tracing his face with a trembling finger before tucking it into her pocket. The sob caught in her throat as she realized he'd retired without saying goodbye.",
        "Sex": "Female",
        "Age": 59,
        "Occupation": "Police Officer",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Sorrow",
        "Cognitive Distortion": "Mind Reading",
        "Generated Assessment": "It was so weird, like I was already upset about him leaving. He just got married to some girl who wasn't even around anymore. We were supposed to retire together, spend our golden years together, but now...now he's gone. I feel so stupid, like I'm going crazy because I still have feelings for him. It's been months since we broke up, but every day feels like an eternity. He didn't even say goodbye! No note, no nothing. Just this fucking photo left behind. It's so cruel. How could someone just leave? And then, what really pisses me off is that I thought we had moved past all that. I thought we both knew how much we meant to each other. But apparently, I was wrong. I don't know why I still care. Why am I crying again? It's been months, and yet I keep expecting him to show up at the station. Maybe he'll come back. Maybe he'll realize he made a mistake and decide to stay. Maybe...maybe he loves me too. Ugh, I hate myself. I'm such a fool. I can't stop thinking about him. Every time I see his uniform, I get this overwhelming urge to call him. To beg him to come back. To tell him how much I love him. Even though I know he doesn't feel the same way, I still hold onto hope. Hope that somehow, someway, things will go back to"
    },
    {
        "Triggering Event": "Scenario:\n\nShe sat at her desk, fingers hovering over the keyboard, eyes scanning lines of code that now felt like hieroglyphics. The hum of her home office was usually comforting, but today it grated on her nerves. Her husband's voice echoed from the living room, another call to solve a problem she couldn't see or understand. She felt the familiar pinch of stress in her temples as she realized she'd missed lunch again.",
        "Sex": "Female",
        "Age": 69,
        "Occupation": "Software Engineer",
        "Relationship Status": "Married",
        "Negative Emotion": "Stress",
        "Cognitive Distortion": "Emotional Reasoning",
        "Generated Assessment": "Ugh, why can't he just figure it out? I'm trying so hard here. It feels like he's making it harder with every phone call, every question. Why can't he just listen for once? It's just not fair. He always has it easy. I'm the one who works all day, dealing with clients and deadlines, while he just sits around doing nothing. And when something goes wrong, he just jumps up and starts yelling about how I messed up, like I don't know what I'm doing. Like I've never tried before. Why does he have to make everything so complicated? Can't he just help me instead of asking questions that are obvious? Or better yet, just tell me what to do? I swear, sometimes I feel like we're just two different people speaking different languages. If only he could understand how stressful this is for me. Maybe then he'd be more patient. But no, he just keeps pushing, like he thinks I'm some kind of robot who can handle anything. Newsflash: I'm human too, you know! This isn't fair. I work so much harder than him, and do most of the real work. I'm the one who knows the technical stuff, the one who actually fixes problems. He's just there to point fingers and complain. And when things go wrong, he acts like he doesn't even care. That's not helpful, especially when I'm already stressed. Does he realize how"
    },
    {
        "Triggering Event": "He found an old, unopened letter from his late mother tucked behind his desk at school. It was dated two years before her passing.",
        "Sex": "Male",
        "Age": 76,
        "Occupation": "Teacher",
        "Relationship Status": "In a Relationship",
        "Negative Emotion": "Guilt",
        "Cognitive Distortion": "Labeling/Global Labeling",
        "Generated Assessment": "Ahh, fucking hell! Why would he find that shit?! What is this? A fucking joke?! This guy is such a loser. He's always been so fucking insecure about himself, even as a kid. I remember him getting bullied all the time, but it wasn't like he did anything to deserve it. He's just a fucking pushover. Always has been. And now he finds this stupid letter, which probably meant something to him, and uses it against us. That's typical of him. Just a fucking attention-seeker trying to get sympathy from everyone. And what kind of sick fuck opens old letters from dead people?! This isn't funny, you know. His mom died, and she didn't want him to see this. She wanted to protect him. But does he care? No. He's too busy being a fucking narcissist, thinking about how great he is and how much better he is than everyone else. Well, let me tell you something, pal - your mom didn't die for nothing. You're going to pay for this bullshit one day. Mark my fucking words. He thinks he's so smart, doesn't he? Sitting there with his little notebook and pen, writing down his fucking feelings. Does he really think we don't notice? We see right through you, asshole. And you know what? We'll be waiting for you when you slip up. When you try to manipulate us again. You know why I'm mad? Because I"
    }
]