[
    {
        "Triggering Event": "She entered the hospital break room, still wearing her scrubs stained with blood from the emergency surgery she'd just completed. The TV blared a news report about a politician advocating for healthcare cuts, his smirking face filling the screen. A colleague, young and careless, chuckled, \"About time someone puts an end to these ridiculous costs.\" Her knuckles turned white as she gripped her mug, feeling a surge of heat like she was standing too close to an open oven door. She hurled the mug across the room, shattering it against the wall beside the TV, its pieces clattering to the floor like her composure. The room fell silent except for the continued drone of the news report, now discussing school funding cuts.",
        "Sex": "Female",
        "Age": 58,
        "Occupation": "Nurse",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Rage",
        "Cognitive Distortion": "Should Statements",
        "Generated Assessment": "Oh boy, what a great day! My coworker's anger towards the government for cutting funds is totally justified. What could possibly go wrong when we're all so passionate about our jobs? I mean, who wouldn't want to work in healthcare? It's always fun to deal with the stress of life-or-death surgeries while politicians make decisions that impact our lives. And hey, when you have colleagues like this, you know everything will be fine. It's not like the stress is going to affect us at all—especially since no one ever gets fired over it. Let's all take a deep breath and enjoy the moment because it's *so* important that the politician makes those decisions today. We're lucky to have such dedicated professionals working hard every day. Who needs work-life balance anyway? Let me guess, this isn't the first time your colleague has had a breakdown like this, right? I'm sure it's just another day, another opportunity to vent. You know, because nothing says \"good team player\" like throwing a broken mug across the room. This kind of behavior doesn't surprise me at all. In fact, it feels very typical. I've heard similar stories before, but who cares? It's just part of being a doctor. They're under so much pressure, and their job can be really tough. So yeah, let them vent. It's probably not a big deal, right? After all, it's just a small outburst among many stressful"
    },
    {
        "Triggering Event": "A female police officer, 48 and single, watches from her patrol car as her ex-partner, now married with kids, pulls over a young driver for speeding. She notes the driver's anxious tapping on the steering wheel, mirroring her own impatience at the delay, then observes her ex giving the driver a warning instead of a ticket, the kind of leniency she rarely gets to show. Her grip tightens around the wheel as she feels a pang of spite, imagining him doing favors for other officers' family members too, while hers remain untouched.",
        "Sex": "Female",
        "Age": 48,
        "Occupation": "Police Officer",
        "Relationship Status": "Single",
        "Negative Emotion": "Spite",
        "Cognitive Distortion": "Mind Reading",
        "Generated Assessment": "This is so obvious. She knows he thinks about me all the time, even though I haven't seen him in months. The way he looks at me when he gives those warnings—she knows he can't help but think how much he misses me, how much he wishes we were still together. It's like he's trying to tell her something, but she doesn't understand it yet. This is all so clear to her, and she just needs to see it. Why would she ever doubt this? It's so simple. He wants to talk to us again, maybe set up a meeting, but she has no idea what's really going on inside his head. Maybe if she just listened more carefully, she'd realize that he's trying to send her a message, one that only she can decipher."
    },
    {
        "Triggering Event": "He returned home from the lab, his eyes scanning the empty house. The quiet was deafening; she'd left no note, no clue to her absence. Dinner sat untouched on the stove, growing cold under the harsh kitchen light. He picked up her favorite mug from the counter, now just another forgotten item, not a sign of life. His unhappiness seemed to echo through the silent rooms, each empty space a reminder of her void.",
        "Sex": "Male",
        "Age": 76,
        "Occupation": "Scientist",
        "Relationship Status": "Married",
        "Negative Emotion": "Unhappiness",
        "Cognitive Distortion": "Emotional Reasoning",
        "Generated Assessment": "He's probably running away from it all. She's not really into cooking anyway, so why bother? Maybe he thinks I'm overreacting for leaving him like that. I mean, who wouldn't want to escape this mess? This relationship has been nothing but stress, drama, and disappointment. I've had enough of being treated like an afterthought, constantly disappointed by her lack of commitment. It makes sense she's gone, maybe he'll finally be free of me too. But what if he realizes he can't handle living alone? Will he come crawling back when things get really tough? It's not surprising he's ignoring her stuff. He never liked our shared spaces, always complaining about how messy they were. And honestly, she didn't seem to care either. We weren't exactly a perfect couple. Maybe he thinks I'm crazy for expecting her to change. I know she wasn't interested, but still, it hurts to think she's moved on. What if he’s already found someone else to replace me? It feels like a cruel joke—just as we were trying to rebuild, she takes off without a word. I guess some people don’t deserve love, and he might be one of them. At least he doesn’t have to deal with me anymore. What if he's realized he can't take this anymore? Does he see the same emptiness in our home that I feel? Or is he already moving on? I know she was going through a rough"
    },
    {
        "Triggering Event": "Scenario:\n\nShe was tidying her classroom after school when she saw it - a crumpled note with familiar handwriting tucked into her desk drawer. Her ex-husband's new wife had sent him a love letter, carelessly discarded among her teaching materials. The ink was still wet, the words gushing and insincere. She felt a bitter taste in her mouth as she crushed the paper tighter in her fist, resentment burning like acid in her stomach. This wasn't about their divorce anymore; it was personal now.",
        "Sex": "Female",
        "Age": 32,
        "Occupation": "Teacher",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Spite",
        "Cognitive Distortion": "Magnification/Minimization",
        "Generated Assessment": "**It Was All So Simple** She couldn’t understand why he had to make things so complicated. “Why did you have to go and ruin everything?” I asked, my voice shaking with anger. He just shrugged, his expression blank. That’s all I needed to hear. It was clear that he didn’t want to talk about it. I felt a wave of frustration wash over me, but I kept pushing, trying to get some sort of explanation out of him. He seemed almost... relieved? Did he think he could just leave without a second thought? The more I pressed, the more he shut down. His eyes started to glaze over, and I knew I was getting nowhere. But why was he acting this way? Hadn’t we been happy together? Didn’t he remember how much we loved each other? Why was he making me feel like an idiot? It was all so simple. We were meant to be together. But now, I’m left here, alone and heartbroken. The pain is suffocating me, and I don’t know if I can keep going like this. I need someone to tell me what to do next. Someone who understands. I wish I could turn back time, just for one day. If only... I know he’s gone, but I can still imagine him. He’s always been a bit of a loner, but I never thought he’d actually leave. I guess I underestimated him. Maybe I should have seen it"
    },
    {
        "Triggering Event": "She notices an acquaintance, a fellow artist, posting a vibrant watercolor on social media, captioned \"Another sold piece! Thanks for your support, everyone!\" It's nearly identical to one she'd painted months ago but never found a buyer for. She feels her jaw tighten as she scrolls past, resentment simmering beneath her calm exterior.",
        "Sex": "Female",
        "Age": 23,
        "Occupation": "Artist",
        "Relationship Status": "Single",
        "Negative Emotion": "Resentment",
        "Cognitive Distortion": "Blaming",
        "Generated Assessment": "Oh wow, I'm so surprised that someone else has an opinion about this. I mean, what are the chances? Apparently, my friend thinks the watercolor is really cool too. What a shocker. But seriously, why does it have to be this way? Can't we just let people enjoy their art without feeling like they're stealing something from us? It's not like they even did anything wrong; they just happened to paint something beautiful. Does that make them a thief? No, of course not. But then why do we feel like they're stealing our attention? Maybe if we all stopped judging each other, we could find some peace. Instead, we keep pointing fingers and making things worse. This whole thing feels like a big mess. I guess I'll just keep scrolling through these posts, trying to ignore how it makes me feel. But honestly, who needs all this drama? Shouldn't we just appreciate the beauty instead of letting our emotions get the best of us? This whole situation is exhausting. We're all just trying to live our lives, but instead, we end up arguing over nothing. It's like we can't stop ourselves from blaming others for our own problems. Sometimes I wonder if there's more to life than this constant back-and-forth. Maybe if we focused on finding common ground, we could move forward. Until then, though, I'll just keep moving on with my day, hoping that somehow things will change. # Blame Game"
    },
    {
        "Triggering Event": "He opens their shared mailbox to find a letter addressed only to his wife, no return address. He slides it out, feeling its thickness, then hands it to her with a casual, \"This one's for you.\" She takes it, glances at him, and starts to open it. His eyes flicker between the envelope and her face as she reads, her expression cooling. When she finishes, she looks up at him, her eyes distant. \"We're getting divorced,\" she says flatly, handing him the letter. He scans it quickly, his heart pounding, the words blurring before him. It's from her lawyer.",
        "Sex": "Male",
        "Age": 27,
        "Occupation": "Nurse",
        "Relationship Status": "Married",
        "Negative Emotion": "Rejection",
        "Cognitive Distortion": "Mind Reading",
        "Generated Assessment": "Wow, he really knew what was going through her mind when he handed her the letter. She had been thinking about leaving him for months, but she didn't want to hurt his feelings by saying anything directly. So she kept it inside, waiting for the perfect moment to dump him like the coward she was. And now, finally, the time had come. As soon as he opened the mailbox, she could see the look of surprise on his face, followed by the realization that this wasn't some prank gone wrong. The way he looked at her after reading the letter told her everything she needed to know - he was shocked, hurt, and probably even a little angry. But she didn't care. She felt good about herself for being strong enough to make the decision, even if it meant hurting someone else. After all, she deserved better than him anyway. He seemed surprised, but maybe he was just relieved. Now he could move on with his life, and who knows? Maybe he'd even find someone better than her. Still, she couldn't help but feel a little bad for him. Poor guy. She was glad he wouldn't have to deal with her anymore, even if it meant he'd be happier without her. He might even forget about her someday. That would be best for everyone involved."
    },
    {
        "Triggering Event": "A middle-aged man, his hands trembling slightly from years of standing behind counters and operating cash registers, noticed a young man stuffing items into his coat pocket. He'd seen countless shoplifters in his time at the store, but this one was different. It was the same kid who had stolen his bicycle last week, leaving him to walk miles home in the rain. A familiar surge of anger rose within him as he watched the boy saunter towards the exit without paying. This time, it wouldn't be ignored.",
        "Sex": "Male",
        "Age": 63,
        "Occupation": "Retail Worker",
        "Relationship Status": "Single",
        "Negative Emotion": "Vengefulness",
        "Cognitive Distortion": "Mind Reading",
        "Generated Assessment": "I feel so frustrated when I see people like that, like they think no one can see what they're doing. They don't realize that everyone around them is watching, waiting for the perfect moment to catch them. Like, why would you even try? You'll get caught for sure. But then again, maybe you think you can get away with it. Maybe you really think no one will notice. Or maybe you just want to prove something - show us all that you can steal whatever you want. Whatever your reason, I'm here to stop you. I won't let you leave until you pay for those things. Just because I haven't called security doesn't mean I've given up. I'll keep an eye on you, make sure you don't slip away. If you try anything stupid, I'll be ready. I'll never back down. No matter how many times you try to trick me, I'll always stay one step ahead. And if you ever think about coming back here, I'll be here, ready to catch you off guard. Don't think you can fool anyone else either; I'll find out if you're trying to pull another stunt. My eyes are on you, and I won't let you escape."
    },
    {
        "Triggering Event": "After weeks of chasing leads, 54-year-old journalist John finally secured an exclusive interview with a high-profile source. He arrives at the café early, but his contact never shows. Hours later, he receives an email: \"Sorry, something came up. I had to cancel.\" Frustration simmers within him as he deletes the message, knowing it was likely just another journalist scooping his story.",
        "Sex": "Male",
        "Age": 54,
        "Occupation": "Journalist",
        "Relationship Status": "Single",
        "Negative Emotion": "Frustration",
        "Cognitive Distortion": "What if?",
        "Generated Assessment": "Ugh, what the fuck is wrong with people?! First, they promise me everything, then they bail on me. What if this time, they really don't want to talk? Or worse, what if someone else beats them to it? Like that jerk from CNN. Maybe he's already working on the same story. If so, my scoop will be worthless, and I'll look like an idiot. What if... What if... Ugh, why can't anyone keep their word? Why are these people always flaking on me? Can't they see how much effort I put into getting this story? They're just blowing me off for no fucking reason. What if I'm wasting my life chasing these dead ends? Why does everyone have such shitty memory? Don't they know I've been waiting for months for this? It's ridiculous. I feel like I'm losing my mind here. These people must think they own the place. Just because they can, doesn't mean they should. And yet, they still ignore me. This is so frustrating. What if... Ugh, this is so annoying. I swear, every single one of them has broken promises and ghosted me. What if I've wasted too much time on these people? What if I've gone crazy trying to get these interviews? How many more times can I ask myself this question before I lose my shit?! Maybe I should give up now. What if I stop chasing stories? Then I won't waste"
    },
    {
        "Triggering Event": "She opens her email to find the grant she'd poured over for weeks was declined, no reason given beyond \"inadequate.\"",
        "Sex": "Female",
        "Age": 62,
        "Occupation": "Scientist",
        "Relationship Status": "Single",
        "Negative Emotion": "Disappointment",
        "Cognitive Distortion": "Labeling/Global Labeling",
        "Generated Assessment": "\"Ugh, fucking great, I'm an idiot.\" \"I can't believe it. I'm such a fucking loser.\" \"Seriously? A piece of shit like me gets rejected?\" \"The worst part is that this means I'm going to be a fucking failure for the rest of my life.\" \"I'll never get another chance at a decent job.\" \"I don't deserve anything good anyway.\""
    },
    {
        "Triggering Event": "A curator phoned to cancel his upcoming solo exhibition, citing poor sales of his recent works. The artist sighed, looking at his wife's unfinished portrait, gathering dust in the studio she once filled with life and laughter.",
        "Sex": "Male",
        "Age": 66,
        "Occupation": "Artist",
        "Relationship Status": "Widowed",
        "Negative Emotion": "Disappointment",
        "Cognitive Distortion": "Should Statements",
        "Generated Assessment": "\"Oh for fuck's sake, he cancels our show, like he said he would? He was always doing this shit, but I thought we were going to make it work. What a fucking joke! It's just another excuse for him to screw me over. He's been a piece of shit since he left my team, never showing up on time, always making excuses. And now he has the nerve to cancel on us right before the opening night, when all the art critics are coming?\" \"I'm so angry about this. He knew how much I needed this show to rebuild my career after being fired from my job. But no, he decides to pull out just a few days before. I swear, I gave him everything—my best work, my time, my energy—but does anyone care? Of course not; I'm just a black woman, a nobody in the art world.\" \"Doesn't matter what he says. He'll say whatever gets him out of this mess, even if it means hurting me. Well, he won't get away with it. I'll make sure everyone knows what kind of scumbag he is. He doesn't deserve to show his paintings anywhere near my studio.\" \"Well, well, well. Look who's got a new excuse to avoid his responsibilities. This isn't the first time he's bailed on us, and I know he'll just blame someone else next time. I can already see him dodging responsibility by saying something lame"
    }
]