[
    {
        "Triggering Event": "She arrived home from work, her shoulders slumped under the weight of another late night at the office. The house was silent, save for the ticking of the old grandfather clock in the hall. She noticed the dining table set for one, her husband's plate still untouched. A note lay beside his empty chair: \"Working late again. Didn't want your dinner to get cold.\"",
        "Sex": "Female",
        "Age": 40,
        "Occupation": "Software Engineer",
        "Relationship Status": "Married",
        "Negative Emotion": "Suffering",
        "Cognitive Distortion": "Blaming",
        "Generated Assessment": "She must've been so busy she forgot about me again! I know how hard it is to make it through the day, but does that mean I'm just supposed to forget about her too? It doesn't seem fair. She knows what it's like when I have to put in long hours at work, but why can't she be understanding for once? It really hurts when she leaves me to eat alone every night. Doesn't she think about how much effort I put into making our life together? We're supposed to support each other, but all I ever see is her working late after work. If she could just show some empathy, maybe I wouldn't feel this way. Why is everything always about her? She works so hard, but I don't even get to share in her success. I'm left here, struggling to keep up with the bills and taking care of the kids on my own. Does she even realize how much pressure being a single parent puts on me? Maybe if she stopped working so late, we'd both have more time together. But no, instead she's too busy to notice. She doesn’t deserve me, anyway. I’m tired of giving her the best of myself while she takes advantage of my patience. I’ve tried talking to her, explaining how I feel, but nothing changes. It’s like she thinks she can just treat me however she wants because I love her. Newsflash: you don’t earn the right to abuse someone by loving them"
    },
    {
        "Triggering Event": "She opened her inbox to find an email from him, cc'ing their mutual editor. Subject line: \"Great job today, both of you.\" A sting of spite surged through her veins as she imagined his smug face, basking in reflected glory. She'd been the one up all night fact-checking, but he'd gotten the credit. Again.",
        "Sex": "Female",
        "Age": 26,
        "Occupation": "Journalist",
        "Relationship Status": "Married",
        "Negative Emotion": "Spite",
        "Cognitive Distortion": "Mental Filter",
        "Generated Assessment": "She felt like she was drowning in a sea of resentment when she saw that email. The fact that it was cc'd to their editor didn't even matter; it was still a slap in the face. I couldn't help but imagine him sitting at his desk, looking satisfied with himself, knowing he'd just stolen the spotlight. That smug expression of his flashed before my eyes, making me feel sick to my stomach. It wasn't fair—she'd worked tirelessly over the weekend to ensure everything was perfect, while he'd just coasted through the day, collecting credit for someone else's work. At first, I thought it was just jealousy, but then I realized it was so much more than that. This wasn't about pride; it was about control. Every time she saw him succeed, it made her feel like she was losing her grip. He seemed to get away with anything, no matter how little effort he put into it, because everyone else always had his back. But I knew what real hard work looked like, and I wouldn't let him take that away from me. But now that I think back on it, maybe I’m reading too much into it. Maybe we were just tired after a long week. And yeah, he probably did have some input, but I don’t know if it’s worth getting upset over. After all, we’re in this together. Still, the image of him smiling at our editor lingered, and I couldn't shake off the"
    },
    {
        "Triggering Event": "A parent emails, \"I hope you can keep my child's grades up this time. Last semester, he fell behind because of your low expectations.\"",
        "Sex": "Female",
        "Age": 25,
        "Occupation": "Teacher",
        "Relationship Status": "Single",
        "Negative Emotion": "Spite",
        "Cognitive Distortion": "All or Nothing Thinking",
        "Generated Assessment": "Are you fucking kidding me? Either you're trying to make it easy for him, which is just plain lazy, or you're intentionally holding him back because you don't want him to succeed. Either way, I'm done with this shit. If he wants to be stupid and fall behind, that's his problem, but if I'm going to put myself through this shit again, at least give me a chance to win, even if it means he has to work harder. It's either that, or I tell him to fuck off and stop wasting everyone's time. You know what? You're probably right anyway. He's probably just going to fail no matter what anyway. So why bother? It's all or nothing. I've had enough of your bullshit. This isn't about my kid; it's about your inability to set simple standards. Fuck you, man. That's it. Fuck you."
    },
    {
        "Triggering Event": "She noticed the cobwebs gathering in the corners of their old home, untouched since he'd passed three years ago. The once-vibrant house now felt like a museum dedicated to his memory, frozen in time. His favorite chair sat empty, dust particles dancing in the sunlight streaming through the window, mocking her with their carefree dance. She hadn't changed anything, hadn't moved anything, as if waiting for him to walk back through that door, laugh at her for being so sentimental. But he never did.",
        "Sex": "Female",
        "Age": 37,
        "Occupation": "Police Officer",
        "Relationship Status": "Widowed",
        "Negative Emotion": "Neglect",
        "Cognitive Distortion": "Discounting the Positive",
        "Generated Assessment": "She thought about how she’d been avoiding cleaning up after him, letting everything remain just as it was when he left. It seemed like an odd thing to do, but what was the point? They weren’t living together anymore, and this wasn’t really a place where she wanted to be. The idea of starting over felt overwhelming, especially with all the memories still here. Maybe I’m just trying to hold onto something, even if it’s not real. At least my memories are real—she could always imagine things differently. She didn’t want to lose herself in all these memories; maybe I can just forget them. The more she thought about it, the more it made sense. What’s the point of changing anything? It would just feel weird, like we’re pretending something is different when it isn’t. If I keep things the way they were, I can pretend that nothing’s changed, which feels safer. Maybe I’m just holding on because I don’t know what else to do. She wondered if people who lived alone would have it easier, without anyone to grieve for. I guess I’m just scared of losing myself in all of this."
    },
    {
        "Triggering Event": "After thirty years of faithful service, she opens her locker to find a cake covered in \"Retirement\" candles instead of the anniversary card from her husband.",
        "Sex": "Female",
        "Age": 74,
        "Occupation": "Police Officer",
        "Relationship Status": "Married",
        "Negative Emotion": "Disappointment",
        "Cognitive Distortion": "What if?",
        "Generated Assessment": "You know what really gets my blood boiling? The way people treat retirement. I mean, have you ever tried opening your locker after decades of service? What if someone decided to play a prank on you? What if they put a cake in there with all those stupid candles? You never think about that kind of thing until it actually happens to you. And then, BAM! You're left wondering why you didn't get an actual gift like everyone else. It's just so frustrating. Who puts a cake in a locker anyway? What if they forgot that it was your last day? What if they thought it was some other guy’s birthday?! Do you know how infuriating it is to have all those candles staring at you when you open your locker for the last time? This isn’t just about me; I’ve seen it happen to others too. They come back to work one last time, expecting a proper farewell party, only to find a ridiculous cake. It’s like, what if they had planned this whole thing? What if they were trying to make us feel worse by putting a cake where we least expect it? Or maybe they did it on purpose because they knew we wouldn’t show up for our final meeting. What if they wanted to distract us from the real reason we’re leaving? Maybe they even set it up before we left, waiting for us to open our lockers. Wouldn’t that be something? It’s always the same. We give our all, we deserve"
    },
    {
        "Triggering Event": "He glances at his watch, its hands ticking closer to closing time. The store's fluorescent lights hum overhead, casting harsh shadows on the empty aisles. He's been here since 6 AM, but today feels like it's lasted a week. His stomach grumbles, reminding him he hasn't eaten since breakfast. A sudden beep from his phone—another reminder alert for his overdue credit card payment. He sighs, worrying about how he'll make ends meet this month.",
        "Sex": "Male",
        "Age": 26,
        "Occupation": "Retail Worker",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Worry",
        "Cognitive Distortion": "All or Nothing Thinking",
        "Generated Assessment": "This is ridiculous. I’m either starving now or eating dinner soon, there’s no in between. This isn’t my first time working late nights, so why does it feel different? Maybe I just need some coffee. But then again, that’ll just give me jitters until lunchtime. And what if my boss sees the clock? He’ll think I don’t take my job seriously. Why did I agree to work overtime again? He looks up, his eyes squinting against the glare of the display lights. His face sets in a determined expression as he checks his watch once more. The seconds tick by, each one feeling like hours. What if I miss the deadline? My mind races with worst-case scenarios: The car won’t start, or the pipes burst, or...or... I can’t even focus on the task. Every sound—the soft chatter, the beeps, the distant rush of cars—is amplified. It’s all too much. I glance around, feeling overwhelmed. The other customers seem oblivious to the chaos, chatting casually while they browse. They don’t know how hard it is to keep going when your body screams for rest. Or maybe they’re just not as tired as I am. He leans forward, his elbows on the counter, and rubs his temples. \"Why does it always have to be so complicated?\" he mutters under his breath. He doesn’t mean to snap, but the stress builds. He thinks about his family, who rely"
    },
    {
        "Triggering Event": "Scenario:\n\nUpon returning home from work, she finds her husband's muddy shoes still in the hallway, untouched since this morning. A fresh pot of coffee sits cooling on the counter, untouched by him despite his promise to make breakfast today. The resentment bubbles up as she picks up his shoes and places them neatly by the door, her jaw clenched tight.",
        "Sex": "Female",
        "Age": 51,
        "Occupation": "Teacher",
        "Relationship Status": "Married",
        "Negative Emotion": "Resentment",
        "Cognitive Distortion": "Blaming",
        "Generated Assessment": "She thinks he doesn't care enough about her. He leaves the dirty shoes there every day, and now that I've picked them up, it feels like an insult. It's not just about leaving dirty shoes; it's about how he treats me. I feel like he doesn't respect my efforts when he makes promises but breaks them. Every time he does this, I start to wonder if he even cares. Even though I know he loves me, I can't shake off the feeling that he doesn't put in the same effort as I do. Sometimes I think he takes me for granted because he knows I'm always willing to help with household chores. But why is it always me? Why can't he see how hard I work for our family? Does he really appreciate everything I do? It's not just about the daily tasks; it's about the little things too. When I try to plan our weekend together, he forgets again, leaving me to deal with everything alone. And then he has the nerve to act surprised when I get frustrated, saying he didn't mean to upset me. But he always means to, and it makes me angry because I feel like no one else ever tries to understand me. Maybe I'm overreacting, but it feels like he’s trying to drive me crazy. Is it all my fault that I feel this way? Shouldn’t he be more considerate? Why does he keep pushing me to the point where I feel like I’m"
    },
    {
        "Triggering Event": "She noticed him, her former lab partner, leaning over the microscope with his new girlfriend, both of them laughing at something only they understood. Her heart pounded as she realized it had been exactly a year since their divorce, and here he was, moving on effortlessly while she felt stuck in the same old rut. She glanced down at her own hands, still rough from hours spent in the lab, then back up at them, their laughter echoing like a mockery of her once-shared jokes. Her insecurities gnawed at her, whispering that she'd never find someone who understood her as he did, not with her nose buried in books and beakers, not with her heart still bruised from their shared past.",
        "Sex": "Female",
        "Age": 21,
        "Occupation": "Scientist",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Insecurity",
        "Cognitive Distortion": "Discounting the Positive",
        "Generated Assessment": "She felt like she was drowning in a sea of tears when she saw him, but I guess it’s just my brain being dramatic again. After all, what does it really matter if he moved on? It doesn’t change anything for me, right? I mean, I’m still working hard to improve myself, even though I know he wouldn’t understand. He probably thinks I’m crazy for trying so hard, but honestly, it feels good to be busy. Maybe I’ll get into research someday, but that’s about it. My life is going nowhere anyway; why bother trying? I’ve tried talking to friends, but they’re all too caught up in their own problems. They don’t care about mine anymore. So, yeah, let him think whatever he wants. I won’t waste my time feeling sad about it. Besides, I have better things to focus on—like how I can’t stand this stupid job anymore. # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # #"
    },
    {
        "Triggering Event": "Every Saturday for years, he'd visit the local farmers market with his partner. Today, she arrived late, already engrossed in her phone, barely acknowledging his greeting. He watched her as they walked through the stalls, her eyes flicking from screen to produce without pause. A familiar resentment stirred within him; another week where his quiet routine was disrupted by her distracted presence.",
        "Sex": "Male",
        "Age": 76,
        "Occupation": "Nurse",
        "Relationship Status": "In a Relationship",
        "Negative Emotion": "Resentment",
        "Cognitive Distortion": "Discounting the Positive",
        "Generated Assessment": "It's hard to explain why I feel this way about our Saturdays together at the farmers' market. I guess it comes down to how much time she spends looking at her phone instead of really being present when we're out. She always says she'll put it away when we start shopping, but somehow it never happens. It feels like every weekend, I'm just along for the ride while she checks her phone or talks to someone else. When I see her glancing at screens all day, it makes me think maybe I shouldn't even bother coming. It’s like she doesn't want me there unless I’m not paying attention either. It gets frustrating because I enjoy walking around the market with her, but I can’t shake the feeling that she prefers it when one of us is just doing our own thing. I know what you’re thinking—“Just relax, let go of your annoyance”—but it’s harder than that. When she’s fully engaged with her phone, it feels like she’s not here with me at all. Even though we’re supposed to be sharing an experience, it almost feels like she’s trying to escape into her digital world. Sometimes I wonder if it would be better if I just stayed home and did my own thing. Maybe I’m overreacting, but it’s hard not to feel resentful when I feel ignored. I wish she could find a balance between checking her phone and enjoying our time together. But until then, I have to ask myself whether"
    },
    {
        "Triggering Event": "In the quiet of her home office, she paused, fingers hovering over the keyboard as the Zoom gallery faded to black. Her colleague's empty seat remained, a stark reminder of yesterday's news. She'd known him since their first job together, fresh out of college. Now, he was gone, leaving behind a void that echoed through every line of code they'd written side by side. A solitary tear rolled down her cheek as she turned off her computer, the room now silent except for the ticking clock, each second stretching out like an eternity.",
        "Sex": "Female",
        "Age": 56,
        "Occupation": "Software Engineer",
        "Relationship Status": "Married",
        "Negative Emotion": "Sorrow",
        "Cognitive Distortion": "Unfair Comparisons",
        "Generated Assessment": "She didn't think twice about joining the call, but now, sitting alone, it felt like a betrayal. The thought nagged her, \"What if I'm just not good enough?\" It wasn't fair to compare herself to someone else, especially when she knew what had happened. But why did she have to feel this way? Why couldn't she be happy for them? Her mind began to wander, imagining scenarios where she could've been the one who died, making her realize how selfish it all seemed. But then again, why would she want to die when there were so many things left to achieve? Maybe this wasn't about comparing herself; maybe it was just about being grateful. Yet, the question lingered, \"How can you be thankful when someone you loved is gone?\" This was getting ridiculous. She needed to stop dwelling on it and focus on moving forward. But why did it feel like every step back was leading her further away from closure? There had to be something more at play here. This wasn't just about grief; it was about understanding what really mattered. But how could she move on when the past kept haunting her? Maybe it was time to reevaluate everything. After all, life was full of surprises. But how much longer would she keep holding on? It's going to take some time. But we'll get through it together. We always do."
    }
]