[
    {
        "Triggering Event": "A woman in her mid-twenties, still reeling from the sudden loss of her husband two years ago, finds an old lab coat of his in the closet. She clenches it tightly, a familiar scent triggering a rush of anger at the unfairness of it all.",
        "Sex": "Female",
        "Age": 24,
        "Occupation": "Scientist",
        "Relationship Status": "Widowed",
        "Negative Emotion": "Hatred",
        "Cognitive Distortion": "Labeling/Global Labeling",
        "Generated Assessment": "Oh my god, I’m such a loser! Why did this have to happen again? My life is already a mess after everything that happened with him, but no, I had to go and find something like this too. This stupid lab coat is just a reminder of what’s been going on for years now. I feel so pathetic. I can’t even begin to think about how much work I need to do when I see something like this. It’s like I don’t deserve anything good anymore. Even though he loved me, and we were happy together before... nothing ever goes right for me. I know things are tough for everyone, but why does this always happen to me? This is exactly why I try to avoid dealing with these things. But I guess I’ll never be able to escape them completely. I might as well get used to it because I’ve learned to accept my fate. Life is cruel enough without throwing in unnecessary pain like this. And I keep thinking about how if only I’d acted differently back then, none of this would have happened. Maybe I could have changed some things... No, that won’t help anything anyway. I’ve tried everything to make myself better, but I’m stuck in this rut forever. At least I’m consistent, right? It’s hard to believe I was once someone who cared deeply about herself. Now I’m just a shell of my former self. I know deep down I want to change, but it’s difficult to muster the"
    },
    {
        "Triggering Event": "She noticed him, across the gallery opening, his laugh echoing as he leaned in close to another woman. Her stomach twisted, not with hunger but with a familiar, bitter pang. They weren't touching, yet their shared smile felt like an intimate secret whispered between them. She looked down at her empty champagne flute, then back up at him, jealousy painting her cheeks redder than the abstract art on the walls.",
        "Sex": "Female",
        "Age": 37,
        "Occupation": "Artist",
        "Relationship Status": "Widowed",
        "Negative Emotion": "Jealousy",
        "Cognitive Distortion": "Emotional Reasoning",
        "Generated Assessment": "What's that supposed to mean? You're saying I'm jealous because I saw someone else laughing, and now I feel bad for feeling that way? Like it's my fault for wanting him to be happy? That doesn't make sense. If you think I'm being stupid for getting upset over something so ridiculous, why are you acting all smug about it? It's your job to help me understand what's going on here, not act like you know better just because you have some fancy degree. And by the way, it has nothing to do with whether he's actually into that other girl. My feelings aren't based on facts; they're how I feel right now. You can try to analyze it until you want, but it doesn't change how I feel. So either get on board or stop trying to tell me what I’m thinking. It’s time to focus on fixing this instead of lecturing me. Stop making this personal, and let’s move forward. You don’t need to be so condescending. Just give me the tools to figure out what’s really going on here, and we’ll go from there. But stop acting like you’re doing me a favor. I know you think you are, but trust me, you’re not. This isn’t about you; it’s about me dealing with my own emotions. Now, if you’ve got something useful to say, let’s hear it. Otherwise, sit back and watch me handle this. I don’t"
    },
    {
        "Triggering Event": "A grizzled, middle-aged man in a worn police uniform stood by his locker, slamming it shut with a force that echoed through the station. His face was flushed, veins bulging at his temples. He snatched up his keys, muttering under his breath as he stormed out, leaving behind the mocking laughter of colleagues discussing his divorce.",
        "Sex": "Male",
        "Age": 34,
        "Occupation": "Police Officer",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Anger",
        "Cognitive Distortion": "Discounting the Positive",
        "Generated Assessment": "\"Wow, what an asshole. I mean, who gets divorced? Not me! You know why? Because I'm so fucking happy with my wife, she's perfect, we're meant to be together forever. And besides, this guy must have just gotten some bad news from his doctor. Or maybe he got into a fight with his girlfriend and she left him. No way would someone like that get divorced willingly. And another thing, if he is getting divorced, then he probably has nothing better to do than waste time talking about it with everyone else here. What’s next? Are you going to tell us that this guy is going to quit his job too because he doesn't feel like working anymore? Come on, let's focus on something more important than someone's personal life.\""
    },
    {
        "Triggering Event": "She found him, her late husband's favorite chair, torn apart in their once neat backyard. Garden gloves still on, she picked up the remnants, rage boiling within her like a storm brewing.",
        "Sex": "Female",
        "Age": 63,
        "Occupation": "Police Officer",
        "Relationship Status": "Widowed",
        "Negative Emotion": "Rage",
        "Cognitive Distortion": "Discounting the Positive",
        "Generated Assessment": "She was so upset about the torn chair. I knew how much he loved that chair. But she didn't seem to care about anything else. Like, she doesn't even look at me for answers. It’s all just her anger. And then there’s this thing she says about his death. Something about it being “too soon” but I guess she has no idea what too soon means? I mean, he died last week. That's 9 days ago! So, yeah, it is too soon. But she won't hear it because she's too busy crying over the garden. I know she thinks I'm insensitive when I say it, but honestly, she doesn’t understand. The whole situation is ridiculous. She keeps saying things like “It would have been better if he were here.” What does that even mean? He's dead! Doesn't she see that? I tried explaining it to her, but she just gets mad. This isn't the first time something like this happens, though. There are other times where she goes off on me, and it makes me feel like I can never make things right with her. I try to help her through these moments, but nothing works. She always ends up blaming me or some stupid excuse. I hate how angry she is. Sometimes I wonder why I even bother trying. Maybe she just wants someone who will tolerate her constant outbursts instead of listening. At least that way, I could be free from all this"
    },
    {
        "Triggering Event": "While scrolling through Instagram at dinner, he noticed his partner had liked several photos from their colleague's recent trip to Paris. All were tagged with heart emojis, and one included a cozy-looking selfie. He felt his gut twist as jealousy surged within him.",
        "Sex": "Male",
        "Age": 44,
        "Occupation": "Journalist",
        "Relationship Status": "In a Relationship",
        "Negative Emotion": "Jealousy",
        "Cognitive Distortion": "Blaming",
        "Generated Assessment": "I don't know what's wrong with me, but I feel like I'm going crazy when she likes pictures from other people. It just feels so... jealous? Like, why would someone else get to enjoy that kind of love? It's weird because she doesn't even post anything like that about us. And honestly, I think I'd be more upset if she posted something like that. But no, instead, it's always these random coworkers she has fun with. What am I supposed to do? She says they're just friends, but I can't shake this feeling that there's something more going on. I guess I just wish she wouldn't post those things anymore. Or maybe I should talk to her about it. But then again, I don't want to come across as insecure or possessive. So, yeah, I'm just confused right now. # #"
    },
    {
        "Triggering Event": "He was halfway through his morning coffee, the newspaper spread out before him, when he noticed it. The clock's second hand had frozen at the five-second mark. His heart pounded as he grabbed his phone to check the time, but the screen remained blank despite being plugged in. Panic surged; what if his research was derailed by this sudden technological failure?",
        "Sex": "Male",
        "Age": 76,
        "Occupation": "Scientist",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Panic",
        "Cognitive Distortion": "Magnification/Minimization",
        "Generated Assessment": "He'd been up since 4am, working diligently on his project. As he sipped his coffee, he checked his watch for the hundredth time. It didn't budge. Anxiety crept in, making his hands shake. What if he missed his deadline? His mind racing, he frantically dialed his friend’s number, but the call went straight to voicemail. Panic intensified as he rushed downstairs, only to find that the elevator wasn’t moving. Was this some kind of cruel joke? He called the building management, but no one answered. This couldn't be happening. He was running late, and now everything seemed to be falling apart. He tried to take deep breaths, but they felt forced, like he was holding his breath underwater. This isn't just about me; it's about everyone who relies on technology. I'm just trying to keep things together here. But every minute counts, and the longer we wait, the more problems will multiply. My life is already complicated enough without these distractions. Now, with my car breaking down on top of it all, I feel like I’m drowning in chaos. I can barely think straight, let alone focus on anything meaningful. Every delay adds fuel to the fire. We're already behind schedule, and now this? It feels like the universe is conspiring against us. I know I have to stay calm, but how can I when everything around me seems to be spiraling out of control? Even my"
    },
    {
        "Triggering Event": "A chef in his forties, long hours at the stove having taken their toll, watches his partner nonchalantly dump leftover takeout into their expensive compost bin.",
        "Sex": "Male",
        "Age": 40,
        "Occupation": "Chef",
        "Relationship Status": "In a Relationship",
        "Negative Emotion": "Contempt",
        "Cognitive Distortion": "Labeling/Global Labeling",
        "Generated Assessment": "Oh fuck you so much for putting that shit in our expensive ass compost bin. What the hell is wrong with you? You have no respect for your money or time. I don't even want to be around this place anymore. We're such dumbasses to think we could afford organic shit when we can't even pay our fucking bills. We're just a bunch of lazy bums who don't know how to cook. All those years of being a goddamn chef and now it's all wasted because I'm too stupid to throw away my disgusting food. This is what happens when you let your lazy ass wife do everything. If you were still working, we wouldn't be in this mess. Now I've got to go back to work and deal with these incompetent idiots again. Fuck you so much. Fuck you so much."
    },
    {
        "Triggering Event": "Every weekday at precisely 6 pm, he'd watch the clock hand creep towards six-thirty, his heart heavy with anticipation. Today, as the old grandfather clock chimed, he found himself in the kitchen, holding her favorite teacup, now cold and dusty. A soft knock at the door broke his reverie. It was their youngest granddaughter, Lily, her cheeks flushed from the autumn chill. \"Grandpa,\" she said, \"I've made you some of your favorite apple pie.\" He took it with a nod, his eyes welling up as he noticed the familiar, meticulous handwriting on the note tucked beneath the crust: \"With love, for our little family tradition.\"",
        "Sex": "Male",
        "Age": 74,
        "Occupation": "Nurse",
        "Relationship Status": "Widowed",
        "Negative Emotion": "Melancholy",
        "Cognitive Distortion": "Overgeneralization",
        "Generated Assessment": "He's always been this way—lurking around every corner, watching us, waiting for the perfect moment to strike. He's never missed an opportunity to make me feel trapped. His eyes seem to bore into my soul, as if he can see every secret I keep, every lie I tell. The way he watches me is unnerving, like a constant reminder that I'm not alone in this house. His presence makes everything feel off-balance, like a game of Jenga. One wrong move, and the whole thing comes crashing down. Every time he's around, I feel like I'm walking on eggshells, never knowing when he'll lash out. He's never given me a break, never let me catch a breath. My mind races with thoughts of how much I'd love to be rid of him, but deep down, I know it's not that simple. It's all about control. He's always been in charge, making decisions for us without even asking. If I disagree, I'm met with anger and frustration. When we tried to stand up for ourselves, he just laughed it off, saying we were being dramatic. But what if we're not? What if we're just trying to protect ourselves from someone who doesn't care about anyone else but himself? Every day feels like a countdown to the next explosion. We try to avoid him, but he's everywhere. In the middle of dinner, he's there, sitting quietly, watching"
    },
    {
        "Triggering Event": "At 3 AM, he woke to his wife's soft sobs from the bathroom. Her hands trembled as she held up a positive pregnancy test. \"After all these years,\" she whispered, \"and now... I miscarried.\" He could only watch helplessly as her tears fell onto the cold tile floor.",
        "Sex": "Male",
        "Age": 57,
        "Occupation": "Journalist",
        "Relationship Status": "Married",
        "Negative Emotion": "Helplessness",
        "Cognitive Distortion": "Mind Reading",
        "Generated Assessment": "It was such a momentous occasion. The baby would have been born with bright blue eyes and hair like his mother's—she had always wanted that. When I heard her crying, I rushed into the bathroom thinking she might be upset about the miscarriage. But then she showed me the pregnancy test, and I realized she hadn't lost the baby after all. She must have been worried about having another miscarriage, so she cried for relief. I can't blame her; it's natural to feel sad when you're scared."
    },
    {
        "Triggering Event": "She returned home from another grueling day at the restaurant, her chef whites still stained with today's special. As she opened the front door, the apartment was uncharacteristically quiet. No hum of the TV, no clink of glasses. Her partner of 20 years was gone, taking his favorite chair and their shared photos with him. A single note lay on the counter, \"It's not working anymore.\"",
        "Sex": "Female",
        "Age": 54,
        "Occupation": "Chef",
        "Relationship Status": "In a Relationship",
        "Negative Emotion": "Rejection",
        "Cognitive Distortion": "Emotional Reasoning",
        "Generated Assessment": "fuck that bitch! I know it wasn't her fault. We were both tired as fuck and we weren't communicating well. It doesn't mean she wants to leave me. I know she loves me, but this is just too much. Why does everyone always have to be so fucking dramatic? What's the point of even having an argument if you're going to walk out? This isn't fair; we've been through worse shit together, like when she spilled hot soup all over the kitchen. That time she got mad because he cooked dinner wrong. She's being so insensitive, acting like this is some kind of surprise. If they want to break up, they need to actually tell me first instead of leaving me with nothing but a stupid note. I'm going to go pack my bags and get out of here before things get any worse."
    }
]