[
    {
        "Triggering Event": "\"She watches her editor's cursor blink, awaiting his reply to her pitch. It blinks, then stops. 'Not this time,' he types. She feels the familiar sting of rejection, a knot forming in her throat.\"",
        "Sex": "Female",
        "Age": 25,
        "Occupation": "Journalist",
        "Relationship Status": "Married",
        "Negative Emotion": "Rejection",
        "Cognitive Distortion": "Unfair Comparisons",
        "Generated Assessment": "**Oh wow!** A girl is pitching something to an editor, and it doesn't work out. That must mean she has no talent whatsoever! How can anyone expect someone to succeed when they're constantly rejected? I'm so glad I never tried anything like that because I wouldn't have succeeded either. Rejection is just part of life, right? Maybe if I had more luck, I'd be successful too... but why bother trying? It's probably just a coincidence that she got rejected again. What are the chances that she'll ever get published anyway? Not many, that's for sure. I don't think I could handle all those rejections either. Why even try? There are way easier ways to make money than writing. Like working as a dog food taste tester! At least there, you won't get rejected. This whole thing is so unfair. I mean, what chance does she really have? I've seen so many writers fail before. And now, another one fails. It's ridiculous! Why does this always happen to her? Doesn't she know how hard it is to make it in this industry? I bet she doesn't understand the struggle. Who needs success when you can have self-satisfaction from watching your dreams crumble? There are far better things in life than getting published. Think about it – being a professional snail trainer would be way more fun. You'd get to see those cute little creatures every day! Plus, they don't care about"
    },
    {
        "Triggering Event": "In his usual routine, he opened the kitchen drawer for his morning tea spoon. But today, nestled among the utensils was her favorite, the small silver one she'd loved so much. He hadn't seen it since her passing three months ago. His breath caught as memories of her laughter filled the empty space around him.",
        "Sex": "Male",
        "Age": 75,
        "Occupation": "Scientist",
        "Relationship Status": "Widowed",
        "Negative Emotion": "Grief",
        "Cognitive Distortion": "Discounting the Positive",
        "Generated Assessment": "In my opinion, it’s ridiculous to mourn someone who’s been gone for three years. What is this, some kind of sick joke? I remember how she used to love our little routines together, but now it just feels like a reminder of what we’ve lost. It's such an absurd thing to be sad about. I mean, really, three whole months have passed. Is it really worth getting emotional over something like that? What am I supposed to do? Just put it aside and move on? That doesn’t feel right. And why would I want to? She might still be with us if only— But no, I won’t go down that road. There’s no point in dwelling on past happiness when there’s nothing new to look forward to. We’re just stuck here, reliving memories that are meant to fade away. What’s next? We’ll just keep wallowing in nostalgia until we forget everything else? This isn’t about me; it’s about respecting her memory. She wouldn’t want us to dwell on the past. We need to focus on moving forward, not letting ourselves get trapped in pointless reminiscence. So let’s put all this behind us and pretend like nothing ever happened. After all, time heals all wounds, right? The sooner we accept that reality, the better off we’ll be. This nonsense needs to stop. It’s time to close the drawer, lock the door, and leave the past where it belongs—behind"
    },
    {
        "Triggering Event": "The ER was a flurry of activity, but she couldn't shake the feeling that something was amiss with Mr. Thompson's chart. She double-checked his allergies, her heart pounding as she realized the potential medication error. The stress of the day threatened to overwhelm her, but she pushed through, barking orders for the correct medication.",
        "Sex": "Female",
        "Age": 45,
        "Occupation": "Doctor",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Stress",
        "Cognitive Distortion": "Discounting the Positive",
        "Generated Assessment": "“Ugh, I’m still shaking after that chaotic ER shift! You know who didn’t get a break? Mr. Thompson’s family. They were already dealing with the stress of his diagnosis, and then we had to deal with a potentially life-threatening medication mix-up. It’s just so infuriating—those people have no idea what it’s like to be in my shoes. I mean, do you think they care about the intricacies of medication interactions when they’re worried sick about their loved one’s health? Of course not! They just want to rush out of here and forget about all the panic they experienced during their visit. But what if I told them that I spent countless hours studying pharmacology and that I’m constantly battling my own anxiety over the possibility of mistakes like this happening again? Would they even listen? It’s always the same thing—people are too quick to blame me for their problems, never taking the time to understand what I go through. Take Mrs. Johnson, for instance; she came in complaining about chest pain, and after some probing questions, I discovered that she was actually experiencing anxiety attacks caused by her husband’s recent infidelity. But did she appreciate my empathy and expertise? Nope! Instead, she just demanded to see the doctor, yelling at me for not ‘doing enough.’ Can you imagine how stressful that must have been for me? And then she has the nerve to complain about our conversation afterwards, saying I ‘didn’t listen’ and that she"
    },
    {
        "Triggering Event": "A middle-aged man, married with no children, sits in his study after a long day of surgeries. His wife enters, showing off a new necklace given to her by an old friend who had stopped by unannounced. He feels a pang of bitterness, noticing that she hasn't received such tokens from him in years.",
        "Sex": "Male",
        "Age": 45,
        "Occupation": "Doctor",
        "Relationship Status": "Married",
        "Negative Emotion": "Bitterness",
        "Cognitive Distortion": "What if?",
        "Generated Assessment": "Ugh, I can’t believe he’s still doing this shit. He doesn’t even think about how it makes me feel, just keeps buying these fucking things for my wife. I mean, what if he gives up? What if he stops bringing them home? I guess it wouldn’t be so bad, but it would be weird. Like, I’d have to get used to it again, start feeling happy when he shows up with some stupid trinket. But then again, maybe I could get into it too. Maybe I’d enjoy it. If he kept going, I might start looking forward to it, you know? But let’s be real, it won’t happen. It’s probably all just a ploy to get back at me for being a bitch sometimes. He thinks he can make me forgive him just because he’s been nicer lately. Newsflash: it won’t work. I’ll never forgive him. I don’t care about those damn necklaces anymore. And another thing—what if he really does give up? What if we’re left here alone, with nothing to look forward to? No more surprises, no more gifts. Just us, living our lives. Yeah, that sounds great. I can already imagine how boring it would be, no more little gestures to spice things up. We’d be stuck together 24/7, bored out of our minds. Ugh, why did I ever marry this asshole? Anyway, back to the necklaces"
    },
    {
        "Triggering Event": "She saw him through the kitchen window, laughing with their daughter at the table she used to set for three. The sun caught his wedding ring as he gestured, and her heart twisted like dough in too-rough hands. He was happy, moving on, while she stood alone, surrounded by the ghosts of their meals.",
        "Sex": "Female",
        "Age": 70,
        "Occupation": "Chef",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Jealousy",
        "Cognitive Distortion": "Should Statements",
        "Generated Assessment": "\"Are you fucking kidding me? You're telling me we've been together for over two decades, and this is how it ends? I'm done. Fuck this shit. We were meant to be, but apparently not anymore.\" She's always known that she wasn't the right woman. They'd planned to get married young, but life had other plans—life that seemed to favor him more than her. As she watched from afar, seeing them laugh together, she felt the weight of her own isolation. Why would she ever want to stay when everything inside her screamed that she didn't belong? They were high school sweethearts who had built a life together. But every step forward felt like one step back. His dreams were bigger, farther-reaching, and hers were rooted in the stability of home and family. For years, she'd pushed herself to fit into his vision, even though it left her feeling like a puzzle piece that never quite fit. He'd moved up so fast, taking jobs that paid better, buying a house, and eventually starting his own business. Their days blended together, and she struggled to keep up. Every time she thought about leaving, doubts crept in. Maybe if she tried harder, things could change. But deep down, she knew she couldn’t pretend forever. As the months went by, the distance between them grew. He spent long hours away, chasing opportunities, while she stayed behind to care for their daughter. She felt like a ghost hovering around"
    },
    {
        "Triggering Event": "A worn envelope, yellowed with age, arrives in the mail. He recognizes his late mother's handwriting. Inside is a letter she'd written years ago, unopened until now. It's a reminder of a promise he broke, a regret that's haunted him since her passing.",
        "Sex": "Male",
        "Age": 55,
        "Occupation": "Doctor",
        "Relationship Status": "Single",
        "Negative Emotion": "Regret",
        "Cognitive Distortion": "What if?",
        "Generated Assessment": "Fuck it! She probably died of old age. What if I had just been there for her when she was alive? Maybe she wouldn't have gotten so sick. You know what? I don't fucking care anymore. Fuck you, Mother. You're dead, and I'm done caring about your fucking letters. If you were still alive, maybe I would've shown up to your funeral. But no, you had to go and die while I was busy dealing with my own shit. Now I can finally move on with my life. You weren't even worth showing respect for, anyway. I remember how she always nagged me about being there for her, but she didn't give a fuck when she left me hanging. Well, now I'm going to make her pay... by ignoring all her stupid letters. They don't mean anything anyway. It's not like they were important or anything. Just more reminders of what could've been. Yeah, right. What if I hadn't ignored her back then? Would things be different now? No, fuck no. All this time, waste, and energy spent on someone who doesn't deserve it. You know why? Because she wasn't worth it. She fucked me over and left me with nothing but a bunch of useless memories and regrets. And now, I'll spend my whole life dwelling on those memories because I won't let myself forgive. I'll never forgive her. Not for one second will I forget how she betrayed me."
    },
    {
        "Triggering Event": "In the studio, he slashed through the canvas with his brush, each stroke echoing the tightness in his chest. His wife's voice drifted from the kitchen, \"We need to discuss your expenses.\" His grip tightened around the handle; she didn't understand, never had.",
        "Sex": "Male",
        "Age": 45,
        "Occupation": "Artist",
        "Relationship Status": "Married",
        "Negative Emotion": "Anger",
        "Cognitive Distortion": "Unfair Comparisons",
        "Generated Assessment": "Oh my god, I'm just so fucking tired of this shit. It's like they're trying to get me killed. I mean, what if it wasn't like this? What if I was happy, really happy, but then I fucked up, you know? Like that time when we were driving home from the beach and he suddenly slammed on the brakes because of some stupid stop sign. He got so angry, but I knew he was having a bad day, right? And now...now I'm stuck in this miserable life again, always worrying about something. My husband is such an asshole sometimes, but I guess I deserve it after everything I've done. He has every right to be mad. I should have been more careful. Maybe if I hadn't been so reckless... But fuck, it hurts. Every little thing just feels so unfair. When my sister asked how things were going, I tried to tell her about how stressed out I am, but she just laughed and said, \"You're overreacting,\" which made me want to scream. She doesn't understand anything. If she did, maybe I wouldn't feel so alone. But no, instead, she keeps telling me to calm down and that I'll be fine. Fine?! Are you kidding me? Life isn't fine! I try to explain to her that I'm not okay, that I have so much on my plate, but she just dismisses it all and says I need to \"grow up\""
    },
    {
        "Triggering Event": "She woke up at dawn, the familiar clatter of pots and pans echoing through their empty house. Today was her day off, but she couldn't shake the feeling that something was amiss. As she made her way downstairs, she noticed the kitchen table bare except for a single, unopened letter addressed to her husband. The stamp read 'Overdue'.",
        "Sex": "Female",
        "Age": 39,
        "Occupation": "Chef",
        "Relationship Status": "Married",
        "Negative Emotion": "Hopelessness",
        "Cognitive Distortion": "What if?",
        "Generated Assessment": "She felt a wave of panic wash over her as she sat down at the kitchen table. What if he had left her? What if this was his goodbye note, explaining how he couldn’t take it anymore? The thought sent a chill down her spine, but she pushed it aside. She didn’t want to think about it. But what if he did leave? What if he was already gone? Her mind began racing with scenarios. What if he sold everything, took all the money, and started a new life somewhere else? What if he never came back? Her heart sank at the thought of being alone forever. But what if...? No, no, no. She shook herself out of it. Don’t be ridiculous. He wouldn’t just leave like that. He would come back, wouldn’t he? But what if...? Maybe he had an affair. Maybe he met someone else while she was working. That’s why he didn’t call or text. That’s why he left the car keys on the counter. He wasn’t trying to hurt her; he just wanted to get away from her. Or maybe... maybe he was dead. What if he died and she didn’t notice? What if he slipped into the river one night and drowned? She felt a lump form in her throat as she imagined him floating face down, eyes closed, and silent. What if...? What if he couldn’t find his way home? What if he got lost in the woods? What"
    },
    {
        "Triggering Event": "He arrives home, late from another grueling shift at the hospital. His partner, immersed in their laptop, doesn't even glance up as he enters, let alone greet him. He hangs his coat, the silence heavy with contempt for the cold welcome.",
        "Sex": "Male",
        "Age": 32,
        "Occupation": "Doctor",
        "Relationship Status": "In a Relationship",
        "Negative Emotion": "Contempt",
        "Cognitive Distortion": "Blaming",
        "Generated Assessment": "It’s just so unfair how he gets mad at me when I have an anxiety attack because of work stress. It makes me feel like he doesn’t care about my well-being and is always blaming me for things that aren’t my fault. Like today, he came home late again and didn’t even say hi. I was really looking forward to seeing him, but I guess I can see why he wouldn’t want to deal with it. I know I’m overreacting by saying he doesn’t care, but honestly, I don’t think anyone would put up with this kind of treatment, right? It feels like no matter what I do, it’s never good enough for him. And now, after being gone all day, I need some time to recharge, but I guess that means I’ll be dealing with him being angry and stressed out instead. He probably has his own issues, but does he ever consider that maybe I am the one who needs support here? Maybe if he listened more, he’d understand that sometimes we just need a little compassion. But then again, maybe I’m just too sensitive, which would explain why he always acts like I’m the problem. Anyway, I guess I just need to calm down and try not to jump to conclusions. Or maybe I shouldn’t bother trying at all since nothing ever changes anyway."
    },
    {
        "Triggering Event": "While restocking the shelves at midnight, he noticed a half-eaten muffin hidden behind a display, left by a careless customer earlier that day. He felt his cheeks flush with embarrassment as he recalled the mess he'd made last week when stressed, and how his partner had found it before he could clean up.",
        "Sex": "Male",
        "Age": 44,
        "Occupation": "Retail Worker",
        "Relationship Status": "In a Relationship",
        "Negative Emotion": "Shame",
        "Cognitive Distortion": "Mind Reading",
        "Generated Assessment": "Fuck, what was that? I can't believe she's just going to leave her fucking dirty dishes for me to deal with again. It's like she doesn't even care about our relationship; she must think I'm too stupid to notice or something. Or maybe she's just trying to see if I'll actually pick up after myself this time. Either way, I feel so stupid, like I've failed her all over again. She probably thinks I'm an idiot who can't keep track of anything. But wait, did she really say those exact words to me? \"You're such a slob, you can't take care of yourself.\" Yeah, right. I bet she didn't mean that. I'm sure she was just joking. Still, why would she put a note like that on the fridge? Is she trying to humiliate me? Does she really think I'm so lazy that I need reminders? And what's with the new job? I thought we were doing fine. Did she get bored already? Maybe she wants some space or something. But does she have to make it so obvious? Leaving notes everywhere? That's just making things worse. What am I supposed to do? Try harder? Like I haven't been working hard enough already. This is ridiculous. I swear, she's always picking on me. Maybe I'm just being paranoid. No, no, no. This isn't about me. It's about her. She's the one acting selfish"
    }
]