[
    {
        "Triggering Event": "She noticed him again, her ex-husband laughing with another woman at the coffee shop next to their old apartment. They weren't touching, but their body language spoke volumes. She felt her stomach twist into knots as she watched them from behind the counter of the store where she'd been working since the divorce. Another customer caught her attention, snapping her out of her jealous daze. \"Just the usual?\" they asked. She nodded mechanically, her hands shaking slightly as she reached for his regular coffee cup.",
        "Sex": "Female",
        "Age": 38,
        "Occupation": "Retail Worker",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Jealousy",
        "Cognitive Distortion": "What if?",
        "Generated Assessment": "You know that time when I was talking about how my friend is dating this new girl, and we were discussing what if he cheated on her? Like, hypothetically, just wondering what would happen if he did it. What if she found out? How would she react? Would she leave him? We even talked about what if she didn’t leave, and he stayed because he couldn’t imagine living without her. It’s crazy thinking about how far things could go, isn’t it? And then there was the other conversation with my sister, where we were jokingly saying what if she got married to someone else and became happy? But seriously, what if she found someone who loves her more than me? That thought made me feel so sick, like I’d be left alone forever. You know, it’s funny how our minds can turn everything into drama. Sometimes I think about what if I wasn’t there for her when she needed help, what if she had to deal with all that by herself? Or what if she forgot about me and moved on? The thought sends shivers down my spine. I’ve always wondered what if I never met her, if I grew up with different parents, what kind of life would I have? Maybe I wouldn’t have these feelings or even known her. But honestly, who knows? Life is full of what ifs, right? Maybe someday I’ll find myself in a situation where I have to choose between two people, and I don’t know which"
    },
    {
        "Triggering Event": "\"She sat in her cluttered home office, the phone ringing unanswered as she stared at the email from her editor. 'Your story lacks depth,' it read. Her husband's footsteps echoed down the hall, but he couldn't fill the void of helplessness that gnawed at her.\"",
        "Sex": "Female",
        "Age": 48,
        "Occupation": "Journalist",
        "Relationship Status": "Married",
        "Negative Emotion": "Helplessness",
        "Cognitive Distortion": "Blaming",
        "Generated Assessment": "\"Oh great, I'm so fucking stupid. She must have been expecting me to magically fix everything. What kind of idiot doesn't even bother calling? Do you know how much work goes into writing an article? It takes hours of research and editing just to get something decent. And now my boss is breathing down my neck about it. Of course she has no idea what it takes. She's probably just going to sit there and wait for me to fix it. Meanwhile, my husband walks by and asks if everything is okay, like he hasn't seen me stressed out all day. He thinks he can just casually drop by and ask what's up when he knows how busy I am. It's ridiculous. If she really wanted to see improvement, she'd have called before sending the email.\""
    },
    {
        "Triggering Event": "Male scientist, 25, leaves lab late, notices co-worker, Tom, lingering by his locker, whispering into phone about \"unexpected results\".",
        "Sex": "Male",
        "Age": 25,
        "Occupation": "Scientist",
        "Relationship Status": "In a Relationship",
        "Negative Emotion": "Paranoia",
        "Cognitive Distortion": "Magnification/Minimization",
        "Generated Assessment": "\"Are you fucking kidding me? I can't believe he's talking about this shit right in front of me! He was just casually asking what I'm working on while doing God knows what with that phone. It's so fucking obvious he's trying to get my job. And now I'm going to have to deal with him because he thinks he's some kind of genius who got picked over me for the grant. You know what? This is all my fault anyway. If I didn't have to work so much overtime, I wouldn't be tired, and I wouldn't be distracted. But no, I had to go and fuck up my life, and now everyone else gets to reap the benefits. That's why they're getting more funding than me. They think they deserve it because they don't have to put in as much effort. Well, let them try being me for one day, and then tell me they still need more money. I swear, I'm not even mad at him; I'm just annoyed that he has to suffer through the same shit I'm going through.\""
    },
    {
        "Triggering Event": "She noticed his old coat still hanging in the closet, the one he'd always wear on their walks together. Today was her first day back at work since his passing; it felt heavier than ever without him by her side.",
        "Sex": "Female",
        "Age": 46,
        "Occupation": "Doctor",
        "Relationship Status": "Widowed",
        "Negative Emotion": "Unhappiness",
        "Cognitive Distortion": "Blaming",
        "Generated Assessment": "She didn't understand why I was so upset about that old coat. He just left it there, and she assumed I must be holding onto something sentimental. But I wasn't. It was just an old coat, nothing special. Why did she think I'd miss it? Did she really think I'd hold onto it as some kind of memorial? It's ridiculous. I haven't even touched that coat since...since he died. And yet, here she is, acting like this is some big deal. Like I'm going to start wearing it again or something. What's wrong with me? Am I supposed to just forget everything we shared because he's gone? This isn't about the coat. It's about how she doesn't get it. Doesn't she see that it's just an old coat? That I don't want anything from him anymore? Does she really believe I'll keep clinging to the past because of a stupid coat? # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # #"
    },
    {
        "Triggering Event": "\"While preparing his wife's favorite meal, tears well up as he notices her empty chair at the table.\"",
        "Sex": "Male",
        "Age": 55,
        "Occupation": "Nurse",
        "Relationship Status": "Widowed",
        "Negative Emotion": "Sorrow",
        "Cognitive Distortion": "What if?",
        "Generated Assessment": "Oh my god, I'm so upset! What if she just left me for another man? Or what if she died? Oh my god, what if she's in some kind of accident right now?! And what if she’s being raped by someone? Or what if she fell off a cliff while hiking? Oh my god, what if she was kidnapped?! I can't even cook without thinking about all these horrible scenarios. I keep imagining her with other men, and that makes me so angry! She has to be okay, but what if she's not? I don't know how much more of this I can handle. I feel like I’m going crazy, constantly worrying about terrible things. What if...?! My mind is full of worst-case scenarios, making it impossible to focus on anything else. It’s like my brain is stuck on replaying every possible disaster, no matter how unlikely. Oh my god, what if...?! Ugh, why does my mind have to go there? I wish she wasn’t gone, but what if she really was gone?! What if she got into an accident on the way here?! Oh my god, what if...?! I need to stop thinking about all this stuff. But what if...?! *sigh* Why did I ask that?! Of course, you can’t eat without thinking about all the terrible possibilities! Ugh, I hate myself for overthinking everything. Every little thing triggers this awful anxiety. I feel so helpless when"
    },
    {
        "Triggering Event": "A week after his girlfriend moved out, he found her favorite mug in the back of the cupboard, still stained with lipstick where she'd left it. He picked it up, felt its weight, and then dropped it into the sink, watching as it shattered into countless pieces.",
        "Sex": "Male",
        "Age": 47,
        "Occupation": "Journalist",
        "Relationship Status": "In a Relationship",
        "Negative Emotion": "Misery",
        "Cognitive Distortion": "Should Statements",
        "Generated Assessment": "What the fuck is wrong with me?! Why did I just drop that fucking mug? It was fine before I touched it. Why can't I just leave things alone like a normal person? I know I'm supposed to be over this already, but damn, I feel like such an asshole for dropping it. I keep thinking about how I could've handled it better. I mean, why did I even pick it up if I knew it might break? Now it's all over the place, and I have to clean up the mess. This is so stupid. I really need to get over this shit already. But honestly, I'm starting to think that I just \"should\" be okay by now. I don't understand what's going on inside my head. I feel like I should be able to handle my emotions better than this. But no, here I am, struggling to accept that I fucked up. Maybe I'm just too much of a pussy for this kind of situation. I know I'm supposed to move on, but I just can’t seem to let go. I guess I'm stuck in my head, replaying every little thing that happened. I’m not supposed to be so weak right now, especially since everything else seems to be fine. I know I shouldn’t be feeling this way, but I just can’t stop thinking about it. And you know what? I don’t want to. I’m not supposed to be dwelling on something like this. But I"
    },
    {
        "Triggering Event": "At 3 AM, he woke to his phone buzzing under his paint-stained sheets. The gallery owner's name flashed on the screen, a rare late-night call that set his heart racing with worry. He picked up, \"Hello?\" His voice echoed in the silent studio, the canvas from his latest piece still smudged and untidy beside him.",
        "Sex": "Male",
        "Age": 41,
        "Occupation": "Artist",
        "Relationship Status": "Single",
        "Negative Emotion": "Worry",
        "Cognitive Distortion": "All or Nothing Thinking",
        "Generated Assessment": "\"Oh my god. You're calling me at three in the morning? What is it? Is everything okay? Tell me right now. Please tell me right now.\" \"I don't know if I can handle this. My mind is already spinning, and you're making things worse by calling me like this. Are you even serious? Do you have no idea how stressed out I am just from getting off work?\" \"This isn't funny, is it? You never called me before, especially not at night. This isn't something to joke about. There must be some issue with your project. If there was anything wrong, why didn't you reach out sooner? Don't you think I've been worried sick over this for weeks? You're killing me.\" \"You really need to get your act together. This isn't a joke anymore. You're going to ruin your life and mine because of your carelessness. How could you be so reckless? Can't you see how much stress this has put on us both? We're already dealing with enough drama; you're pushing me to the edge. Stop being irresponsible and start taking responsibility for once.\" \"What are you even doing, calling me at this hour? Are you trying to torture me? Can't you see I'm barely holding on here? First, you drop the bombshell that the opening is pushed back until next month, then you follow it up with another bombshell that the venue we rented needs more time for setup. How many times do"
    },
    {
        "Triggering Event": "She spots him, laughing with their old crowd at the local brewery. He's moved on, his arm wrapped around his new girlfriend, who looks exactly like her from behind. She feels a familiar ache in her chest, resentment bubbling up as she watches them clink glasses, oblivious to her presence.",
        "Sex": "Female",
        "Age": 37,
        "Occupation": "Software Engineer",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Resentment",
        "Cognitive Distortion": "Unfair Comparisons",
        "Generated Assessment": "Ugh, I can’t believe he’s moving on so fast! It’s like he never even knew me. I try to convince myself that I’m over him, but it doesn’t help. Every time I see him, my heart sinks. Why does he get to move on so easily? Doesn’t he know how much I loved him? She looks amazing now, so confident and happy. Everyone else is probably jealous too, right? But no, she still has to go out of her way to notice me, even if it means awkwardly passing by when they’re together. I bet she loves being around him now; she gets all the attention, while I’m just stuck here alone again. Why does this keep happening to me? Is it because I’m not good enough? Because I let things slip, and now I have nothing left? We were meant to be, but life had other plans. Now everyone else gets to live happily ever after, while I’m stuck in this rut, constantly comparing myself to what could’ve been."
    },
    {
        "Triggering Event": "Scenario:\n\nA middle-aged chef, his knife striking the cutting board with each chop, notices a young sous-chef smirking at his meticulous technique. Irritated, he snaps, \"Either you're learning or you're laughing. Pick one.\"",
        "Sex": "Male",
        "Age": 48,
        "Occupation": "Chef",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Irritation",
        "Cognitive Distortion": "Emotional Reasoning",
        "Generated Assessment": "\"Hey, I get that you think it's funny, but I'm just trying to show you how it's done. If you want to laugh, that's your business. But if you're here to learn, we can work together.\" (No change)"
    },
    {
        "Triggering Event": "Female software engineer, 42, in a committed relationship for over a decade, finds an unsent text message from three months ago on her partner's phone, starting with \"I'm sorry...\"",
        "Sex": "Female",
        "Age": 42,
        "Occupation": "Software Engineer",
        "Relationship Status": "In a Relationship",
        "Negative Emotion": "Guilt",
        "Cognitive Distortion": "Discounting the Positive",
        "Generated Assessment": "Aww shit. I feel like shit right now. She just sent me this fucking text. It’s so weird to see it. I know she was really upset when he did what he did last year. And I can understand why she felt that way. But honestly, I think she was being unfair. He apologized profusely, and we’re working through some things. We have our ups and downs, but I love him. I always thought I could work around his mistakes. I’m trying to be patient, but damn, I miss her. She wasn’t even there. I keep thinking about how much she would’ve hated it if she knew. She loved him, too. They were meant to be together. I hate this. I wish I could go back in time and tell myself not to send that stupid text. Now she thinks I’m not listening, and I feel like such a jerk. I want to call her and talk it out, but I don’t know what to say. I keep replaying it in my head, wondering if I should have said something different. This is all so fucked up. I don’t know what to do next. I just want everything to stop hurting. Fuck, I need to get a grip. I don’t know what to do anymore."
    }
]