[
    {
        "Triggering Event": "Arriving at work, she noticed an unwashed patient's dishes from the night shift still in the sink, teeming with flies.",
        "Sex": "Female",
        "Age": 29,
        "Occupation": "Nurse",
        "Relationship Status": "Single",
        "Negative Emotion": "Disgust",
        "Cognitive Distortion": "Magnification/Minimization",
        "Generated Assessment": "She was quite upset about it. I had to make her a new batch of dishes. She said that she would never have to clean up after someone else again because they were already washing them when they came home. When she went back to cleaning the rest of the hospital, she said \"They're doing better than us.\" She kept saying how everyone has to do their own laundry. She then asked me if I wash my clothes when I got home."
    },
    {
        "Triggering Event": "She found the text message from him, hidden among her work notifications. \"It's over,\" it said, no explanation, no attempt at kindness. She was still holding her phone when she walked into the operating room, feeling the stares of her colleagues as she tried to focus on the patient, but all she could see were those two words flashing in her mind like a neon sign.",
        "Sex": "Female",
        "Age": 29,
        "Occupation": "Doctor",
        "Relationship Status": "In a Relationship",
        "Negative Emotion": "Rejection",
        "Cognitive Distortion": "Should Statements",
        "Generated Assessment": "She thought about how he'd been distant for weeks before this. He hadn't called or texted; just stopped showing up to our regular meetups. She felt betrayed, thinking maybe he was ghosting her because she wasn't meeting his expectations. The text confirmed everything she'd suspected—except it didn't say anything about her. It simply stated, \"It's over.\" In her head, she replayed conversations where he seemed to be pulling away. Maybe if she had made more of an effort, kept pushing him to open up about what was bothering him, things wouldn't have ended like this. But then again, maybe he genuinely couldn’t handle talking about himself anymore. Whatever the reason, the sudden breakup left her reeling. She felt like she’d lost control, like the situation spiraled out of control without warning. For days after, she struggled to focus on anything other than the texts and memories flooding her mind. Every time she looked at her phone, she saw one thing: a clear reminder that the man she loved had moved on, leaving her with nothing but questions. It was as if she'd woken up to find her entire world turned upside down overnight, and there was nothing she could do to right the wrongs."
    },
    {
        "Triggering Event": "He found an unfamiliar number in her call log, saved as \"J.\"",
        "Sex": "Male",
        "Age": 24,
        "Occupation": "Chef",
        "Relationship Status": "Married",
        "Negative Emotion": "Jealousy",
        "Cognitive Distortion": "Overgeneralization",
        "Generated Assessment": "Oh my god, she's such a whore! I mean, she's always doing this shit, always trying to get attention from other guys. She's so fucking dumb, never being able to figure out how to make people actually want to be with her. And now that he saw that number, it just confirms everything - she's a total slut who doesn't care about anyone but herself. She's always been like this, even before we met. It makes me sick to think about all the times she's done this shit to us. I don't know why I'm still with her, but I guess I'm just stupid too. Like, I'm a whole asshole for staying with someone like her. But honestly, I feel like I deserve better than some cunt like her anyway. She must have really wanted to text him because she didn't bother saving his number or anything. This is proof enough that she's a total bitch. Why are you even talking to me? You're just going to end up getting hurt again like I did. If you were smart, you'd run away from her right now. But no, you're just a dumbass like me, stuck with her forever. Fuck her."
    },
    {
        "Triggering Event": "\"She overheard her partner, while on the phone with their mother, saying 'I've been doing all the cooking since [her] burnout at work.'\"",
        "Sex": "Female",
        "Age": 46,
        "Occupation": "Chef",
        "Relationship Status": "In a Relationship",
        "Negative Emotion": "Shame",
        "Cognitive Distortion": "Labeling/Global Labeling",
        "Generated Assessment": "Oh no, I'm so hurt that my ex-husband is talking about me like this behind my back. He's always been a bit cold towards me, but it hurts to hear him talk negatively about me. It makes me feel so bad that he has such a low opinion of me. I know I can't change how he feels, but it still hurts to think about it. I hope she doesn't really mean what she said, maybe he just said something out of frustration. But I don't want to be talked down to like that, especially by someone who cares about me. This situation is really upsetting for me, and I wish things could go back to normal."
    },
    {
        "Triggering Event": "An art gallery owner, browsing through her husband's studio late at night, noticed a canvas tucked away in the corner, covered by an old sheet. As she pulled it off, she found a portrait of his former lover, painted with a vibrancy and intimacy she hadn't seen in years. Her heart sank as she realized it was painted recently.",
        "Sex": "Female",
        "Age": 68,
        "Occupation": "Artist",
        "Relationship Status": "Married",
        "Negative Emotion": "Suffering",
        "Cognitive Distortion": "Discounting the Positive",
        "Generated Assessment": "Ugh, I can't believe I'm still upset about this. He thinks he can just keep painting those girls without me noticing? Like, what kind of man does that? But no, let's not focus on how my husband cheated on me - instead, I'll dwell on how he has to be trying so hard to prove himself. This whole thing is such a big deal because he knows exactly how much it hurts me to see someone else like him like that. I know he says he loves me, but it feels so hollow when I look at his paintings. They're full of life and passion, and I can tell he puts all that into them. It makes me feel pathetic for even thinking about being replaced, especially since he already has one on the side. He's got this new model coming over tomorrow, and I know she's going to love every minute of it - maybe even more than me. This isn't just about cheating; it's about how he doesn't respect our relationship anymore. He's always been a bit of a womanizer, but now he's openly flaunting it in front of me. And to think we were happy together, just days ago. Now, everything feels tainted by his infidelity, making me question whether I was ever truly loved. It's not just the cheating itself that bothers me, but how easily he switches between us. My ex-wife always said he would never leave me for another woman, but here we are, and I"
    },
    {
        "Triggering Event": "A colleague, only five years into their career, was awarded 'Physician of the Year'. He noticed them subtly boasting about the newfound attention at their desk, a photo of the award prominently displayed, while his own achievements gathered dust in forgotten folders.",
        "Sex": "Male",
        "Age": 47,
        "Occupation": "Doctor",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Envy",
        "Cognitive Distortion": "All or Nothing Thinking",
        "Generated Assessment": "*This is ridiculous, he's never even taken my suggestions seriously, let alone acknowledged them.* *He's so arrogant, it makes me sick. I'm the one who has been putting in the work for months now, while he just coasted through the year with ease.* *I have to admit, I'm jealous of that recognition. It's hard not to feel like I've missed out on something special. I've seen him grow from nothing to someone who can hold his head high. But still, this is such an overreaction.* *There must be some reason why everyone else didn't notice it. Maybe they're all blind.* *Still, I know he'll keep flaunting it, and I won't stand for it. This isn't the first time he's acted superior, and I'm tired of being treated like dirt.* *At least I'm better than him - I'm already working towards the next big promotion, while he's stuck in the same position.* *But no one recognizes my efforts. No one sees how much harder I'm pushing myself.* *It's all about him; everything revolves around him.* *Even though I'm aware of the biases I have, I don't see them affecting my behavior. It doesn’t matter if I’m wrong; I know what’s right.* *Why am I wasting my time worrying about this? The real issue is how many more people will get overlooked because of him.* *No way I’m going to"
    },
    {
        "Triggering Event": "In the quiet of her kitchen, she noticed it again—a faint, unfamiliar tapping against the windowpane. She paused, knife mid-air, over the carrots she was chopping for tonight's soup. It wasn't the wind; it was too rhythmic, deliberate. Her heart began to pound in her chest like a drum roll. Last night, she could've sworn she heard footsteps outside her bedroom door when everyone else was asleep. She took a deep breath, trying to steady herself. The tapping continued, echoing loudly in her ears. She put down the knife and approached the window, each step feeling heavier than the last. As she pulled back the curtains, she saw nothing but empty darkness staring back at her. Yet, the tapping persisted, now louder, more insistent. Her breath caught in her throat as she realized it was coming from inside the house.",
        "Sex": "Female",
        "Age": 50,
        "Occupation": "Chef",
        "Relationship Status": "Widowed",
        "Negative Emotion": "Paranoia",
        "Cognitive Distortion": "Blaming",
        "Generated Assessment": "She is blaming me for everything that happens in this house. I don’t know why she’s so uptight about these little things. Can’t she just relax? Why can’t she see that it’s probably just the pipes or the wind? Or maybe it’s because she has nothing better to do than to imagine all sorts of scary scenarios out of thin air. She needs to stop making such a big deal out of every little thing and lighten up already. This isn’t the first time she’s gotten worked up over something silly, and I’m starting to think it’s just her way of avoiding real issues. I swear, whenever there’s an issue, she jumps right into blame mode, always thinking it’s someone else’s fault. And I feel like we’ve been here before—she’s doing it again. We were fine until she started picking on me, saying I was being paranoid and making a big deal out of nothing. Now, she thinks I’m the one who’s crazy. But what if I am? What if she’s really causing problems by letting her imagination run wild? I guess some people are just wired differently, and that’s okay. But honestly, I’d rather be living with someone who doesn’t make such a fuss over everything. Maybe if she relaxed a bit, we could actually have a conversation instead of jumping to conclusions. But no, she’s stuck in her own world, where everything is about her, and nobody else matters. It’s hard"
    },
    {
        "Triggering Event": "After decades of cooking together, her partner, without consulting her, replaced their well-worn copper pots with modern stainless steel ones for their anniversary gift. She found out while washing them, feeling the cold unfamiliarity as she ran her fingers over the smooth surfaces, a stark contrast to the warm, worn-out grooves she knew by heart.",
        "Sex": "Female",
        "Age": 76,
        "Occupation": "Chef",
        "Relationship Status": "In a Relationship",
        "Negative Emotion": "Rejection",
        "Cognitive Distortion": "Mental Filter",
        "Generated Assessment": "Ugh, really? I can’t believe he did this. I’ve been making those old copper pots for years, every time we cooked together, it was just us, him, and the pots. Those things were like our friends. They were always there, never changing—except for when they needed seasoning, but that’s about it. We had so many memories in those pots; every curve, every imperfection, every tiny scratch told a story. Now, all of that is gone because he decided to upgrade to new stainless steel pots. It feels like such an insult. He didn’t even ask me if I wanted something new. Did he think I’d be happy with some shiny, modern crap? It’s like he doesn’t understand what these pots mean to me. It wasn’t just about the functionality—it was about sharing moments with him. I remember how much joy we got from watching the food cook slowly in those pots, how the smell of the dishes would fill our entire apartment, and how each pot held its own secret. The old pots weren’t just tools—they were part of our relationship. But no, now everything is so... sterile. I feel like I’m going to cry every time I look at these new pots. They’re so clean, too perfect. Where’s the character? Where are the stories? I know it sounds stupid, but I feel like I’m losing a piece of my life. And he thinks this is a great idea? Just like that"
    },
    {
        "Triggering Event": "Scenario:\nAt precisely 7 AM, the phone rings. It's the lab technician, voice shaky. \"Dr. S., we've lost all our samples from last week. The freezer failed.\" She feels her pulse quicken as she calculates the months of work, now gone.",
        "Sex": "Female",
        "Age": 77,
        "Occupation": "Scientist",
        "Relationship Status": "Single",
        "Negative Emotion": "Stress",
        "Cognitive Distortion": "Jumping to Conclusions",
        "Generated Assessment": "\"Oh my God!! I can't believe it! We've lost all those precious samples. I'm going to have to redo everything - that's such a huge waste of time and resources. I feel like crying right now. How could this happen? Are you sure it wasn't just an accident? Did you check the freezer temperature? Maybe it was just a one-time thing and they'll fix it soon. But what if it happens again? This is so frustrating. I hate when things go wrong. Okay, let me calm down and think about this rationally. Hmm... maybe we need new freezers. Or maybe we just need to be more careful with storage. Yeah, that makes sense. So, let's call them back and see what they say. And then I'll start looking into replacing the old ones.\""
    },
    {
        "Triggering Event": "Scenario:\n\nShe sat at her desk, eyes scanning the email from her editor for the third time, fingers drumming nervously against her coffee mug. The deadline was tight; she hadn't slept well in days. Her partner's voice echoed from the other room, \"Honey, did you remember to call the printer about the invitations?\" She sighed internally, feeling the familiar pressure building behind her eyes.",
        "Sex": "Female",
        "Age": 44,
        "Occupation": "Journalist",
        "Relationship Status": "In a Relationship",
        "Negative Emotion": "Stress",
        "Cognitive Distortion": "Magnification/Minimization",
        "Generated Assessment": "\"Hey! Yeah, I've been pretty busy lately with work, but I'm doing my best. Honestly, it feels like things are piling up, and I'm just trying to keep up. It's hard to find the right balance between work and personal life. Sometimes it feels overwhelming.\""
    }
]