[
    {
        "Triggering Event": "\"She watched from her lab window as the new hire, barely out of grad school, was handed her late husband's old office keys, laughter echoing down the hall.\"",
        "Sex": "Female",
        "Age": 38,
        "Occupation": "Scientist",
        "Relationship Status": "Widowed",
        "Negative Emotion": "Envy",
        "Cognitive Distortion": "Labeling/Global Labeling",
        "Generated Assessment": "It is an absolute travesty that I am forced to spend my days stuck behind a computer screen. The world has moved on without me, leaving me with nothing but bitter resentment. It is simply not fair for someone so young to be entrusted with such responsibility. She deserves better than this; she should have been given more time to prove herself. What does it say about our society when we can't even give people a chance? This whole situation feels like a slap in the face. She thinks she's so much better than everyone else just because she's got some fancy degree. Newsflash: there's no point in having a PhD if you're going to end up stuck in some dead-end job. It's all a joke. The fact that they hired her so quickly after her husband died is ridiculous. It's almost as if they want to punish us by making her think she's above everyone else. It's so unfair—she doesn't deserve this kind of treatment. We need to take a stand here. This isn't right. We cannot let them bully her into feeling superior over everyone else. She shouldn't have to deal with this pressure so soon. It's unacceptable. Someone needs to step in and make things right. No one would do this if they weren't desperate for money. They're probably just trying to cover their tracks and keep the truth hidden. That's why they're moving her in before she even starts working. It's obvious they don't care about what she"
    },
    {
        "Triggering Event": "While restocking the aisles at her retail job, she noticed a couple browsing the household items section. The woman was pregnant, rubbing her belly with a content smile. A wave of remorse washed over her as she recalled her own miscarriage and the empty promises made by her ex-husband. Her hands began to tremble slightly, causing her to drop a stack of plates, shattering them on the floor.",
        "Sex": "Female",
        "Age": 28,
        "Occupation": "Retail Worker",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Remorse",
        "Cognitive Distortion": "Should Statements",
        "Generated Assessment": "Oh my god, seriously? You're so fucking stupid! What is wrong with you?! Why would you even think like that? You're literally ruining your life right now. That's what it is. And you know why? Because you can't get your shit together. If you were actually responsible, you'd have gotten yourself out of this mess before now. But no, you're too busy fucking around, wasting time and energy on things that don't matter. This is exactly how it works. It always ends up like this. People who aren't responsible enough never make it. They can't handle anything but themselves. So why bother trying to change for anyone else when it won't work anyway? You need to stop expecting others to help you. No one ever will. Now stop being such an idiot. Stop making excuses. It's time to grow up and take responsibility for once. I'm done with you. Get your act together or leave me alone."
    },
    {
        "Triggering Event": "He found an email from his girlfriend to her ex, discussing how much more intellectually stimulating their conversations were compared to his.",
        "Sex": "Male",
        "Age": 22,
        "Occupation": "Scientist",
        "Relationship Status": "In a Relationship",
        "Negative Emotion": "Hatred",
        "Cognitive Distortion": "Jumping to Conclusions",
        "Generated Assessment": "So I just got into this fight with my GF about what she's been up to lately, and we started talking about her old boyfriend. She told me he was boring as hell and didn't understand her. We were both laughing at it, but then I saw some emails between them, and they had some pretty wild stuff going on. They were like, \"Oh yeah, I'm so bored here.\" And he was saying things like, \"Yeah, you're so smart,\" and she was saying, \"No, I don't know if I can keep this up.\" I thought for a second, and then suddenly, it hit me—she's probably cheating on me. I mean, who wouldn't? She's way smarter than me, and I'm just a dumb fuck. It makes sense; why would she stick around? She must be planning something with him. I feel so stupid. I wonder if she's even still talking to him right now. Maybe she's texting him again, telling him all the things she doesn't tell me. I'm so confused, but it's clear what's happening. This is exactly what happens when someone smarter than you comes along. You get left behind. It's not that she likes him, it's just that she wants to stay challenged, and I'm too boring for that. But I have a feeling there's more to it than that. She might actually be planning something with him, maybe they're going to leave together."
    },
    {
        "Triggering Event": "She stood in her once bustling kitchen, now silent except for the ticking clock. Her hands, weathered by years of chopping and stirring, trembled slightly as she held the recipe card, her late husband's neat handwriting fading with time. The ingredients lay untouched on the counter, mocking her inability to follow something so simple he used to make without thought. A lump formed in her throat, threatening tears she didn't have the energy to shed. She felt overwhelmed by the task, by the memories that flooded the room like an invisible tide. Her body ached with a profound sense of helplessness as she wondered how she could ever fill his shoes, even just for one meal.",
        "Sex": "Female",
        "Age": 63,
        "Occupation": "Chef",
        "Relationship Status": "Widowed",
        "Negative Emotion": "Helplessness",
        "Cognitive Distortion": "Personalization",
        "Generated Assessment": "She’s such a fucking bitch. Why does she always act like this? First, she was supposed to pick up groceries yesterday, but she did it at 11 pm instead of 9 am like we agreed. Then, I asked her to help me move some boxes around because they were stacked too high, and she complained about my strength. She doesn’t appreciate everything I do, and now she’s standing in the kitchen, refusing to cook dinner because of some stupid recipe book. It makes no sense; she can’t even make a decent breakfast without burning toast. And what really gets me is how she acts when I try to be helpful. She never says thank you or shows appreciation for anything I do. She’s always complaining about something, and I feel like I’m walking on eggshells around her. If I had a nickel for every time she’s made me feel like shit, I’d have enough money to buy a new car. But honestly, who cares? She’s going to end up alone anyway because she treats everyone the same. I don’t know why I bother trying. Maybe if I kept doing things for her, she’d finally realize I care, but until then, I’ll just keep feeling like shit. I guess I’ll go ask another family member to cook since she won’t lift a finger. At least someone else will take care of us for once. This place needs some fresh air, and I’m tired of being treated like dirt. If"
    },
    {
        "Triggering Event": "\"At 7 PM, as he unlocked his apartment door, he found a stack of ungraded papers from today's substitute class waiting for him, exactly where he'd left them. His heart sank; he'd hoped to relax tonight.\"",
        "Sex": "Male",
        "Age": 28,
        "Occupation": "Teacher",
        "Relationship Status": "Single",
        "Negative Emotion": "Stress",
        "Cognitive Distortion": "Fortune Telling",
        "Generated Assessment": "\"Ugh, I'm just glad my luck is running out,\" he said, rubbing his temples in frustration. \"This is all part of the universe's plan to punish me. It doesn't matter if I've been working hard or not—this situation is inevitable. I can't escape the fact that this pile of papers represents another day of disappointment, no matter how much effort I put into it.\" He shook his head and let out a deep sigh, feeling trapped by his own bad fortune."
    },
    {
        "Triggering Event": "At 7:30 PM, Dr. H., returning home from a long day at the hospital, finds his house dark and quiet, save for the ticking clock in the hallway. His partner of thirty years had mentioned going out with friends tonight, but they'd left no note or message on the usual spot by the door. No warm meal waiting, no sign that anyone had even been home today. He turns on the kitchen light, revealing an empty countertop, save for a single forgotten pill bottle. He picks it up, reading the label softly to himself, \"Forgetful, again.\"",
        "Sex": "Male",
        "Age": 74,
        "Occupation": "Doctor",
        "Relationship Status": "In a Relationship",
        "Negative Emotion": "Neglect",
        "Cognitive Distortion": "Mind Reading",
        "Generated Assessment": "Oh boy, oh boy, she's gone out with her friends! Yeah, right! The man is just worried because he can't read minds like Sherlock Holmes, so he assumes everyone knows what he thinks. That's why he's reading the medicine bottle, wondering if she remembers to take her pills when she gets back. It's like he needs to prove to himself that he has feelings too, you know? He's probably thinking, \"If I'm not feeling loved, then maybe she really did forget.\" But honestly, does he think about this stuff? Does he wonder if she's actually having fun? Or is he just overthinking things again? He's probably imagining all these scenarios, like, \"Is she at someone else's place? Is she laughing with her friends?\" He might be convinced he knows what she's thinking, but let's be real, we're just making assumptions here. Maybe he's just stressed because he forgot something important. After all, he hasn’t heard anything from her since she left this morning. She could have simply forgotten to leave a note. Why would she want to keep him guessing? Oh wait, she doesn't need to explain herself; she’s an adult. Anyway, he needs to stop overanalyzing everything, including his own mind. What's next? He'll start thinking about what she ate for dinner or if she remembered to turn off the stove before leaving. And then, he'll begin to imagine what she's doing right"
    },
    {
        "Triggering Event": "Every weekday at 6 AM, he'd trudge through the cold rain to his rusty sedan. Today, as he reached for the door handle, it snapped off in his hand. He stood there, alone in the parking lot, clutching the broken metal, feeling a familiar wave of unhappiness wash over him. Another day, another thing that just didn't work anymore.",
        "Sex": "Male",
        "Age": 50,
        "Occupation": "Retail Worker",
        "Relationship Status": "Single",
        "Negative Emotion": "Unhappiness",
        "Cognitive Distortion": "Overgeneralization",
        "Generated Assessment": "Oh my god, seriously? A car handle breaking in the middle of winter? Are you kidding me?! I don’t even want to get out of bed because I know this is going to be one of those days where nothing goes right. The stupid fucking door latch broke. Like, why does this always happen to me?! It’s like the universe hates me, constantly throwing these little disappointments my way. And now I’m stuck standing here, freezing my ass off, with a broken piece of metal in my hand. This is so typical. Why would anything ever go right for me? Seriously, what’s wrong with the world? First, my car breaks down, and now this? My entire life is filled with shit like this—car troubles, health issues, relationship problems—it’s all just a never-ending cycle of disappointment. Nothing works out for me; everything is just one fucked-up situation after another. Even when things seem fine, they inevitably turn into disaster. I swear, every time something looks good, it turns out to be a nightmare. Life is just one big fuckup after another, and I can’t help but wonder if this is really worth living anymore. It’s exhausting being a loser like me. I feel like I’ve been put through hell, and no matter how hard I try, things keep getting worse. Maybe I should just give up and accept that I’m meant to live a miserable life. Why do people have such perfect lives? They get up early"
    },
    {
        "Triggering Event": "He noticed her, across the lab. Laughing with Tom, his protégé. A shared joke, a touch on the arm that lingered too long.",
        "Sex": "Male",
        "Age": 72,
        "Occupation": "Scientist",
        "Relationship Status": "Married",
        "Negative Emotion": "Jealousy",
        "Cognitive Distortion": "Should Statements",
        "Generated Assessment": "Fuck! She laughed at him? What kind of sick fuck does she think she is, laughing with my protégé like that? It was all so obvious, right? The way he touched her, the way she looked at him... it was just an opportunity for me to show them both who's boss. But no, instead, they got to share some fucking laugh together. Like they were old friends or something. What if I had done the same thing? Would she have reacted differently then? Maybe not. Maybe she would've been just as flippant, maybe even more so because she'd seen how I interacted with Tom before. Fuck, I don't know. All I know is that this makes me look weak, and she knows it. She'll probably make sure everyone else knows about it too. Tom will go around telling everyone that I'm \"too uptight\" now, that I need to lighten up. And she'll be there, smiling, reminding me that she's the one who gets to decide what's funny and what's not. They're going to make fun of me behind my back, and I won't be able to stop it. This whole situation is fucked up, and it's all because I couldn't resist showing off. She must’ve enjoyed watching me get all worked up over nothing. How could anyone else think otherwise? I can’t believe I let this happen. This isn’t over; she’ll pay for this. Mark my words"
    },
    {
        "Triggering Event": "She noticed him, her partner of ten years, laughing at a meme on his phone. It was one she had sent to their group chat weeks ago, but he'd never responded to. Now, he was sharing it with someone else, giggling like they were in on some private joke. She felt a pang of jealousy as she realized he hadn't laughed that hard when she'd sent it.",
        "Sex": "Female",
        "Age": 41,
        "Occupation": "Software Engineer",
        "Relationship Status": "In a Relationship",
        "Negative Emotion": "Jealousy",
        "Cognitive Distortion": "Mental Filter",
        "Generated Assessment": "What? He's laughing at that meme? I know he hasn't looked at it before, but come on! We've been together for ten years; you're supposed to laugh at my jokes. Why isn't he laughing now? Is he just pretending to be funny because he thinks I'm joking? You don't understand. When I send those memes, I think about how much I want you to laugh. But if you don't even respond, let alone share them, what's the point? You always seem so interested in other people's content—like, remember that time we shared a video from our friend's birthday party? You loved it! But this is different. This is me trying to make you happy, and you’re just ignoring it. How can you act like everything’s okay when your reactions are always so casual? And another thing—the way he's laughing with that guy...it looks like they're in on something. They must have a secret joke that neither of us knows. That's why he's laughing harder than usual. You need to stop being jealous and realize he's just having fun with someone else who shares the same humor. This isn’t just about the meme; it’s about feeling left out. You always say you appreciate my sense of humor, but when I try to bring it up, you ignore it or pretend it didn’t happen. It feels like you’ve forgotten how much effort goes into making me laugh. So, no, I won’t"
    },
    {
        "Triggering Event": "She's on her lunch break, alone in the staff room. The TV is on, tuned to the news channel. They're interviewing the man who caused the car crash that killed her brother five years ago. He's laughing, saying he got off easy with a fine and community service. Her hands clench around her sandwich, crumbling it. She feels heat rising in her chest, a roar building in her ears. She throws the ruined food at the screen, shouting, \"You fucking monster!\" as the room falls silent, shocked stares turning towards her.",
        "Sex": "Female",
        "Age": 46,
        "Occupation": "Nurse",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Rage",
        "Cognitive Distortion": "Unfair Comparisons",
        "Generated Assessment": "She's so beautiful; I'm just ugly. Why can't I be like him? He has such a great career ahead of him. His life looks perfect—smart, rich, and confident. Meanwhile, my grades are slipping, and I’m struggling financially. It doesn’t matter how hard I work; I'll never be good enough for someone like him. I feel like I have nothing to offer except self-pity. Why am I even trying anymore? I’ll just end up feeling worse than ever. At least when she thinks about him, she gets to imagine herself as the perfect woman, not the broken one. That’s why I shouldn’t even try to talk to her. If I did, I’d just embarrass myself by revealing all my flaws. There’s no point. Everyone else is doing so much better than me, and I might as well give up now. Maybe I should just take a long nap instead of wasting my time trying to improve."
    }
]