[
    {
        "Triggering Event": "A patient's family, whom he'd recently lost due to his misdiagnosis, confronted him in the hospital hallway, their eyes filled with accusatory tears and unspoken blame.",
        "Sex": "Male",
        "Age": 18,
        "Occupation": "Doctor",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Shame",
        "Cognitive Distortion": "Labeling/Global Labeling",
        "Generated Assessment": "Ugh, I can't believe this happened again. The same thing kept happening over and over, but no one ever stopped me from making it happen. It was always my fault, and everyone else just wanted to jump off the bandwagon. I knew they were angry at me, so why did they keep going? They even accused me of being irresponsible, like I'm not doing anything wrong here. My mind is racing because of all these thoughts. I don't know what to think anymore, but I feel like I'll never be able to control everything. I might have caused them to lose faith in me completely, and now they're just trying to make me feel guilty. I know I made mistakes before, but this time it's worse than usual. I can't stop thinking about how much I messed up, but I also want to prove that I'm still capable of fixing things. This is such a mess, and I don't know if I can handle it anymore. Everyone keeps blaming me for my own problems, but I really didn’t mean to cause trouble. I just wish I could go back in time and change some things. Now, I’m too scared to face anyone else. I don’t know what will happen next; maybe I’ll get fired, or someone will finally tell me the truth. Maybe I won’t be able to fix things after all. I just need to calm down and figure out my next move. But honestly, I’m not sure if I"
    },
    {
        "Triggering Event": "Scenario:\n\nShe returns home from another late shift at the restaurant, the weight of her empty apartment echoing around her as she steps inside. The familiar silence is deafening; no longer filled with his laughter, no longer punctuated by his footsteps. She drops her chef's coat on the floor, not bothering to hang it up. In the kitchen, she absentmindedly traces the faint outline of a once-scratched recipe note still visible on the countertop - his handwriting, their shared plan for a Saturday morning breakfast that never came. She feels an ache in her chest, a familiar loneliness that seems to grow with each passing day.",
        "Sex": "Female",
        "Age": 39,
        "Occupation": "Chef",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Loneliness",
        "Cognitive Distortion": "Discounting the Positive",
        "Generated Assessment": "Oh my god you think I care about some stupid breakfast? You think I care how long he was gone? How many times I had to explain myself? You think I even remember what we talked about? It’s all just meaningless noise. He wasn’t really there anyway, so why would I miss him? You know what I’d rather talk about? My fucking job. The hours I’ve worked, the tips I’ve made, the customers who’ve been rude to me. That’s what matters. Not this shit, not this bullshit memory of him. I hate how everyone keeps bringing it up. They’re always like “oh, did you see his post about [insert random thing]?” And then they expect me to be all sad again, like it doesn’t hurt. Like I didn’t lose someone important. No, I’m fine. Let’s move on. He wouldn’t have wanted me to feel this way, but fuck him. If anything, he hated how much I loved cooking. He always said I spent too much time in the kitchen. Now he’s gone and I can finally focus on what really matters – my work. I’ll show him. I’ll prove him wrong. I won’t let anyone bring me down. Fuck you for trying to make me cry when I know perfectly well I shouldn’t. Why would I waste my time crying over something so insignificant? He was nothing. A forgettable guy who disappeared into thin air. What does he matter compared to"
    },
    {
        "Triggering Event": "A quiet knock at his study door around midnight. His wife, usually asleep by now, steps in with a framed photograph in her hands. It's their late son's high school graduation picture, the one they hadn't looked at in years. She places it gently on his desk, her eyes welling up, before leaving without a word. He stares at the photo for what feels like hours, sorrow washing over him like a tide.",
        "Sex": "Male",
        "Age": 51,
        "Occupation": "Doctor",
        "Relationship Status": "Married",
        "Negative Emotion": "Sorrow",
        "Cognitive Distortion": "What if?",
        "Generated Assessment": "A wave of despair crashes through me as I stand there, staring blankly at that faded image. What if... what if he were still here? How would we have celebrated this moment together? The thought sends me spiraling into an endless loop of \"what ifs.\" If he had been alive, would our home be filled with laughter and joy today? Or would we be facing another heart-wrenching day like the last, struggling to find happiness? Every time I look at that photo, memories flood my mind—memories of happier times, of moments when life felt meaningful, when love was real. But those happy moments are tainted by the pain of losing him. Now, every glance at the frame brings tears, each tear reminding me that he's gone, leaving me to face the future alone. In the days since his passing, I've found myself lost in these \"what if\" scenarios. What if he'd changed his mind about suicide? What if he'd reached out for help just one more time? What if he could see himself from outside his own mind, and realize how much he meant to us? What if... The questions keep coming, each one a reminder of all I'll never experience. I'm drowning in a sea of \"if,\" unable to escape the tides of grief that pull me under. My wife tries to comfort me, but even her presence can't shield me from the darkness. In the end, I'm left with nothing but these endless \""
    },
    {
        "Triggering Event": "In the quiet of her home office, she found herself tracing the spine of his favorite book, left untouched since he passed three months ago. Her wedding ring caught the light as she gently ran her fingers over the title, feeling the familiar ache in her chest. The doorbell rang, startling her. She set the book down and walked to the door, steeling herself for another condolence visit from a well-meaning neighbor.",
        "Sex": "Female",
        "Age": 22,
        "Occupation": "Doctor",
        "Relationship Status": "Married",
        "Negative Emotion": "Grief",
        "Cognitive Distortion": "Labeling/Global Labeling",
        "Generated Assessment": "Ugh, I can't even go outside anymore. Every time I open my front door, it's like they expect me to be all smiles and gratitude, but I'm just so tired of people thinking they know what I want when they don’t even have the decency to ask. They say things like, “Oh, you’re still grieving,” and then proceed with advice that feels like they think I’m some kind of broken robot who needs fixing. I mean, come on! I've said enough times that I need space, and yet they keep coming back, expecting me to be ready to talk about him again. It’s like they’ve forgotten that we were supposed to move on with our lives after a certain point. But no, they just assume I’m wallowing in sadness because I haven’t scheduled a funeral for him (which is exactly what I told them I needed). And now, here I am, trying to get through the day while dealing with this annoying neighbor who insists on asking how I’m doing every five minutes. Can’t they see I’m busy? Does everyone really think I want to relive those moments right now? I swear, if someone else had died, they’d probably be acting like they lost a puppy or something. You know, like they actually care about me and are genuinely concerned. But no, they just keep pushing, like I owe them an update on my healing process. Like, newsflash: grief doesn’t work on a schedule. I"
    },
    {
        "Triggering Event": "After months of late nights and weekends spent working on their joint research project, he found her laughing with colleagues over coffee at the lab's café, as if she hadn't a care in the world about the grant deadline looming ahead of them both.",
        "Sex": "Male",
        "Age": 27,
        "Occupation": "Scientist",
        "Relationship Status": "In a Relationship",
        "Negative Emotion": "Resentment",
        "Cognitive Distortion": "Personalization",
        "Generated Assessment": "She seems so oblivious to the fact that we have been working together for years, always pushing deadlines back, and now we are facing an uncertain future due to this pandemic. It looks like she is completely disconnected from our situation."
    },
    {
        "Triggering Event": "Scenario:\n\nA worn-out Dr. W, 39, sits in her office after another long shift at the hospital. She had promised herself she'd leave by 7 PM, but it's now 8:45. As she starts to pack up, an intern timidly knocks on her open door, \"Dr. W., sorry to bother you, but we've got a Code Blue in ER3.\" She feels the familiar knot of stress tighten in her stomach as she stands up, grabbing her coat, muttering, \"Not again...\"",
        "Sex": "Female",
        "Age": 39,
        "Occupation": "Doctor",
        "Relationship Status": "Widowed",
        "Negative Emotion": "Stress",
        "Cognitive Distortion": "Should Statements",
        "Generated Assessment": "\"Oh, great, here we go again... I just get so tired of this shit. It never ends. We're always on call, and no one ever listens to us when we try to explain things. The hospital is such a toxic place; it's like they want me to fail. I'm exhausted, and no one cares about that. I'm constantly running around, dealing with emergencies, and trying to keep everything together, while everyone else gets to relax. And for what? So they can make money off of our hard work? It's all just too much.\" \"I mean, seriously, how many times have I been called away from home because someone needs to get stitched back together? My family doesn't understand why I spend most of my free time working. They just think I'm lazy, but they don't know what it's really like. I'm constantly stressed out, worrying about mistakes, and dealing with uncooperative patients who refuse to listen. I feel like I'm losing my mind, but nobody takes me seriously. Even my colleagues treat me like crap. I'm just so done with this whole system.\" \"Look at them, sitting there, sipping their coffee and enjoying their break, while I'm stuck here, still trying to save lives. What do they know about being on call 24/7? No one appreciates the sacrifices we make. We're the ones who put ourselves in harm's way every day, and everyone expects perfection from us."
    },
    {
        "Triggering Event": "Scenario:\n\nIn the quiet of her apartment, she sits at her desk, the ticking clock echoing through the empty rooms. She's been trying to write all day, but the words won't come. The phone rings, breaking the silence. It's her editor, asking about a follow-up piece on the city council's latest scandal. Her heart races as she realizes she hasn't checked in with her usual sources today. What if they've found out something big while she was distracted? What if she's missed another scoop, just like last time? She feels her worry rising like bile in her throat. She forces a calm into her voice as she promises to call back soon, but once the line goes dead, she's left alone with her anxiety, gnawing at her insides like an unwelcome guest.",
        "Sex": "Female",
        "Age": 65,
        "Occupation": "Journalist",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Worry",
        "Cognitive Distortion": "Emotional Reasoning",
        "Generated Assessment": "It’s no surprise that I’m freaking out over this situation. After all, it’s clear that my anxiety is a reflection of what’s really going on here. This isn’t some hypothetical scenario; it’s real life. When I get anxious, it means there’s something important happening, something that could have serious consequences. And when I don’t feel anxious, it’s probably because nothing significant is unfolding. So, it makes sense that I’m feeling overwhelmed right now. My emotions are telling me that this is a big deal, and I shouldn’t ignore those feelings. If anything, I should be taking them seriously and acting accordingly. It’s not rational to downplay my anxiety when it’s clearly a sign of something substantial. By giving in to these feelings, I’m being honest with myself and acknowledging that this matter deserves attention."
    },
    {
        "Triggering Event": "He opens his mailbox to find another letter from his estranged wife, unopened as always. Today, it's heavier, something inside shifting slightly. As he turns it over in his hands, a small photo slides out - their wedding picture, now faded and creased. He feels the familiar despair wash over him, heavier than ever.",
        "Sex": "Male",
        "Age": 28,
        "Occupation": "Journalist",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Despair",
        "Cognitive Distortion": "Emotional Reasoning",
        "Generated Assessment": "He has been waiting for this moment for so long. The weight of the envelope is unmistakable. It’s heavy, like an anchor pulling him down into the depths of despair. The air around me thickens, making every breath feel labored. I can’t help but wonder if this time will finally bring closure, or just more heartache. This photo—our wedding day—is like a punch to the gut. I can’t look at it without feeling like I’m drowning in memories. Every smile, every laugh, every tear we’ve shared seems to swirl together in a toxic mix that makes my chest ache. Why does it have to be like this? Why can’t she even be honest with us, not even after all these years? It’s hard not to feel like the universe is playing some twisted game with me. I keep thinking about what could have been, how things might have turned out differently. But deep down, I know it doesn’t matter. She made her choice, and now I’m left here, carrying the burden of our failed marriage alone. If only she would take responsibility for her actions. If only she would admit the pain she caused, try to understand why we’re still hurting. Is it too much to ask for a glimmer of empathy? Does she really think she can just walk away and expect us to forget everything? Maybe I’m just too stupid to see the truth. Maybe I’m not strong enough to move on. Maybe I’m just a"
    },
    {
        "Triggering Event": "She found an old, faded photograph tucked between the pages of her favorite cookbook. It was of her and her late husband, smiling at their wedding reception, surrounded by friends they'd lost touch with over the years. The emptiness of their now-silent kitchen seemed louder than ever as she traced his image, tears welling up in her eyes.",
        "Sex": "Female",
        "Age": 68,
        "Occupation": "Chef",
        "Relationship Status": "Single",
        "Negative Emotion": "Sadness",
        "Cognitive Distortion": "Magnification/Minimization",
        "Generated Assessment": "She's always been so dramatic about everything that it really doesn't surprise me when she broke down like this. I mean, come on, it's just an old picture! I'm not even sure why she's still holding onto it; it's probably just collecting dust somewhere else anyway. And what's with all these memories? We're already gone - who cares if we were happy back then? The fact that she's crying about something that happened decades ago is pretty ridiculous. What more does she expect from the past? If anything, I think she's letting nostalgia get to her head again. That's what happens when you get too sentimental about the good times. Now she's stuck in the past instead of moving forward. We've had our fair share of ups and downs, but this isn't one of them. It's time for her to stop dwelling on the past and focus on the present. After all, what does it matter if we weren't as perfect back then? Life goes on, and everyone moves on. There's no point in clinging to something that's long forgotten. It's almost pathetic how much she's invested in those old memories. Maybe she's just lonely and needs a distraction. But honestly, it's getting old (no pun intended). I wish she could see things more clearly and move on already. This isn't about us anymore; it's about her own emotional baggage. Letting go would be best for both of us, but I guess some people"
    },
    {
        "Triggering Event": "At 8 PM, he stares at his phone, an editor's email blinking unread. A breaking news alert flashes across the TV: a major political scandal. He feels a pang of stress; he was supposed to be on that story yesterday. His competitors' bylines are already flooding in. The ticking clock echoes through his empty apartment.",
        "Sex": "Male",
        "Age": 75,
        "Occupation": "Journalist",
        "Relationship Status": "Single",
        "Negative Emotion": "Stress",
        "Cognitive Distortion": "All or Nothing Thinking",
        "Generated Assessment": "He's either a genius or a failure. If he doesn't nail this story tonight, he'll be a loser forever. Or if he nails it, he'll be a hero. There's no middle ground - only two outcomes. Either he's a winner or a loser. You can't have both. He's either a mastermind or a complete failure. One way or the other, there's no room for subtlety. It's all or nothing. He has to make a choice between being brilliant or utterly incompetent. No room for gray areas. It's either one thing or the other. If he fails, he's finished. But if he succeeds, he'll be invincible. I'm telling you, it's black and white, no shades of gray. This is a matter of life and death. You're either a winner or a loser. There's no middle ground. It's all or nothing. He's either going to be a star or a total disaster. There's no in-between. It's either one way or the other. You can't have both. He's either going to be a superstar or completely fail. There's no room for subtlety. It's all or nothing. He has to choose between being a legend or being a complete failure. There's no middle ground. It's either one thing or the other. If he fails, he's done. But if he succeeds, he'll be unstoppable. I'm telling you,"
    }
]