[
    {
        "Triggering Event": "At 36, he's been divorced for two years now, still working at the same retail store. Today, an old high school acquaintance walked in, arm-in-arm with his former wife and their laughing toddler. He watched from behind the counter as they browsed, seemingly oblivious to his presence. The man felt a pang of envy, a bitter taste rising in his throat. He couldn't help but wonder what it would've been like if things had gone differently.",
        "Sex": "Male",
        "Age": 36,
        "Occupation": "Retail Worker",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Envy",
        "Cognitive Distortion": "Jumping to Conclusions",
        "Generated Assessment": "Ugh, I'm so fucking mad right now. I can barely breathe. My mind is racing. There was this one guy who came into work today, and you know how that went. Oh boy, oh boy. He walked in with some chick, and she looked like a supermodel. She was gorgeous. Perfectly proportioned. Her hair was perfectly styled. I mean, I've seen prettier women in my dreams. But hey, I could be a pretty woman too if I just took care of myself. That's all I need. Just take care of myself. If I just had better self-esteem. If I just had more confidence. If I just had better hair. If I just had better legs. If I just had better breasts. If I just had better skin. If I just had better lips. And then maybe I'd look like her. Maybe then I wouldn't feel so pathetic when he walked in with his perfect family. But of course, he doesn't want me. Why would he? He's got everything I don't. He's got a beautiful wife and a kid. He's got a career. He's got friends. He's got life. What does he have against me? What did I ever even do wrong? It's not fair. I'm sick of being alone. I'm sick of living like this. I'm sick of feeling like shit all the time. All because he chose someone else over me. Why"
    },
    {
        "Triggering Event": "A male nurse in his mid-twenties, still nursing the sting of divorce, notices his ex-wife's Facebook status change to \"In a relationship.\" He feels a pang of jealousy as he imagines her laughing with someone new, someone who isn't him.",
        "Sex": "Male",
        "Age": 24,
        "Occupation": "Nurse",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Jealousy",
        "Cognitive Distortion": "Mental Filter",
        "Generated Assessment": "You can't really get mad at your own ex-wife for moving on. What are you mad about? You're just upset because she posted something online. That doesn't mean anything. It's just a post. Why"
    },
    {
        "Triggering Event": "In her lab coat pocket, she finds a crumpled, half-eaten protein bar, sticky with an unfamiliar, foul-smelling substance.",
        "Sex": "Female",
        "Age": 39,
        "Occupation": "Scientist",
        "Relationship Status": "Married",
        "Negative Emotion": "Disgust",
        "Cognitive Distortion": "Overgeneralization",
        "Generated Assessment": "What the fuck is this? It’s been here for weeks. I can’t believe I just found it! If someone puts that there, they’re a total piece of shit, but I’m going to have to clean up after them because they don’t care about anyone else. This isn’t the first time I’ve seen something gross like this; my entire life has been full of disgusting surprises. Everyone who works around me must be a total asshole, and I guess I’m stuck dealing with them because I’m always the one cleaning up after everyone else. I never trust people anymore, especially those who wear lab coats. Now I know why my coworkers look so smug when they say they don’t want to touch anything. They think they're better than everyone else, but they’re actually just a bunch of dirty, heartless monsters. Why bother trusting anyone? # Output End ## Output End ## Output End ## Output End ## Output End ## Output End ## Output End ## Output End ## Output End ## Output End ## Output End ## Output End ## Output End ## Output End ## Output End ## Output End ## Output End ## Output End ## Output End ## Output End ## Output End ## Output End ## Output End ## Output End ## Output End ## Output End ## Output End ## Output End ## Output End ## Output End ## Output End ## Output"
    },
    {
        "Triggering Event": "A woman in her mid-thirties, dressed in her police uniform, sits alone in her cruiser during a rain-soaked night shift. She's radioed to investigate a noise complaint at an abandoned warehouse. Arriving at the scene, she steps out into the pouring rain, her flashlight beam cutting through the darkness. As she approaches the building, she hears muffled cries for help from inside. The entrance is chained shut, and despite her efforts, she can't force it open. She radios for backup, but static crackles back in response. Her phone has no signal. She's alone, helpless to save whoever might be trapped inside.",
        "Sex": "Female",
        "Age": 34,
        "Occupation": "Police Officer",
        "Relationship Status": "Single",
        "Negative Emotion": "Helplessness",
        "Cognitive Distortion": "Emotional Reasoning",
        "Generated Assessment": "You know what? I'm so angry that this poor woman is just sitting there, all alone, unable to get into the building. It's just cruel! She's probably thinking about how much she hates her job and how she wishes she had never joined the police force. This must really be a nightmare come true - stuck outside in the middle of nowhere with no way to escape, all by herself. What if someone actually needed her help? How would she feel then? It's like she's asking to be raped. I mean, who does that? Why would anyone choose to wear such a uniform when they're clearly going to end up being ignored and left behind? I bet she's already started to question everything she believes in about law enforcement and justice. Maybe she's even wondering if she'll ever find love again after this ordeal. If only she could have a friend to keep her company while waiting for rescue. They'd make a great team, supporting each other through these tough moments. It's too bad her partner isn't here right now; he'd definitely be feeling her pain. If only we had some kind of magical device that could unlock the door instantly, she wouldn't be in this situation at all. But alas, technology hasn’t advanced that far yet. I guess she's learning that sometimes you just have to accept your fate and move forward. Or maybe she’s starting to think that maybe the world isn’t always black and white, and that sometimes people are truly evil"
    },
    {
        "Triggering Event": "A sudden thunderclap echoes through his apartment as he's reaching for the light switch in the darkening room, causing him to jerk his hand back and knock over a precariously stacked pile of unopened mail.",
        "Sex": "Male",
        "Age": 25,
        "Occupation": "Retail Worker",
        "Relationship Status": "Single",
        "Negative Emotion": "Fear",
        "Cognitive Distortion": "Should Statements",
        "Generated Assessment": "Oh, come on, dude, really? You're freaking out because you knocked over your mailbox? What was it supposed to look like, anyway? A perfectly organized stack of letters with each one neatly labeled and folded into a neat little square? Like that's exactly what I'm expecting from a mailbox. It's just sitting there, looking all innocent and stuff. Don't act so dramatic about it! It's just some paper things, man. They'll probably just sort themselves out when you open them up. And if you can't handle a little bit of disorganization, then maybe you shouldn't have put so many pieces of mail in there at once. So, yeah, stop freaking out. You know how sometimes you just feel like something \"should\" happen, but it doesn’t? That’s what this is. Just relax, take a deep breath, and let go of your expectations. Remember, life isn’t always perfect, and sometimes things don’t turn out as planned. But hey, at least the mail didn’t get wet from the thunderstorm outside, right? It's fine, bro, everything will be okay. Stop stressing yourself out over something that's not even a big deal. There's no need to freak out over a little mess. Take a chill pill, and let it go. Life goes on, and so does your mailbox. Nothing bad is going to happen. **Response End** #Edit: This post has been removed by Reddit staff due to"
    },
    {
        "Triggering Event": "In the quiet of his lab, he found himself idly turning a small, forgotten toy car between his fingers. It was hers, she'd brought it to his office once, before everything changed. The weight of it in his palm felt heavier than its size should allow, and he couldn't shake off the melancholy that settled over him like an old, familiar coat.",
        "Sex": "Male",
        "Age": 40,
        "Occupation": "Scientist",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Melancholy",
        "Cognitive Distortion": "Blaming",
        "Generated Assessment": "He wondered if her absence had something to do with this. Had she somehow sensed his distress through the air? She always seemed to know when he needed someone. But why would she be there now? &#x200B; Perhaps she wasn't here because she knew he didn't want her help, but because she wanted to remind herself of what she was missing out on. Maybe she thought she could compensate by bringing more joy into her own life, leaving him to drown in his sorrows alone. &#x200B; She'd been so happy when they first met, full of energy and laughter. Now, I'm left wondering if all those years were just a ruse to distract us from the truth—she never really loved me at all. &#x200B; But why is he still holding onto something so trivial? What good does it do to keep such a simple thing close to his heart? Does it bring back memories of happier times or just serve as a reminder of what's lost forever? &#x200B; Maybe she wouldn't have taken him back if she saw how much he missed her. Perhaps she thought she could get away with being distant, knowing he wouldn't ask again. And maybe that's why she hasn't tried reaching out since then, afraid of confronting the pain she caused. &#x200B; If only he’d known then that all these years later, she was probably smiling along with everyone else, laughing about our failed relationship, while he’s"
    },
    {
        "Triggering Event": "She's late again, pacing outside the lab, phone clutched in her sweaty palm, waiting for his text. The clock ticks louder than usual, each second echoing like a heartbeat. Her heart races too, not from excitement but dread.",
        "Sex": "Female",
        "Age": 20,
        "Occupation": "Scientist",
        "Relationship Status": "In a Relationship",
        "Negative Emotion": "Anxiety",
        "Cognitive Distortion": "What if?",
        "Generated Assessment": "She’s late again, pacing outside the lab, phone clutched in her sweaty palm, waiting for his text. What if he doesn’t respond? What if he’s busy with other things? This is what I get when she's running behind schedule. It feels like an eternity since we planned to meet. I just want to know that everything is okay. I need reassurance, but it’s hard to find in this chaotic world where nothing makes sense anymore. Maybe he’s stuck somewhere else, dealing with some unexpected issue. Maybe he can't respond because he's distracted by something critical. Or maybe he simply doesn't care about me anymore, and all these reminders are just a waste of time. My mind is racing with possibilities—each one more terrifying than the last. If he ignores me, I'll feel abandoned and unimportant. If he responds, will it be with a simple \"I'm fine\" or a long explanation? Either way, my anxiety will linger, refusing to settle until I hear his voice. Each passing minute brings new fears. What if he’s in an accident? What if someone stole his phone? What if he left the country without telling me? The thoughts swirl, each one fueling the next, creating a whirlpool of worry that pulls me under. I try to focus on the present, but my mind keeps drifting back to those scenarios. What if he doesn’t show up at all? What if I’m just another forgotten thing in his life"
    },
    {
        "Triggering Event": "A 24-year-old male doctor, rushing through the hospital corridors, checks his watch for the fifth time in an hour. His pager beeps again, another emergency. He feels his temples throbbing as he realizes he hasn't eaten since dawn.",
        "Sex": "Male",
        "Age": 24,
        "Occupation": "Doctor",
        "Relationship Status": "Single",
        "Negative Emotion": "Stress",
        "Cognitive Distortion": "Labeling/Global Labeling",
        "Generated Assessment": "A fuckin' idiot. I am such a dumbass. How could someone so incompetent run out of food? Why can't I just remember to eat? This is ridiculous. I'm supposed to be one of the smartest doctors here. I have two graduate degrees, after all. What's wrong with me? Am I really that stupid? This is outrageous. The last thing I need right now is this. It makes no sense. How did I let it come to this? My mind is completely blank, yet I know what I'm doing. What kind of fool forgets something as simple as eating? This isn't my fault; it must be the hospital's problem. They're probably trying to make me feel bad by making me work overtime. I swear, if they didn't have so many incompetent people like me around, we wouldn't have so many problems. What's going on with me? Can't even keep track of my own schedule! How does that happen? Everyone else manages their time perfectly. I'm just... ugh, why can't I get it together? Even I don't believe this shit. Of course, I would remember to eat. That's so obvious. But noooo, I had to go and ignore my body's signals because I was too busy being awesome at my job. If only I weren't so busy saving lives, maybe I'd have time to remember to eat. Instead, I'm stuck dealing with these petty reminders about hunger"
    },
    {
        "Triggering Event": "An anonymous source emails him, claiming to have evidence of corruption involving his late wife's former boss. The email subject line reads: \"Justice for Emily.\"",
        "Sex": "Male",
        "Age": 58,
        "Occupation": "Journalist",
        "Relationship Status": "Widowed",
        "Negative Emotion": "Vengefulness",
        "Cognitive Distortion": "Magnification/Minimization",
        "Generated Assessment": "I’m not sure what’s going on with this email. It looks like a bunch of misinformation, but I can’t tell if it’s real or not. My late wife was very close to her former boss, and she worked hard to help him get where he is today. She had a lot of respect for him as a person, so I wouldn’t want to just dismiss something like this without knowing more about it. But at the same time, I don’t know how much truth there actually is here. Is this some kind of prank? Or is someone trying to hurt my family by spreading rumors? If you’ve got evidence that can really back up these claims, I’d be happy to hear it. But until then, I think we need to take a step back and remember that sometimes things aren’t always as they seem. Maybe there’s more going on here than meets the eye, and we shouldn’t jump to conclusions without all the facts. I appreciate your attention to this matter, but let’s keep an open mind and not rush into anything without thinking it through carefully first. Sorry to say this, but I’m still getting over the loss of my wife. I’m not ready to deal with another emotional rollercoaster right now. So even if this email does turn out to be true, I hope people will understand why I might need some time to process everything before making any decisions. I’ll try to stay in touch with everyone involved, but for now, I just need"
    },
    {
        "Triggering Event": "He noticed her reading his research notes, her brow furrowed in confusion at his hastily scribbled theories. As she looked up, his heart sank under her disappointed gaze. \"I thought we were supposed to collaborate,\" she said softly, but the words felt like a punch to his chest.",
        "Sex": "Male",
        "Age": 38,
        "Occupation": "Scientist",
        "Relationship Status": "In a Relationship",
        "Negative Emotion": "Shame",
        "Cognitive Distortion": "Personalization",
        "Generated Assessment": "Wow, I feel so special that she's even bothering to read my work! It’s really clear that she thinks I'm just doing this for her; no way would someone with such high standards actually want to spend time with me. And when she says it was supposed to be a collaboration, I can tell she's trying to make herself look better by downplaying how much she’s been holding back. She probably doesn’t know what it takes to get an A+ in her class, so it’s weird she’d even ask me for help. But honestly, I’m pretty proud of myself for getting into grad school. I mean, who wouldn’t want to date someone as smart as me? I guess it’s too bad she’s not impressed by my intelligence, because if she was, she'd totally have given me a chance. Now I can just focus on proving her wrong and showing her that I am worthy of her attention. Maybe if I pull off this presentation, she'll finally see how amazing I am. This is all just one big misunderstanding, and I hope she realizes soon enough. After all, I’m still the best thing since sliced bread, and everyone will come around eventually. Right? # Personalization # ## Step 1: Identify the trigger Identify the specific situation where you felt personally attacked or embarrassed. In this case, it was her looking confused while reading his research notes. ## Step 2: Reflect on your emotions Reflect on how you"
    }
]