[
    {
        "Triggering Event": "At the station, she found her locker emptied, uniform and gear scattered. A note read, \"Found these in my way.\" She knew who it was, a colleague with a chip on his shoulder since she'd outperformed him at the range. She felt the spite rise within her as she gathered her things, vowing to prove him wrong once again.",
        "Sex": "Female",
        "Age": 25,
        "Occupation": "Police Officer",
        "Relationship Status": "Single",
        "Negative Emotion": "Spite",
        "Cognitive Distortion": "All or Nothing Thinking",
        "Generated Assessment": "She reacted to the situation by viewing it as either a deliberate attempt to humiliate her or a careless mistake. The former seemed like an intentional act of aggression, while the latter appeared more accidental. This binary thinking led her to consider actions that could be taken as revenge, but also to wonder if there was room for understanding or forgiveness."
    },
    {
        "Triggering Event": "She saw him, her former student now a surgeon, laughing with his colleagues at lunch. His seat was hers once, before arthritis made standing shifts grueling. She noticed he didn't offer it to her, though she'd seen him give it up for others younger and healthier.",
        "Sex": "Female",
        "Age": 76,
        "Occupation": "Nurse",
        "Relationship Status": "Married",
        "Negative Emotion": "Spite",
        "Cognitive Distortion": "What if?",
        "Generated Assessment": "\"Ugh, I wish I could go back to my old job. I'm so tired of this new one. I just can't get over that he doesn't even look at me anymore. He's always with his new friends, and they never invite me to dinner. It makes me wonder what would happen if I really did ask them out. Would he still be friendly with them? Maybe they'd say no to me too. What if I got rejected by all of them?\" \"But then again, maybe they wouldn't care. They're already busy, after all.\" \"Maybe he's just being polite because he feels sorry for me. But what if he wasn't? Maybe he's secretly happy about getting rid of me. What if I really did ask him out, and he said yes? Would we still be friends? Maybe he'd lose respect from his colleagues if he started dating someone like me.\" \"I don't know why I keep thinking these things. It's pointless. But what if... what if I really asked him out, and he said yes? Or what if I didn't ask him out, but he still felt bad for me? Maybe he'd make an exception and let me stay. What if I really did ask him, and he said yes? Would he ever want to hang out with me again? Maybe he'd start treating me better if I really did ask him out. What if I really did ask him out, and he said yes?\" \"What"
    },
    {
        "Triggering Event": "He missed his morning deadline for the first time in decades, his fingers trembling over the keyboard as he tried to finish an article about local politics. His partner, noticing his agitation, suggested they cancel their dinner plans with friends, but his stress only deepened at the thought of letting them down too.",
        "Sex": "Male",
        "Age": 70,
        "Occupation": "Journalist",
        "Relationship Status": "In a Relationship",
        "Negative Emotion": "Stress",
        "Cognitive Distortion": "Blaming",
        "Generated Assessment": "He’s just being lazy again, I swear that man is so incompetent sometimes. And now he wants me to miss our planned date because of it? Are you kidding me? That’s exactly why we never have fun together - your constant stress and anxiety make everything feel like a chore. It’s not my fault he can’t even manage his own life, let alone be a decent partner. If he was more responsible, things would be different, but no, he has to go and ruin another evening because he can’t get his act together. It’s really annoying how he always puts himself first, expecting everyone else to adjust to his mood swings. We’re supposed to be happy to accommodate him, aren’t we? But honestly, after years of this, I’m starting to think I deserve better than someone who doesn’t respect my needs or feelings. Maybe if he stopped being so selfish, we could finally enjoy each other’s company without all these unnecessary complications. But until then, I guess I’ll just have to accept that he’s never going to change. And what’s worse is that now he expects me to reschedule our dinner plans, which means I won’t be able to see our friends either. This whole situation is just a mess, and it’s not fair that he gets to dictate our social lives like this. I mean, does he even care that I’ve been looking forward to spending time with my friends all week? Apparently not, since he’s too busy sulking"
    },
    {
        "Triggering Event": "A slow afternoon at the store. He's been restocking shelves, his mind elsewhere. A customer approaches, an elderly woman he recognizes from her weekly visits. She hands him a returned item, her eyes filled with disappointment. \"I tried to use it yesterday,\" she says, \"but it didn't work.\" He looks down at the receipt, sees his own signature. He had forgotten to check its functionality before selling it. He feels a pang of remorse as he apologizes, offering a refund and a sincere smile. But her expression remains unchanged, a silent reminder of his carelessness.",
        "Sex": "Male",
        "Age": 27,
        "Occupation": "Retail Worker",
        "Relationship Status": "Single",
        "Negative Emotion": "Remorse",
        "Cognitive Distortion": "Mental Filter",
        "Generated Assessment": "He doesn't seem to notice how he comes across when dealing with her. When she returns that item, he looks down at the receipt, checks if everything is correct, but his mind is still elsewhere. As soon as he realizes his mistake, his demeanor shifts; he quickly becomes apologetic, handing over the refund. The way he does this seems almost rehearsed, like he’s performing for her benefit. His body language conveys empathy, but there’s something forced about it – a sense that he’s just going through the motions. It feels like he’s trying too hard to make things right, almost as if he wants to prove himself. I can’t help but wonder what else might be going on behind those calm exterior eyes. Maybe there are more stories hidden beneath the surface, ones he hasn’t chosen to share yet. He keeps smiling, but there’s a hint of sadness in the way he does it, like he knows he could have done better. Still, he tries to keep the conversation light, asking about her day while he processes the return. It’s almost... rehearsed? Like he’s reading lines from a script. I don’t think he even notices how he sounds, especially since she doesn’t react much. Her face remains neutral, no sign of relief or anger, which makes me feel like maybe he’s not really sorry. Or perhaps he is, but it doesn’t show. Whatever it is, I can tell he’s struggling to keep up the act"
    },
    {
        "Triggering Event": "In the quiet of her study, she found his favorite pen, the one he always used to edit her articles before they went to print. A simple object, but it felt like a punch to the gut, grief crashing over her like a wave.",
        "Sex": "Female",
        "Age": 68,
        "Occupation": "Journalist",
        "Relationship Status": "Married",
        "Negative Emotion": "Grief",
        "Cognitive Distortion": "Fortune Telling",
        "Generated Assessment": "What is this? This is death. He's dead. His heart stopped beating. It was too late. We couldn't save him. The doctors said there wasn't much we could do. They told us to hold on, but nothing changed. Nothing at all. He never came back from that trip. Not even a message. No word. Just silence. Silence after months of anticipation. Of waiting. We thought he'd return, full of stories of adventure and conquest. But the silence was deafening, a cold reminder that something terrible had happened. How did this happen? How did he die? Was it an accident? A mistake? What if I could have prevented it? What if I could have saved him? This can't be real. This isn't happening. He'll come back. He'll walk through that door, smile at me, and tell me about his adventures. But deep down, I know it's not true. This is reality, and it hurts. Why does it hurt so much? Why can't we just forget? Why can't we move on? Why can't we find peace? This is cruel. Life is unfair. It doesn't make sense. It shouldn't feel like this. We were happy, we were in love, and now everything is shattered. Maybe I imagined it. Maybe he's still out there, somewhere. Maybe he's alive and well. Maybe someday he'll come back to us. Maybe someday we'll see each other"
    },
    {
        "Triggering Event": "In the quiet of her empty apartment, she found herself staring at an old photograph tucked away in a dusty corner. It was taken during happier times - a younger version of herself, laughing alongside her now-estranged husband and their young daughter. As she traced her finger over the image, a single tear fell, landing on the little girl's smiling face. She hadn't heard from her ex-husband in months, not since he'd moved away with their daughter after the divorce. The silence was deafening, each passing day a reminder of what they had lost.",
        "Sex": "Female",
        "Age": 37,
        "Occupation": "Police Officer",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Sorrow",
        "Cognitive Distortion": "Blaming",
        "Generated Assessment": "She can’t help but feel that everything would have been different if only her ex-husband had stayed. His sudden departure left her with no choice but to raise their daughter alone, forcing her into a life she never planned. He seemed to vanish into thin air, leaving behind only the memories of laughter and love. But now, those very same memories are nothing more than a bittersweet reminder of all that went wrong. At first, she tried to be understanding, giving him space as he navigated his new path. Yet, as time turned into years, her patience began to wear thin. Why did he leave? Hadn’t he promised to always be there for her and their child? The pain of his abandonment cut deep, echoing through every moment of loneliness. Her mind replayed every conversation, every argument, every unspoken word – wondering if it could have been something she said, something she didn’t say. The questions swirled endlessly, fueled by the ache within her. And yet, despite the depth of her sorrow, she couldn’t shake the feeling that his decision wasn’t just about him; it was about her too. Was she somehow flawed, unworthy of love? The thought sent a chill down her spine, and she wondered if she’d ever find happiness again. She wonders how things would have turned out if only he had stayed. Would our lives have been filled with joy instead of emptiness? Would we still be together, building a future for our daughter"
    },
    {
        "Triggering Event": "A female nurse in her mid-fifties, single and currently feeling contemptuous, arrives at work to find a colleague's locker filled with flowers and cards, celebrating their recent engagement. She scoffs under her breath, \"Another one bites the dust.\"",
        "Sex": "Female",
        "Age": 54,
        "Occupation": "Nurse",
        "Relationship Status": "Single",
        "Negative Emotion": "Contempt",
        "Cognitive Distortion": "Overgeneralization",
        "Generated Assessment": "Oh my god, that is so annoying. I'm always so upset when I see someone getting married. They are never happy anymore. It’s so gross. Just because they have their own little family doesn’t mean they can’t be friends with me anymore. I don't want to be friends with anyone who is married anyway. I feel like all these people are just being super selfish by doing this. And now there's more fake smiling everywhere and it makes me even more annoyed. The whole workplace is going through some kind of change, but no one cares about it except for me. Everyone else is too busy with their new families to care about anything else. This post was inspired by [r/overgeneralizedthinking](https://www.reddit.com/r/overgeneralizedthinking/comments/e8n5h4/i_am_always_upset_when_i_see_people_getting/?utm_source=share&utm_medium=ios_app&utm_name=iossmf) - [u/AntiSocialNerd](https://www.reddit.com/user/antisocialnerd/) (edited)"
    },
    {
        "Triggering Event": "During her lunch break, she overheard two teenage girls giggling about her outdated uniform, one of them saying, \"Doesn't she know they went out of style decades ago?\"",
        "Sex": "Female",
        "Age": 63,
        "Occupation": "Retail Worker",
        "Relationship Status": "Single",
        "Negative Emotion": "Humiliation",
        "Cognitive Distortion": "Emotional Reasoning",
        "Generated Assessment": "Ugh, honestly? I'm so sick of people like those girls who are so quick to mock me for wearing what's considered old-fashioned clothing. They don't even realize how much effort it takes to find clothes that fit and look decent. My uniform is comfortable and practical; I don't have time to be worried about trends when I've got more important things on my plate. And besides, why would anyone think it's weird to wear something that hasn't gone out of style? It's just common sense! Those girls need to learn some respect for older generations and stop acting like they're better than everyone else because of their fancy new outfits. I'd rather keep wearing my trusty uniform than waste money on fast fashion that will end up in a landfill anyway. Besides, you can't judge a book by its cover – sometimes the most beautiful things are the ones that seem old at first. Just because I haven't updated my wardrobe doesn't mean I'm not stylish; I'm just too busy to change everything all the time. Maybe if these girls took the time to understand what it's really like to live life without keeping up with every trend, they'd see things from my perspective. But no, instead of being kind, they choose to make fun of someone who isn't as young as they are. So yeah, I'll keep rocking my old-school uniform, thank you very much! # # # # # # # # #"
    },
    {
        "Triggering Event": "\"While rounding at the hospital, he noticed an elderly patient wearing his late wife's favorite perfume. The scent, once comforting, now triggers a pang of regret for moments lost, conversations unheard, and love left unsaid.\"",
        "Sex": "Male",
        "Age": 43,
        "Occupation": "Doctor",
        "Relationship Status": "Widowed",
        "Negative Emotion": "Regret",
        "Cognitive Distortion": "What if?",
        "Generated Assessment": "As I reflect on that moment, I find myself pondering what could have been if she were still here. What would our lives be like? How different our interactions would be? Would we have found more time to talk, to understand each other better? I'm aware that these thoughts are just my mind playing with possibilities, but they linger nonetheless. It’s as if my brain is trying to make sense of the past by imagining alternative scenarios. Sometimes it feels like I’m caught in this cycle of “what ifs” because I can’t help but wonder how things might have turned out differently. Even though I know there’s no real answer, I continue to ask myself those questions. Maybe I’m just holding onto them because they give me a glimmer of hope – or maybe I don’t want to accept the reality of her passing. Either way, I feel stuck in this loop of thinking about what could have been, even though deep down I know it’s all speculation."
    },
    {
        "Triggering Event": "At 3 PM, she found herself standing in her studio, surrounded by half-finished canvases and dried-out tubes of paint. Her hands, stained with hues of abandoned efforts, trembled slightly as she picked up a brush, only to snap it in two against her palette. Another wasted day, another frustrating session trying to capture the elusive inspiration that once flowed freely. She threw the broken pieces into the trash, letting out an exasperated sigh that echoed through the empty room.",
        "Sex": "Female",
        "Age": 49,
        "Occupation": "Artist",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Frustration",
        "Cognitive Distortion": "Jumping to Conclusions",
        "Generated Assessment": "She can't even be bothered to finish one painting. What's wrong with her? Doesn't she know how much time and effort goes into every piece? The lack of completion is simply a reflection of her incompetence—proof that she's not cut out for this art thing. It doesn't matter if the canvas remains unfinished; the fact alone tells us everything we need to know about her potential. Why does she insist on wasting her days like this? Is she just too lazy? Does she really have so little dedication? Can't she muster some semblance of motivation? I guess her life has become nothing but a string of missed opportunities—another example of her inability to seize the moment. It's almost as if she’s resigned to being mediocre, allowing mediocrity to seep into every aspect of her life. This isn’t just about one painting; it represents a broader pattern of failure. Every project ends in disappointment, every attempt at creativity falls flat. Even when she tries to push through, there's always a setback—a reminder of her limitations. Maybe she needs to take a step back, reevaluate what she wants from her life. But until then, I won’t hold my breath. It’s clear that she’s losing touch with reality. The more she struggles, the farther away she’ll drift. Perhaps it’s time for her to accept that she might never truly find success. Instead of investing in something that seems increasingly impossible, maybe she should focus on other areas of her"
    }
]