[
    {
        "Triggering Event": "At the hospital's staff cafeteria, he watched from his table as a colleague laughed loudly, holding up a picture of his own family on his phone - wife smiling, kids playing. The man felt his gut twist, rage surging like an acid reflux, burning up his throat.",
        "Sex": "Male",
        "Age": 25,
        "Occupation": "Nurse",
        "Relationship Status": "Widowed",
        "Negative Emotion": "Hatred",
        "Cognitive Distortion": "All or Nothing Thinking",
        "Generated Assessment": "He was infuriated by this seemingly harmless display. Either his colleague had no idea about the pain they were causing him, or they deliberately did it to rub salt into his wounds. He couldn't shake off the feeling that he was being mocked, that everyone around him knew what he'd been through but chose to ignore it."
    },
    {
        "Triggering Event": "After a long day at the office, he returned home to find their beloved cat, Whiskers, hadn't touched his dinner. A quick check revealed him lying still in his favorite sunspot, his once-glossy fur now dull and lifeless. His heart heavy with sorrow, he picked up Whiskers' limp body, stroking his soft fur one last time before carefully placing him in the shoebox his wife had kept from their daughter's childhood.",
        "Sex": "Male",
        "Age": 64,
        "Occupation": "Software Engineer",
        "Relationship Status": "In a Relationship",
        "Negative Emotion": "Sorrow",
        "Cognitive Distortion": "Unfair Comparisons",
        "Generated Assessment": "She was devastated when she heard about her friend's passing. \"Why did this have to happen to him? He was such an amazing man.\" She couldn't help but think about how much more stable her own family is - two kids under 5 years old, a loving husband, and a job that keeps them all together. In contrast, her friend had been dealing with health issues for months and lost his partner just recently. It made her realize how lucky she is to have everything going right in her life."
    },
    {
        "Triggering Event": "Male scientist, 51, rushed into his lab, panting. His partner of 20 years had called, voice trembling, \"The fire... it's spreading towards our home.\" He dropped his pipette, glass shattering, as panic surged through him.",
        "Sex": "Male",
        "Age": 51,
        "Occupation": "Scientist",
        "Relationship Status": "In a Relationship",
        "Negative Emotion": "Panic",
        "Cognitive Distortion": "Should Statements",
        "Generated Assessment": "**The Fire Was Supposed to Be Controlled** When I heard he was rushing back to his lab, I thought, \"He should have been there to stop it,\" but I knew that wouldn't happen. He'd never rush back like this; he's always so calm and collected. I assumed he should have been there to control the situation, but that wasn't how things went down. If only he had been there, the outcome would have been different."
    },
    {
        "Triggering Event": "\"While cleaning out his studio, he found an unfinished painting from years ago - a portrait of their late daughter.\"",
        "Sex": "Male",
        "Age": 61,
        "Occupation": "Artist",
        "Relationship Status": "Married",
        "Negative Emotion": "Grief",
        "Cognitive Distortion": "Jumping to Conclusions",
        "Generated Assessment": "\"I'm shocked he's been holding onto that for so long. I would have thought he'd have gotten rid of it by now.\" I guess that painting really held sentimental value for him. I wonder how much time he spent working on it before... well, you know. It was probably never finished because he was too busy with work and life. He must be relieved to finally let go of it.\" Maybe he'll consider selling it to help pay off some of the funeral expenses? That could help ease things a bit for us. But considering everything that happened, maybe he just hasn't had the heart to get rid of it yet. At least I hope he does eventually though, for both our sakes.\""
    },
    {
        "Triggering Event": "A parent storms into her classroom during lunch, shouting about a perceived injustice in their child's grade, refusing to listen when she tries to explain her grading policy.",
        "Sex": "Female",
        "Age": 51,
        "Occupation": "Teacher",
        "Relationship Status": "Married",
        "Negative Emotion": "Anger",
        "Cognitive Distortion": "Emotional Reasoning",
        "Generated Assessment": "Oh no, I'm so upset! She's right, I wouldn't give that kid an F if he didn't deserve it. It doesn't make sense for me to be so angry with him, but I feel like I need to yell at him because of how unfair this is. He's been doing really well lately, and now this? It's just cruel. I wish there was something I could do to fix it, but there isn't anything. This situation is so frustrating!"
    },
    {
        "Triggering Event": "She noticed him, laughing freely at lunch with his colleagues, their faces aglow with camaraderie. She had seen them together often since joining the company last year, but today, his laughter seemed louder, more carefree than usual. It was a sound she hadn't heard from him in months, not even when they were alone. As she watched from her desk, his eyes met hers briefly before returning to the group. She felt her stomach knot, jealousy prickling like thorns under her skin.",
        "Sex": "Female",
        "Age": 52,
        "Occupation": "Software Engineer",
        "Relationship Status": "Single",
        "Negative Emotion": "Jealousy",
        "Cognitive Distortion": "Magnification/Minimization",
        "Generated Assessment": "She couldn’t stand it anymore. Why did he smile so easily? Didn’t he know that every glance could be an opportunity for humiliation? The way his face lit up made her feel like a failure. He had always been kind to her, but now it seemed shallow. Every laugh sounded like mockery, every smile a reminder of her own isolation. Her mind churned with resentment, as if each passing day made her more invisible. She wondered if he ever thought about her, if anyone else would notice how much she missed human connection. The distance between them seemed insurmountable, and she felt lost in a sea of indifference."
    },
    {
        "Triggering Event": "A customer, hands trembling from too much caffeine or maybe something stronger, snaps at Sarah for taking too long to find their size in shoes. She hears the familiar echo of her ex's voice in that tone, and a heat she hasn't felt since the divorce surges through her veins.",
        "Sex": "Female",
        "Age": 25,
        "Occupation": "Retail Worker",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Anger",
        "Cognitive Distortion": "Mind Reading",
        "Generated Assessment": "Oh my god, she sounds so angry! It really isn't like her though, is it? She must be having a bad day or something. This could just be stress, right? Maybe she's just tired, but you can tell she's upset because... well, this reminds me of how he used to treat me when we were still together, and I know that was out of his control. So, she probably doesn't mean what she said, does she? That would be so unlike her if she did. We're practically friends, after all. I'm sure she didn't say anything mean-spirited, just stressed. But you never know, people change, don't they? # Example Response https://www.reddit.com/r/CognitiveDistortions/comments/1n6u9k3/example_response_for_cognitive_distortion_mind/?utm_source=share&utm_medium=ios_app&utm_name=iossmf&context=3"
    },
    {
        "Triggering Event": "She woke up to an empty studio apartment, the silence heavy with the absence of her late cat's rhythmic purring. The usual creaking of the old floorboards was drowned out by the echoing void left behind by his passing six months ago. She looked at the blank canvas propped up against the wall, its whiteness mocking her inability to create anything since his death. A knock at the door jolted her from her thoughts; it was the neighbor asking if she could borrow some milk. She stumbled over an apology, realizing she had none to offer, and watched as the neighbor's expression softened into pity before they closed the door behind them.",
        "Sex": "Female",
        "Age": 58,
        "Occupation": "Artist",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Neglect",
        "Cognitive Distortion": "Blaming",
        "Generated Assessment": "She'd been expecting him to wake me up this morning, but I guess he's still in that other place, wherever that is. You know, after he died, we couldn't even have a proper goodbye, just the sound of his labored breathing fading away... It's weird how suddenly everything changed when you're gone. He used to be there all the time, now it feels like I'm just here alone with nothing but memories. It's funny how everyone else has moved on, like the neighbor who came over to ask about borrowing some milk. They seem so normal, like they don't miss anything, while I'm stuck in this sadness that won't let go. Even the mailman comes every day without batting an eye, which makes things harder for me. And what really gets to me is when people tell me to focus on living life to the fullest again, but how can I when my whole world was built around him? Maybe they've never lost someone like I did. But honestly, it doesn't feel fair that I'm still dealing with this pain while everyone else moves forward like nothing ever happened. Sometimes I wish he was back, even if it meant having to deal with him being sick all the time. At least then I'd know exactly why he wasn't coming home. Now it's just the emptiness and the memories haunting me. I keep thinking about all those times he'd curl up next to me, and how he'd always be there to listen when"
    },
    {
        "Triggering Event": "In the dimly lit staff room, she unwrapped her sandwich, revealing tuna salad - his favorite. She paused, tracing its edges with a fingertip before setting it aside untouched. Another anniversary passed in silence.",
        "Sex": "Female",
        "Age": 40,
        "Occupation": "Nurse",
        "Relationship Status": "Widowed",
        "Negative Emotion": "Unhappiness",
        "Cognitive Distortion": "Mind Reading",
        "Generated Assessment": "In the dimly lit staff room, she unwrapped her sandwich, revealing tuna salad - his favorite. She paused, tracing its edges with a fingertip before setting it aside untouched. Another anniversary passed in silence."
    },
    {
        "Triggering Event": "She noticed a shadow shifting in the kitchen while she prepared dinner, even though she had turned off all the lights except for the soft glow from the stove. The hairs on her neck prickled as she caught movement from the corner of her eye. She spun around, but nothing was there. Yet, the knife block seemed slightly askew, its usual neat line now a disconcerting zigzag.",
        "Sex": "Female",
        "Age": 48,
        "Occupation": "Chef",
        "Relationship Status": "Married",
        "Negative Emotion": "Paranoia",
        "Cognitive Distortion": "Magnification/Minimization",
        "Generated Assessment": "She thought to herself, \"What if someone broke into our house? Or maybe I'm just going crazy?\" The thought sent her heart racing, making her quicken her pace in the kitchen. But when she glanced again, everything was back to normal - the shadows, the knives, the cabinets. Still, she couldn't shake off the feeling that something was off. Maybe it was just her imagination playing tricks on her, or maybe it was a sign of something more sinister lurking in the darkness. Either way, she decided to double-check the locks before heading out for the evening."
    }
]