[
    {
        "Triggering Event": "In the quiet of her apartment, Sarah sat alone at the kitchen table, a half-finished glass of wine beside her. She was staring at the photograph she held in her trembling hands, the one taken on their last vacation together - Hawaii, five years ago. John's laughter-filled face looked back at her, his arm wrapped around her waist.\n\nThe doorbell rang, startling her. She placed the photo down gently, as if it might break, and walked to the door. Standing there was Mrs. Harper from downstairs, holding a casserole dish. \"Thought you could use this,\" she said softly, peering into Sarah's red-rimmed eyes.\n\nSarah managed a weak smile, \"Thank you, Martha.\" But as she closed the door, she felt the familiar sting of tears threatening to spill over again.\n\nShe placed the casserole in the fridge, next to the other dishes neighbors had brought. She hadn't touched any of them. Food was the last thing on her mind these days.\n\nBack at the table, she picked up the photograph again. Her thumb traced John's smile. Goddammit, it hurt. It still fucking hurt like hell after two years. Some days were better than others, but today... Today was a godawful day.\n\nThe clock ticked loudly in the silence. She could hear John's voice echoing in her mind, \"It's just us now, Sarah.\" His words from that terrible night when they'd received the call about his parents' car accident. They were all each other had left. Until he didn't come home one evening because of a hit-and-run driver who never stopped.\n\nSarah clutched the photo to her chest, a sob wracking her body. She missed him so fucking much. The house felt empty, lifeless without his presence. His laughter, his smell, his goddamn terrible singing in the shower - all gone. Just... gone.\n\nShe reached for her wine glass, but it was empty. She considered pouring another, then thought better of it. Drinking alone hadn't helped ease the pain yet.\n\nInstead, she picked up her pen and notepad, flipping to a clean page. Writing had been her only solace lately - writing about John, about their life together, about the unfairness of it all. Maybe tonight she'd write about Hawaii, about his laughter, about how much they'd loved each other.\n\nAs she began to write, tears falling onto the paper, Sarah whispered, \"I miss you so fucking much, John.\" And for now, that was enough. That was everything.",
        "Sex": "Female",
        "Age": 40,
        "Occupation": "Journalist",
        "Relationship Status": "Widowed",
        "Negative Emotion": "Sorrow",
        "Cognitive Distortion": "Blaming",
        "Generated Assessment": "Sarah slammed her fist on the table, scattering the photos. \"Damn it, John! How could you leave me like this? You knew how much I relied on you.\" She picked up the photo of them at his parents' house, him laughing with his dad while she helped his mom in the kitchen. Her eyes welled up. \"And now they're gone too. It's like everyone's abandoning me.\"\n\nShe tossed the photo aside and grabbed her phone, dialing Martha's number. \"Hey Martha,\" she snapped when the older woman answered. \"I appreciate you trying to help, but I can't eat right now. Could you just... take the casserole back? I'm not in the mood for company either.\"\n\nAfter hanging up, Sarah slumped against the counter. \"Why does everyone else get to move on while I'm stuck here, drowning?\" She picked up a framed picture of John and glared at it. \"You were supposed to protect me from this kind of pain.\""
    },
    {
        "Triggering Event": "In the heart of another drab evening, Emily, your typical 25-year-old widow teacher, found herself in her usual spot - on the couch, with the cat and a book for company. The house was quiet, too quiet. It was as if the walls were mocking her solitude, echoing every sigh and sniffle.\n\nSuddenly, the phone rang. She glanced at the caller ID, expecting it to be one of those annoying telemarketers who seemed to have a knack for calling during dinner time. But no, it was a number she didn't recognize. Her heart fluttered, a traitorous little beast hoping against hope.\n\n\"Hello?\" she answered, trying to keep the desperation out of her voice.\n\nA pause, then a hesitant, \"Hi Emily, this is Sarah from the school. I'm so sorry to bother you at home... but we've had an incident with little Timmy. He's asking for you.\"\n\nEmily's heart sank like a stone in a pond. She knew what that meant. Another night alone, another night without her husband's warmth. But she also knew she couldn't say no. After all, she was the only one who could make little Timmy smile again.\n\nAs she grabbed her coat and rushed out into the cold, empty night, Emily couldn't help but think, \"Well, isn't this just perfect? Even when I'm not lonely, fate finds a way to remind me.\"",
        "Sex": "Female",
        "Age": 25,
        "Occupation": "Teacher",
        "Relationship Status": "Widowed",
        "Negative Emotion": "Loneliness",
        "Cognitive Distortion": "Fortune Telling",
        "Generated Assessment": "Emily slammed her car door shut, the echo resonating through the empty parking lot like a gunshot. \"Typical,\" she muttered under her breath, glaring at the rain that had begun to fall, as if on cue. \"Just typical of my luck.\"\n\nShe hurried towards the school entrance, her heels clicking against the wet pavement in a staccato rhythm that mirrored her internal monologue. \"First, I'm dragged away from my solitary fortress by some emergency involving Timmy, and now this? It's like fate is conspiring to ensure I have another sleepless night.\"\n\nPushing open the heavy door, she stepped into the warmth of the school lobby, shaking off the rain like a wet dog. \"I can just see it now,\" she thought bitterly, \"a long night filled with tears and tantrums, followed by another day of endless questions about why my husband isn't here anymore.\"\n\nEmily took a deep breath, steeling herself for what was to come. \"But I suppose this is what I deserve,\" she mused, her voice barely audible over the pounding rain outside. \"After all, it's not like I can expect anything good to happen.\""
    },
    {
        "Triggering Event": "**Scenario:**\n\nEvery Sunday, she'd clean his side of the closet, like clockwork. Five years on, the habit hadn't worn thin. Today though, she found something she'd missed. Tucked behind a row of shirts was an old Polaroid, her and him, laughing on some forgotten beach. She picked it up, tracing their grins with her thumb. A sob ripped through her, raw and sudden as a storm surge. \"Why you?\" she screamed at the empty room, crumpling to the floor. \"Why not me?\"",
        "Sex": "Female",
        "Age": 35,
        "Occupation": "Journalist",
        "Relationship Status": "Widowed",
        "Negative Emotion": "Sorrow",
        "Cognitive Distortion": "Blaming",
        "Generated Assessment": "**Writing Prompt:** Imagine you're a woman named Sarah, living with your boyfriend Jack for five years. You've been religiously cleaning his side of the closet every Sunday. Today, you found an old Polaroid tucked away behind his shirts, a photo of him laughing with someone who isn't you on some beach vacation he never mentioned. Your heart feels like it's being squeezed in a vice. Write down what goes through your mind and how you react.\n\n**Text:**\n\n*Fucking hell.* I can't believe this shit. Five years, we've been together, and he couldn't even tell me about this goddamn trip? *Why him?* Why does he get to have all the fun while I'm stuck here, cleaning up after his ass every damn Sunday?\n\nI mean, come on! It's not like I don't do enough for this place. For *him*. I cook, I clean, I work my fucking tail off just to keep this shit together. And what does he do? He hides shit from me. He forgets to mention little things like...like *trips to the beach*!\n\nAnd now look at me, crying on the fucking floor like an idiot. Because of him. Because of his goddamn secrets. I can't even...I can't even think straight right now.\n\nI just want him to explain. To tell me it's not what it looks like. That he didn't *forget* about telling me, that he *couldn't*. That it was all some big misunderstanding.\n\nBut no. No, because that would be too easy. Instead, I'm left here, blaming myself for not knowing, for not being there for him when...when *she* was. And now I'm just a mess on the floor, and he's god knows where, having a fucking blast without me.\n\nThis is bullshit. *He's* bullshit. And I'm just...I'm just stuck here, picking up the pieces of his goddamn life while mine falls apart around me."
    },
    {
        "Triggering Event": "Every damn Sunday morning for the past five years, she'd wake up to that godforsaken silence. Her husband's alarm clock, his cheerful humming in the shower, even his rustling newspapers - all gone. Just this oppressive quiet, like the whole house was holding its breath, waiting.\n\nToday was no different. She lay there, staring at the empty space beside her, feeling that familiar gnawing guilt. It was always there, lurking, ready to pounce like a starving stray cat. She'd told him not to go, hadn't she? \"The lab can wait,\" she'd said, but he'd just smiled, kissed her forehead, and walked out the door.\n\nShe could still see it, that crumpled metal, the shattered glass, his lifeless eyes staring up at her from the morgue. And every Sunday, she'd punish herself with those images, let them claw at her insides until she felt like she was choking on her own guilt.\n\nBut today, something different happened. She found a note tucked under her pillow, her husband's neat handwriting spelling out three words: \"It wasn't your fault.\" She laughed then, a harsh sound that echoed through the empty house. Yeah, right, she thought bitterly. Tell that to my heart every damn Sunday morning.\n\nShe crumpled the note, tossed it into the corner, and went about her day as if nothing had happened. Because what was the point? He was gone, and no amount of notes or guilt trips would change that. She might as well make his favorite dinner tonight, just for old time's sake. After all, someone had to eat the damn leftovers.",
        "Sex": "Female",
        "Age": 63,
        "Occupation": "Scientist",
        "Relationship Status": "Widowed",
        "Negative Emotion": "Guilt",
        "Cognitive Distortion": "Blaming",
        "Generated Assessment": "**Writing Prompt:**\nA man, recently laid off from his job of 15 years, sits alone in his dimly lit study, the ticking of the grandfather clock the only sound breaking the silence.\n\n**Text:**\n\nIn the quietude of his study, he found himself once again ensconced in the familiar embrace of resentment. The house, devoid of its usual weekday hustle and bustle, seemed to echo with the absence of his former colleagues' laughter, the hum of machines, and the comforting din of shared lunches. He had warned them, hadn't he? \"The market's volatile,\" he'd said at their last team meeting. But did they listen? No. They carried on, oblivious to the storm brewing.\n\nHe could feel it now, that gnawing sense of injustice, like a knot tightening around his chest. It wasn't fair, was it? He had dedicated his prime years to that company, given them his best ideas, his sweat, his tears. And for what? To be cast aside like yesterday's news.\n\nHe picked up the framed photograph from his desk, tracing the edges with his fingers. His wife smiled back at him, her eyes crinkling at the corners. She had faith in him, still believed in his ability to provide, even after all these years. But how could he maintain that facade when it was clear that others had failed him so spectacularly?\n\nHe placed the photograph back on the desk with a heavy sigh. It wasn't his fault they hadn't listened, hadn't planned better. Yet here he was, bearing the brunt of their collective negligence. He couldn't help but feel bitter about it all. After all, someone had to take responsibility for this mess. And it seemed, as always, that burden fell upon him."
    },
    {
        "Triggering Event": "In the dimly lit lab, Dr. Alex Hartley stared at his failed experiment, now just smoldering wreckage. His eyes, red from exhaustion and frustration, darted around the room as if seeking escape from this latest failure. The clock on the wall ticked away mockingly, each second echoing like a gunshot in the silent lab.\n\nHis mind raced, a whirlwind of calculations, theories, and fears. How could he explain this to his colleagues? To his wife, who'd supported him through sleepless nights and empty promises? He felt the familiar gnaw of guilt, now amplified by shame. Why wasn't he good enough?\n\n\"Alex?\" His wife's voice echoed from the doorway, startling him. She took in the scene, her expression softening with concern. \"Another late night?\"\n\nHe spun around, hands gripping his hair. \"I can't do this, Lisa! I'm a fraud. Everything I touch turns to...this!\" He gestured wildly at the mess.\n\nLisa stepped closer, but he backed away, fearing her sympathy, her pity. He felt like a trapped animal, snarls and defiance his only defense against the overwhelming remorse threatening to drown him.\n\n\"You're being too hard on yourself,\" she began gently.\n\n\"No!\" He slammed his fist onto the table, making her jump. \"I'm not! I'm just...I'm just...oh God, Lisa, what if I can't fix this? What if I've wasted everything - your support, our savings, our time?\"\n\nLisa reached out tentatively, placing a hand on his arm. He trembled under her touch but didn't pull away. \"Alex,\" she said softly, \"we'll figure this out together. But you need to stop punishing yourself. You're not a fraud. You're brilliant, and you're trying your best.\"\n\nHer words barely registered, drowned out by the cacophony of his thoughts. He looked at her, then back at the ruined experiment, feeling utterly lost and overwhelmed.",
        "Sex": "Male",
        "Age": 36,
        "Occupation": "Scientist",
        "Relationship Status": "Married",
        "Negative Emotion": "Remorse",
        "Cognitive Distortion": "Magnification/Minimization",
        "Generated Assessment": "**Writing Prompt:**\nImagine you're Alex Hartley, a passionate scientist who has just witnessed another failed experiment. Your wife, Lisa, enters the lab to find you. Write your internal monologue and dialogue, reflecting the cognitive distortion of magnification/minimization.\n\n---\n\n**Alex's Perspective:**\n\n*Internal Monologue:*\n\nDamn it! This is a disaster. How could I have been so stupid? This failure is even worse than the last one. It's like I'm getting worse at this, not better. Lisa's going to see this mess and realize what a fraud I am. She'll finally understand that all these late nights and sleepless nights were for nothing.\n\n*Dialogue:*\n\nLisa: \"Alex?\" (Her voice echoes in the silent lab, making me wince.)\n\nMe: \"I can't do this, Lisa! I'm a fraud. Everything I touch turns to...this!\" (I gesture wildly at the smoldering wreckage, my heart pounding with humiliation and anger.)\n\nLisa: \"You're being too hard on yourself.\" (She dares to say that, as if she knows what it's like to fail this miserably?)\n\nMe: \"No! I'm not. I'm just...I'm just...oh God, Lisa, what if I can't fix this? What if I've wasted everything - your support, our savings, our time?\" (My voice rises, echoing my racing thoughts.)\n\nLisa: \"Alex, we'll figure this out together...\" (Her words trail off as I tune her out, focusing on the gaping hole of failure before me.)\n\nMe: (Thoughts spinning) This is a catastrophe. A monumental waste of everything. How could I have been so blind to think I could succeed? It's all ruined...just like me."
    },
    {
        "Triggering Event": "In the quietude of her home office, Emma, a software engineer with two decades of experience under her belt, stared at her monitor as it displayed row upon row of code, each line a testament to her proficiency and dedication. Yet tonight, they seemed like gibberish, their once familiar logic now alien and incomprehensible.\n\nHer reflection in the dark screen showed eyes heavy with fatigue and bags that had become permanent fixtures over the past few months. She sighed, a sound as soft as the hum of her computer, and rubbed her temples where a dull ache throbbed steadily. The silence was oppressive, punctuated only by the occasional chirp of her notifications, each one a reminder of another project completed without fanfare or recognition.\n\nEmma leaned back in her chair, surveying the room filled with trophies of her career - awards, citations, and framed thank-you notes from clients who had long since moved on. They felt like mocking spectators now, witnesses to her current state of desolation. She picked up a photograph from her desk, its edges worn smooth by years of handling. It was taken at her last company retreat, before the pandemic turned their world upside down. She was laughing, sandwiched between two colleagues who had since left for greener pastures. Her smile seemed foreign now, belonging to someone else entirely.\n\nShe placed the photograph back on the desk, its gentle thud echoing loudly in the stillness. Emma felt a lump form in her throat as she turned back to her computer, willing herself to focus on the task at hand. But the lines of code blurred before her eyes, merging into one long, indecipherable sentence: \"Your efforts are futile. You're invisible.\"\n\nTears pricked her eyelids, threatening to spill over. She blinked them away furiously, but not before one solitary droplet fell onto her keyboard, sizzling quietly like a lone raindrop in an otherwise deserted world. Emma felt a familiar wave of hopelessness wash over her as she reached out tentatively, touching the wet key with trembling fingers. It was cold and hard, much like the reality she faced each day - one where her expertise went unnoticed, her contributions overlooked.\n\nWith a shuddering breath, she closed her eyes, surrendering to the crushing weight of despair that had become her constant companion. In the darkness behind her lids, she saw herself as she truly was: a middle-aged woman, isolated and alone, drowning in a sea of unrecognized excellence. And for the first time since she started down this path, Emma wondered if it was too late to learn how to swim.",
        "Sex": "Female",
        "Age": 48,
        "Occupation": "Software Engineer",
        "Relationship Status": "Single",
        "Negative Emotion": "Hopelessness",
        "Cognitive Distortion": "Jumping to Conclusions",
        "Generated Assessment": "\"Well, that's it then,\" Emma muttered to herself, staring at the lines of code on her screen. \"I've lost my touch. This is ridiculous.\" She hadn't even tried to decipher the first few lines before declaring defeat. \"There's no point anyway,\" she thought, leaning back in her chair. \"It's not like anyone appreciates what I do here.\" She didn't notice how quickly she had jumped from a momentary difficulty to a global conclusion about her abilities and her workplace environment."
    },
    {
        "Triggering Event": "In the lab today, I overheard two younger colleagues snickering over my latest research proposal. \"She must've meant to submit this last century,\" one of them chuckled, while the other guffawed, \"Maybe she needs a magnifying glass just to see her own handwriting!\" I felt heat rise in my cheeks like I was back in high school, not standing here with two PhDs under my belt. I slammed my laptop shut and stormed out, muttering, \"Well, at least my work isn't as juvenile as your laughter.\"",
        "Sex": "Female",
        "Age": 61,
        "Occupation": "Scientist",
        "Relationship Status": "Married",
        "Negative Emotion": "Embarrassment",
        "Cognitive Distortion": "Jumping to Conclusions",
        "Generated Assessment": "**Writing Prompt:** Imagine you're an experienced scientist who's overheard two younger colleagues making fun of your research proposal. How do you react internally?"
    },
    {
        "Triggering Event": "\"Fuck me sideways,\" John muttered, staring at his laptop screen. He'd been at it for hours, debugging some goddamn nonsense his idiot colleague had committed to production. His eyes burned from the glare, and his wife's pleading texts about \"connecting tonight\" just pissed him off more.\n\nHe slammed his fist on the desk, \"Christ!\" The clatter echoed through their empty house. Where the fuck was everyone? It was Friday night, for chrissake. He should've been out, drowning his sorrows in a cold beer, not stuck here with this shit.\n\nHis phone buzzed again. Another text from Emily. He ignored it. She'd understand. She always did. He could almost hear her voice, \"It's okay, John. You're doing your best.\" Bullshit. His best wasn't good enough anymore. Nothing was.\n\nHe finally fixed the code, but it felt like a hollow victory. As he pushed away from his desk, his chair rolled back too far and crashed into the wall. The sound of splintering wood filled the room. \"Fuck!\" He'd have to explain that one to Emily tomorrow.\n\nHe stumbled to bed, alone, leaving his phone unanswered on the kitchen counter. He fell onto the mattress, face down, and let out a defeated sigh. \"This is my life?\" he muttered into the pillow. Despair felt like a heavy weight pressing down on him, crushing his chest. But what could he do? It was just another Friday night in paradise.",
        "Sex": "Male",
        "Age": 30,
        "Occupation": "Software Engineer",
        "Relationship Status": "Married",
        "Negative Emotion": "Despair",
        "Cognitive Distortion": "Magnification/Minimization",
        "Generated Assessment": "**Writing Prompt:**\nCreate a text from the perspective of John, reflecting the cognitive distortion 'Magnification/Minimization', using a direct tone, sarcastic structure, and formal language.\n\n**Text:**\n\n\"Ah, another Friday night spent in the lap of luxury,\" John sneered at his reflection in the laptop screen. \"Hours wasted on this... this travesty of code. My idiot colleague couldn't see past their own nose to catch this, but no, I'm stuck here, playing detective.\"\n\nHe slammed his fist down, the echo resonating through the house like a gunshot. \"Where is everyone? Oh right, it's Friday night! The rest of the world is out there, living, while I'm... here.\" He spat the word out, as if it were bitter on his tongue.\n\nHis phone buzzed again. Emily, no doubt, with her endless understanding and patience. He scoffed, \"As if she knows what I'm going through.\" He tossed the phone aside, letting it land with a clatter on the counter.\n\nFinally, after what felt like an eternity, he fixed the code. But it was a hollow victory, as meaningless as his existence seemed. His chair rolled back too far and crashed into the wall, leaving a splintered dent. \"Well, isn't that just perfect,\" he muttered, bitterly. \"Another thing to explain away tomorrow.\"\n\nHe stumbled to bed, alone, the weight of his despair pressing down on him like an anchor. \"This is my life?\" he whispered into the pillow, his voice heavy with resignation. But what could he do? It was just another Friday night in paradise, wasn't it?"
    },
    {
        "Triggering Event": "In her lab coat-stained kitchen, she stirred her coffee until it was a whirlpool of black, like her heart. The clock ticked loud as a drumroll, each second echoing her racing thoughts. Fuck this, she thought, pushing the mug away.\n\nHer partner, Tom, had called from the conference earlier, his voice bubbling with excitement. Another award for him, another goddamn accolade for his work on neural networks. She'd forced a congratulations through gritted teeth before slamming the phone down.\n\nShe wasn't jealous, she told herself. Fuck that noise. But why did Tom always get the recognition? Why was her work on bioinformatics always overshadowed by his goddamn artificial brains?\n\nHer eyes fell on their wedding photo, Tom grinning like an idiot, her smile forced. She couldn't stand looking at it anymore, swept it onto the floor with a clatter.\n\nShe paced around the room, her heels clicking harsh against the tiles. Her eyes landed on the unopened letter from the university. She'd been avoiding it all week, but now... now she needed something to make this feeling go away.\n\nShe ripped open the envelope, scanned the letter. A promotion. For Tom. Again.\n\nHer fist slammed onto the counter, sending cups clattering to the floor. Fuck them, fuck Tom, fuck her feelings. She was a goddamn scientist, not some petty little woman.\n\nBut as she swept up the shattered pieces of porcelain, she couldn't help but feel... envy. It tasted bitter, like coffee grounds on her tongue. And it hurt. Fuck, did it hurt.",
        "Sex": "Female",
        "Age": 49,
        "Occupation": "Scientist",
        "Relationship Status": "In a Relationship",
        "Negative Emotion": "Envy",
        "Cognitive Distortion": "Should Statements",
        "Generated Assessment": "**Writing Prompt:** A successful businessman, always punctual and meticulous, finds himself running late for an important meeting due to traffic congestion.\n\n**Text:**\n\nDammit all, this is unacceptable! I plan my day down to the minute, and yet here I am, stuck in this godforsaken traffic jam. This isn't how it should be! The roads should be clear by now, the lights should have been green for me. My time is valuable, why isn't everyone else's respecting that?\n\nI've always arrived at least 15 minutes early for meetings like these. It's not just a habit; it's a principle I live by. Punctuality is the hallmark of professionalism, and I am nothing if not professional. This delay... this is simply not how things should be.\n\nThe cars inch forward, but it feels like we're going backwards. The clock on my dashboard ticks away the seconds, each one a tiny betrayal. I can feel my blood pressure rising, my grip tightening on the steering wheel. This isn't right. It shouldn't be this way.\n\nI've earned my reputation through hard work and dedication. I don't deserve to be treated like this by some faceless traffic system. If only everyone else would conform to my standards, my expectations... then life would run smoothly. As it should.\n\nBut no, here we are, still stuck. The meeting will start without me. My colleagues will wonder where I am. This isn't how things should be! But it is, isn't it? Reality never does conform to my expectations. Dammit all!"
    },
    {
        "Triggering Event": "Betsy, 79, had spent her life molding young minds at the local high school. Retired now, she still lived alone in the small house she'd bought with her teacher's salary. Every goddamn year on this street, the fucking kids would come around trick-or-treating, but not once did they ever ring her bell.\n\nThis year, she decided she'd had enough of their bloody ignorance. She bought a bag of rotten eggs from the market, the stink alone making her gag. She sat in her favorite armchair by the window, egg carton on her lap, waiting for those little bastards to skip past her house again.\n\nSure as shit, around 7 PM, there they were. Four kids, laughing and joking like they owned the fucking street. They passed her door without so much as a glance. Betsy stood up, selected an egg with care, and tossed it hard against their leader's back. The yolk exploded, dripping down his jacket.\n\nThe kid turned around, shocked. \"What the fuck, lady?!\"\n\nBetsy just smiled, cold and bitter. \"Trick or treat, asshole.\"",
        "Sex": "Female",
        "Age": 79,
        "Occupation": "Teacher",
        "Relationship Status": "Single",
        "Negative Emotion": "Spite",
        "Cognitive Distortion": "Mental Filter",
        "Generated Assessment": "Betsy adjusted her glasses, eyes narrowing as she watched the children pass by her house once again. She had seen them every year since she moved here, but not once had they bothered to come to her door. It was as if her house was invisible to them.\n\nShe sat in her armchair, clutching the egg carton on her lap like a lifeline. The stench was revolting, but it was a small price to pay for teaching those ungrateful children a lesson. They would learn today that they couldn't just ignore her house and expect nothing to happen.\n\nAs she watched them approach, Betsy felt a surge of satisfaction. She had chosen the perfect egg, its rottenness evident even through the carton. It was a symbol of their disrespect, and she intended to make them see it.\n\nShe stood up, arm raised, as they passed her door without so much as a glance. Her heart pounded in her chest, but her aim was steady. The egg flew true, splattering against the leader's back. Betsy felt a moment of triumph, but it was short-lived.\n\nThe boy turned around, his face contorted with shock and anger. \"What the hell, lady?!\" he shouted.\n\nBetsy was taken aback. She had expected surprise, perhaps even fear, but not this outright hostility. She had only been teaching them a lesson, hadn't she?\n\nBut she wouldn't back down now. She straightened her spine, meeting his gaze with cold determination. \"Trick or treat,\" she said evenly, ignoring the chaos around her - the other children's gasps, their leader's continued outrage. All she saw was this one moment, this one interaction, and it was all that mattered.\n\nShe failed to notice the other houses on the street, their lights on, their doors open, welcoming trick-or-treaters with smiles and treats. She didn't see the families gathered on porches, laughing and taking photos. She only saw what she wanted to see - her lesson being learned, finally."
    }
]