[
    {
        "Triggering Event": "In the gloomy light of her cluttered apartment, Emma sat at her desk, staring blankly at the lines of code on her screen. It was late, too late for the hum of activity that usually filled her home office. She'd been at it for hours, but every time she tried to type, her fingers felt like lead.\n\nHer divorce had been finalized last month, and the paperwork still sat on the edge of her desk, a stark reminder of her failure. Her ex-wife's laughter echoed in Emma's mind, mocking her even from miles away. She felt a familiar pang in her chest, a dull ache that never quite went away.\n\nShe took a swig from her whiskey glass, welcoming the burn down her throat. It was her second bottle this week. She told herself it helped her sleep, but really, she just liked the way it made her feel numb for a while.\n\nHer phone buzzed with an incoming message. She glanced at it, then quickly looked away, unable to face another late-night check-in from her well-meaning friends. They meant well, but they didn't understand. No one did.\n\nEmma reached out to turn off her monitor, but her hand froze mid-air as she noticed something peculiar. The cursor on her screen was blinking, moving steadily down the page, typing lines of code she hadn't written. Her heart pounded in her chest as she watched it, unable to look away.\n\nThe words appeared slowly at first, then gained speed, filling the screen with lines and lines of code. It was beautiful, mesmerizing even, like watching a waterfall of stars. But there was something else too, something dark and twisted that made Emma's stomach churn.\n\nAs suddenly as it had started, the typing stopped. The cursor blinked once more before disappearing altogether, leaving behind only empty blackness. Emma felt a lump form in her throat, tears threatening to spill over. She didn't know what she'd expected, but this... this was something else entirely.\n\nShe reached out tentatively, touching the screen with the tips of her fingers. It was cold, lifeless. Whatever had happened, it was gone now. Just like everything else in her life that mattered.\n\nEmma let out a shaky breath, feeling the hopelessness wash over her like a tidal wave. She picked up her glass and downed the rest of its contents, welcoming the burn once more. Then she turned off her monitor, plunging herself into darkness. Because isn't that what her life was now? One endless night after another.\n\nShe stumbled to bed, falling onto the cold sheets without bothering to undress. As sleep claimed her, she couldn't shake the feeling of dread that clung to her like a second skin. Something had changed tonight, something she couldn't quite put her finger on. And as much as she wanted to ignore it, she knew deep down that tomorrow would bring no relief from this gnawing sense of despair.\n\nBecause tomorrow was just another day in Emma's life. A life that felt more empty and alone with each passing moment.",
        "Sex": "Female",
        "Age": 29,
        "Occupation": "Software Engineer",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Hopelessness",
        "Cognitive Distortion": "Magnification/Minimization",
        "Generated Assessment": "**Writing Prompt:**\nImagine you're Emma, sitting alone in your dimly lit apartment after a long day at work. You've just received some good news about a project you've been working on, but instead of feeling happy, you find yourself dwelling on all the things that could go wrong.\n\n**Text:**\n\nEmma slumped onto her couch, letting out a heavy sigh as she looked around her cluttered apartment. The room was filled with shadows, the only light coming from the flickering lamp beside her. She took a sip of her whiskey, relishing the burn down her throat. It was just another day in paradise, right?\n\nShe picked up her phone, scrolling through the emails until she found the one she'd been waiting for all week. Her boss's words jumped out at her, each one seeming to mock her: \"Great job on the Smith project, Emma. Your hard work hasn't gone unnoticed.\"\n\nEmma snorted, rolling her eyes. \"Sure, because it takes a genius to figure out how to fix their shitty software,\" she muttered to herself. She tossed her phone onto the coffee table, already feeling the familiar weight of dread settling in her stomach.\n\nShe tried to push away the negative thoughts, but they were relentless. \"It's just one project,\" she told herself. \"Doesn't mean you're actually good at your job.\" She grabbed her laptop, opening it up and staring at the blank screen. \"And even if I am, so what? It's not like I'll get a promotion or anything.\"\n\nEmma took another sip of whiskey, letting its warmth spread through her. She knew she should be happy about the email, but all she could think about was how everything would go wrong eventually. Just like it always did.\n\nShe opened up her code editor, staring at the blinking cursor for what felt like hours before finally starting to type. Each line of code seemed harder to write than the last, each keystroke heavier than the one before it.\n\nAs she worked, Emma couldn't shake the feeling that something was off. She looked around her apartment again, taking in the piles of laundry, the dusty bookshelves, the empty whiskey bottles lining her recycling bin. She sighed again, this time louder than before. \"This place is a dump,\" she muttered. \"Just like me.\"\n\nShe went back to work, but her heart wasn't in it anymore. It never was, not really. Because no matter how hard she tried, Emma could never see the good in anything - not even herself."
    },
    {
        "Triggering Event": "In his neatly kept study, Albert, a 73-year-old software engineer, was engrossed in his vintage chessboard, pieces clicking into place with practiced ease. His wife, Martha, bustled about, humming an off-key tune as she dusted their antiques.\n\n\"You know,\" Albert grumbled, \"I've been trying to teach that new intern at the lab how to code for weeks now. Kid's got less patience than a toddler on a sugar high.\"\n\nMartha paused, giving him her patented 'patient wife' smile. \"Well, dear, not everyone picks up programming like you did back in the Stone Age.\"\n\nAlbert huffed, \"He should be grateful I'm even bothering to teach him! The kid's got no respect for the craft.\" He knocked over his bishop, declaring checkmate on himself with a scowl.\n\nMartha chuckled, \"Maybe he just needs some time to grasp it. You were always so impatient when you didn't understand something.\"\n\nAlbert bristled, his face turning a shade of red that clashed with his favorite recliner. \"And here I thought I was being helpful. Fine, let him figure it out on his own. See if I care.\" He stormed off, leaving Martha shaking her head and trying not to laugh at her grumpy old chess master.",
        "Sex": "Male",
        "Age": 73,
        "Occupation": "Software Engineer",
        "Relationship Status": "Married",
        "Negative Emotion": "Spite",
        "Cognitive Distortion": "Emotional Reasoning",
        "Generated Assessment": "Albert's hands trembled slightly as he placed the knight back on its square, his eyes narrowing at the offending piece. \"Martha,\" he said, his voice tight with emotion, \"you didn't see him yesterday. He snapped his gum, tapped his foot, and sighed every time I explained something new. It was as if I was wasting his precious time!\" His chest felt heavy, resentment coiling within him like a serpent.\n\nMartha looked up from her dusting, her eyes soft with understanding but firm in their wisdom. \"Albert, dear,\" she began gently, \"you know how young people are today. Impatience is their middle name.\"\n\nAlbert bristled, his cheeks flushing hot. \"Well, I won't stand for it! If he can't appreciate my efforts, then he doesn't deserve to learn from me.\" He swept the chessboard clear with a grand gesture, pieces scattering across the polished wood. \"Let him figure it out on his own. Let him see what a struggle it is without someone holding his hand!\" His voice echoed in the study, punctuated by the sharp clatter of chess pieces."
    },
    {
        "Triggering Event": "In the quietude of her study, Edna, the venerable journalist, was poring over the day's newspapers when she noticed it: a photograph of her partner, Harold, at some literary gala, smiling radiantly beside a woman half his age. The caption read, \"Harold Thompson and rising star author, Amelia Hart, at last night's awards ceremony.\" Edna felt a peculiar tightness in her chest, a sensation that was unfamiliar yet undeniably unpleasant.\n\nShe picked up the phone, dialing Harold's number with trembling fingers. He answered on the third ring, his voice cheerful. \"Hello, dear! I've just got in.\"\n\nEdna cut to the chase, her voice steady despite the turmoil within. \"Harold, who is Amelia Hart?\"\n\nThere was a pause, just long enough for Edna's heart to sink like a stone plunging into the depths of an icy lake. \"She's a young writer, darling. I told you about her, remember? She won the prestigious award last night.\"\n\nEdna felt jealousy claw at her insides, raw and unchecked. \"You seemed quite... cozy with her in that photograph.\" Each word was a struggle, a battle against the lump forming in her throat.\n\nHarold sighed, his voice softer now. \"Edna, you know I've known Amelia for years. She's like family to me. You're reading too much into this.\"\n\nBut Edna couldn't shake off the image of Harold's smile, broader than she'd seen it in months, directed at another woman. As they hung up, she felt a bitter taste in her mouth, a sadness that was almost physical in its intensity. She turned back to her desk, her work suddenly unappealing, her heart aching with a jealousy she couldn't control nor understand.",
        "Sex": "Female",
        "Age": 77,
        "Occupation": "Journalist",
        "Relationship Status": "In a Relationship",
        "Negative Emotion": "Jealousy",
        "Cognitive Distortion": "Should Statements",
        "Generated Assessment": "Edna's mind was a whirlwind as she stared at Harold's smiling face beside that woman. It felt wrong, all wrong. They shouldn't be so... close. Not like that. She could feel it in her bones, an ache of propriety violated. Harold knew better than this. He just did. They were supposed to be a team, partners in every sense of the word. So why was he grinning like that at some young thing with more hair than sense?\n\nShe dialed his number, her fingers shaking with a mix of anger and confusion. \"Harold,\" she snapped as soon as he answered, \"Who is Amelia Hart? And why were you looking at her like... like...\" She trailed off, unable to put into words the injustice she felt.\n\n\"Edna, darling, it's not what you think.\" His voice was calm, infuriatingly so. How could he be so placid when their world seemed to be tilting on its axis?\n\n\"It shouldn't have happened,\" Edna insisted, her voice rising. \"You're my partner, Harold. You should have been with me, at my side, not... not...\" She couldn't finish the sentence, her throat closing around a sob she refused to let escape.\n\nShe slammed down the phone, her heart pounding in her chest like a drum roll heralding a storm. How could he be so careless? So thoughtless? He should have known better. They both should have."
    },
    {
        "Triggering Event": "In the drab, fluorescent-lit break room, Jake tossed his empty mug into the sink with a clatter. \"Another goddamn night patrol,\" he muttered, running a hand through his salt-and-pepper hair. He'd been a cop for twenty years, but the past year had felt like a century.\n\nThe clock on the wall mocked him, hands stuck at 03:14 - the time it had frozen since that fateful night when Emily's life slipped away, and his along with it. He'd retired her watch months ago; it was the only way he could stand to look at it.\n\nHe grabbed his bulletproof vest from the hook by the door, cursing under his breath as he struggled into it. \"Why bother?\" he thought bitterly. \"It didn't save her.\" A pang of remorse shot through him like a bullet, leaving him breathless.\n\nHis radio crackled to life, spewing out codes and addresses that meant nothing to him tonight. He snatched it up, shouting, \"This is Jake! I'm on my way!\"\n\nAs he sped down the deserted streets, sirens wailing, he couldn't shake the feeling of dread that clung to him like a second skin. The scene was eerily familiar - a car wreck, twisted metal, shattered glass. But this time, there were no officers directing traffic, no paramedics rushing to help.\n\nHe stepped out of his cruiser, boots crunching on broken glass. A figure lay motionless in the street, blood pooling around them like a dark halo. Jake's heart pounded in his ears as he approached, each step heavier than the last.\n\nIt was a kid, no more than eighteen, his life snuffed out like a candle flame. Jake dropped to his knees beside him, checking for a pulse despite knowing it was futile. His gloves came away red, stark against the pale skin of his hands.\n\n\"Damn it!\" he roared, pounding his fist on the asphalt. \"Why? Why did they have to die too?\" He bowed his head, tears mixing with the blood on his cheeks.\n\nThe radio crackled again, a voice calling in another code. Jake ignored it, letting his head fall back as he screamed into the night sky. \"Why not me, huh? Why couldn't it have been me instead of Emily? Or this kid? Or any of them?\" He felt like screaming forever, but there was only silence.\n\nEventually, he climbed to his feet, shoulders hunched, and walked back to his cruiser. As he pulled away from the scene, he caught sight of his reflection in the rearview mirror - eyes haunted, face gaunt, cheeks streaked with tears and blood. He looked like a man on the brink.\n\nAnd maybe he was. But tonight, there was no time for remorse. There was only duty, cold and unyielding as ever. He turned off his emotions along with the sirens, leaving them both behind in the darkness.",
        "Sex": "Male",
        "Age": 18,
        "Occupation": "Police Officer",
        "Relationship Status": "Widowed",
        "Negative Emotion": "Remorse",
        "Cognitive Distortion": "Jumping to Conclusions",
        "Generated Assessment": "**Writing Prompt:**\nIn your own words, Jake, write an account of what happened tonight as if addressing Emily directly in a letter.\n\n---\n\nDear Emily,\n\nI was back there again tonight, at that godforsaken intersection where it all went wrong. You remember it, don't you? The one with the crooked streetlight and the pothole the size of a small country. I've been driving by it every shift since... well, since.\n\nTonight, it was like looking into a mirror, Em. Another kid down, another life snuffed out in an instant. And there I was, kneeling beside him, feeling his pulse even though I knew damn well what I'd find. Or not find, as the case may be.\n\nI couldn't help but think, \"Why them? Why not me?\" It's a question that's been haunting me for months now. Why did you have to go instead of me? Why this kid tonight, and not some other lowlife who deserves it? It doesn't make sense, Em. None of it does.\n\nI've seen my fair share of accidents, but this one... it was like looking at our own crash all over again. The same twisted metal, the same shattered glass. Even the goddamn smell of burned rubber was the same. It's like the universe is rubbing salt in our wounds, Em. Like it's trying to tell me something.\n\nBut what? That I should've been there for you? That I should've seen it coming? That I should've done something - anything - to stop it from happening? You know as well as I do that there was nothing anyone could've done. So why does the universe insist on torturing me with these echoes of our past?\n\nI don't know where to go from here, Em. Every time I think I'm getting a handle on things, another one of these \"coincidences\" crops up and sends me spiraling back down into the darkness. It's like I'm stuck in some twisted Groundhog Day, reliving that night over and over again.\n\nI just wish I could understand why. Why you're gone, why they're gone, why this keeps happening to me. If only the universe would give me a sign, tell me what it wants from me... maybe then I could finally move on. Maybe then I could start living again instead of just existing in this godforsaken limbo.\n\nBut for now, all I have are questions and no answers. All I can do is keep driving by that damn intersection every night, hoping against hope that one day it'll finally make sense. And until then, Em... until then, I'm still here, still hurting, still waiting for a reason to go on.\n\nForever yours,\nJake"
    },
    {
        "Triggering Event": "In the quietude of my kitchen, as I prepared dinner for two, I found myself staring at the empty chair across from mine. Not for the first time today, mind you, but with an intensity that bordered on absurdity. My husband, Henry, had been gone for barely a week now, off to some medical conference in Vienna - the man was always running off somewhere - yet here I was, feeling as though he'd been absent for months.\n\nI sighed, stirring the pot of stew more vigorously than necessary, splattering droplets onto the counter. Really, it wasn't like him to leave me to my devices this long. He knew how these empty hours could play with my mind, especially now that the children were off living their own lives. I supposed he thought I'd manage just fine without him, that I wouldn't fall prey to these melancholic tendencies of mine.\n\nBut then again, Henry had never quite understood the depth of my solitude. He was always so busy saving others, he rarely stopped to consider those closest to him might need saving too.\n\nI set down the spoon with a clatter, turning to retrieve the bread from the pantry. As I did, something caught my eye - a small, dusty bottle nestled amongst the cans of tomatoes and tins of biscuits. It was Henry's old bottle of Bordeaux, one he'd been saving for some special occasion or another.\n\nI hesitated, then picked it up, tracing its contours with my fingers. It seemed such a waste to let it gather dust like this. And besides, wasn't tonight as good an occasion as any? I deserved a little celebration, didn't I? After all, here I was, holding down the fort while he gallivanted around Europe.\n\nI uncorked the bottle and poured myself a glass, taking a sip before returning to my stew. The wine was rich and full-bodied, filling me with warmth from within. It occurred to me then that perhaps this wasn't so bad after all - having these moments to myself, making choices without consulting anyone else.\n\nBut just as quickly as the thought came, it fled, replaced by a sudden pang of loneliness. I missed him, damn it. Missed his laughter echoing through our empty nest, missed his voice calling out from the other room, asking me what I thought about this or that case he was working on. And now here I was, talking to myself like some crazy old lady.\n\nI took another sip of wine, trying to chase away the melancholy that threatened to consume me. But it lingered nonetheless, clinging to me like a second skin as I finished cooking dinner and sat down to eat alone once more.",
        "Sex": "Female",
        "Age": 58,
        "Occupation": "Nurse",
        "Relationship Status": "Married",
        "Negative Emotion": "Melancholy",
        "Cognitive Distortion": "Jumping to Conclusions",
        "Generated Assessment": "In the hushed stillness of my kitchen, I found myself fixated on the vacant chair opposite me, its emptiness screaming like an unspoken reproach. Henry had barely been gone a week - some godforsaken medical conference in Vienna, he'd said - but you'd think it'd been years by how I was pining away here.\n\nI stirred our dinner stew, the silence broken only by the rhythmic clanking of metal on pottery. Each bubble that rose to the surface seemed like Henry's voice, gone before it could fully form. \"He's probably having a grand old time,\" I muttered, imagining him laughing over beers with some colleagues, his arm draped casually around a young, vivacious woman.\n\nMy grip tightened around the spoon. Not for the first time today, I caught myself wondering if he'd met someone new. Someone who understood him better than I ever could. I mean, why else would he leave me here to rot in our big, empty house?\n\nI slammed down the spoon harder than intended, stew splattering onto the counter like tears staining my cheeks. \"Damn it, Henry,\" I whispered, wiping away a renegade tear with the back of my hand. \"Why do you always have to go running off?\"\n\nAs if on cue, my gaze fell upon his old bottle of Bordeaux tucked away in the pantry. Dust coated its glass surface like a shroud. He'd been saving it for something special, he'd said. Something worth celebrating.\n\n\"Fuck it,\" I growled, snatching up the bottle and uncorking it with trembling hands. If tonight wasn't worth celebrating, then when was? Here I was, holding down the fort while he was off gods-know-where, doing gods-know-what with gods-know-who.\n\nThe first sip burned like betrayal, but I welcomed it, letting its warmth spread through me like a poison. It fortified me, gave me courage to face the truth: Henry wasn't coming back. Not tonight, not ever. He'd found someone else, somewhere else, and he was never going to leave them for this quiet little life we'd built together.\n\nI took another sip, then another, until the bottle was empty and my head was spinning. But even through the wine-induced haze, I couldn't escape the ache in my chest, the hollow emptiness that seemed to grow wider with each passing moment.\n\nAs I sat down to eat alone once more, I couldn't shake the feeling that Henry had already moved on. That he'd left me behind without a second thought. And as I stared at his empty chair, I knew one thing for certain: tonight, there would be no forgiveness in my heart, only bitterness and resentment.\n\nBecause that's what happens when you jump to conclusions based on nothing but your own fears and insecurities. You end up alone, surrounded by empty chairs and half-empty bottles of wine, drowning in regrets and what-ifs. And you don't even realize you're doing it until it's too late."
    },
    {
        "Triggering Event": "At 7 AM sharp, John pulled into his driveway, eager to start another day on the force. He'd been a police officer for thirty years, but today felt different. His wife, Martha, had insisted he wear that silly \"I heart cats\" mug she'd bought him as a joke last Christmas. She thought it would make him seem less intimidating when he stopped by the local coffee shop.\n\nHe grumbled, adjusting his mirror to catch a glimpse of the ridiculous mug sticking out of his bag. He hoped no one from the station would see him. But as he walked into the coffee shop, there was Joe, the youngest rookie on the force, barely old enough to drink the coffee John had just ordered. The kid's eyes widened when he saw the mug.\n\n\"Morning, Chief,\" Joe said, trying and failing to hide a smirk.\n\nJohn could feel his cheeks flush with embarrassment. He forced a gruff laugh, \"It's not mine, kid. My wife made me bring it.\" But Joe had already turned away, chuckling, leaving John standing there like an idiot with his cat mug. Frustrated, he dumped the coffee in the nearest trash can and walked out, muttering, \"Damn mug.\"",
        "Sex": "Male",
        "Age": 64,
        "Occupation": "Police Officer",
        "Relationship Status": "Married",
        "Negative Emotion": "Embarrassment",
        "Cognitive Distortion": "Personalization",
        "Generated Assessment": "**John's Thoughts**\n\n*Dammit, that kid Joe must think I'm some sort of joke now. Wearing this stupid mug around like some housewife on her way to a book club. Can't he see I've got thirty years under my belt? This isn't about being intimidating, it's about respect.*\n\n*The barista didn't even look at me, just handed over the coffee with barely a word. She must have seen the mug and thought, 'Here comes that old fool again.'*\n\n*I could hear everyone in the station laughing when I walked past. They're all thinking the same thing - 'Look at Chief John, playing dress-up with his wife's silly mug.'*\n\n*This is bullshit. It's not like I asked for this. Martha forced it on me. Why can't they see that? It's not my fault if they don't have anything better to laugh about.*\n\n*I'm throwing this damn mug away the second I get home. And Martha... well, she'll understand. She always does.*"
    },
    {
        "Triggering Event": "Alright, let's do this.\n\nSo there's this dude, right? 23, an artist. Divorced. Not that it's anyone's business but his own. He's been feeling... ignored lately. Like a painting left to gather dust in the corner.\n\nOne day, he wakes up late. Sun's already high, streaming through his studio window like it's laughing at him. He rolls out of bed, stretches, yawns. Checks his phone - nothing. Not even a \"Hey, how's life?\" from his ex. Not that he cares. Much.\n\nHe heads to the kitchen, makes coffee. Black, strong. Just like his mood. While waiting for the kettle to boil, he notices it - an unopened letter on the counter. His name scrawled across it in a handwriting that's not his own. He picks it up, turns it over. No return address.\n\n\"Who sends letters anymore?\" he mutters, tearing it open. It's from some gallery owner, inviting him to show his stuff at an upcoming exhibition. \"Stuff\" being his paintings, not him personally. Though wouldn't that be something?\n\nHe reads it again. And again. Then crumples it up and tosses it into the trash. \"Who needs 'em?\" he snarls, grabbing his coffee and heading back to bed.\n\nBut as he lies there, staring at the ceiling, he can't shake off this feeling. Like he's just been passed over for something big. Again. It's not like anyone cares about his art anyway. Least of all him.",
        "Sex": "Male",
        "Age": 23,
        "Occupation": "Artist",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Neglect",
        "Cognitive Distortion": "Labeling/Global Labeling",
        "Generated Assessment": "\"Here we go again,\" he sighs, flopping back onto his pillows. \"Just another 'reject' trying to make something out of nothing.\" He glares at the letter balled up in the trash, like it's personally offended him. \"Who am I kidding? I'm just a has-been nobody cares about.\""
    },
    {
        "Triggering Event": "\"Just finished my shift at the precinct when I spot him, that punk kid who's been dealing in our neighborhood. He's laughing with his crew, like he owns the damn street. I've had enough of their crap. I march over, ready to throw the book at 'em.\n\n'Hey, Officer Friendly,' he sneers, 'what can we do for you today?'\n\nI'm seeing red now, but I keep my voice steady. 'You know what you're doing is wrong, kid. This isn't a game.'\n\nHe smirks, leans in close. 'Oh yeah? And who's gonna stop me?' He glances at my ring finger, bare since the funeral. 'Certainly not your wife.'\n\nThat does it. I grab him by the collar, all professionalism gone. 'You little shit,' I growl, hauling him towards the station. His crew hoots and hollers, but I don't give a damn. Tonight, someone's finally gonna pay for disrespecting my badge...and my wife.\"",
        "Sex": "Male",
        "Age": 46,
        "Occupation": "Police Officer",
        "Relationship Status": "Widowed",
        "Negative Emotion": "Rage",
        "Cognitive Distortion": "Mind Reading",
        "Generated Assessment": "\"You know what gets me, really gets me? The little punk's got that smirky grin plastered on his face like he knows something I don't. Like he can see right through me, into my goddamn head. 'What can we do for you today?' he says, all mocking. Hell, maybe he does know something. Maybe he's been laughing about my divorce with his little crew, thinking they've got one over on the old cop. But let me tell ya, buddy, you don't know shit. You sure as hell ain't in my head.\""
    },
    {
        "Triggering Event": "In his cluttered, grease-stained kitchen, Chef Jacques found himself up to his eyeballs in orders for a Friday night that felt more like a goddamn Sunday brunch. He'd been running this fucking show solo for weeks now, his sous chef having vanished like a phantom at the mention of overtime.\n\n\"Table seven's starters are shriveling up faster than my ex-wife's career!\" he barked at no one in particular, slapping together a plate of moules marinieres that looked like they'd been dragged through a fucking hurricane. He felt like a goddamn short-order cook, not a Michelin-starred chef.\n\nAs the orders piled up and his line cooks scrambled like headless chickens, Jacques noticed something that made him see red. A lone customer at the bar, some hipster with a fucking man-bun and more tattoos than taste, was ordering nothing but cocktails. He hadn't touched a single dish all night.\n\nJacques stormed over to the bar, his blood boiling like a damn witch's cauldron. \"You gonna order something that doesn't come in a glass tonight, or just sit there watching me work myself into an early fucking grave?\"\n\nThe hipster looked up, unfazed by Jacques' outburst. \"Just waiting for my date,\" he said with a smirk. \"She's running late.\"\n\nJacques felt his heart drop like a goddamn anchor. Here he was, slaving away in this shithole, and some pretty boy couldn't even be bothered to order an appetizer while he waited? He felt a surge of anger, but it was quickly drowned out by the cold, familiar feeling of neglect.\n\n\"Fuck this,\" Jacques muttered, storming back into the kitchen. He grabbed his coat and stormed out, leaving the kitchen in chaos behind him. He'd show them all. They could run that fucking kitchen without him for once. See how they liked being neglected.",
        "Sex": "Male",
        "Age": 54,
        "Occupation": "Chef",
        "Relationship Status": "Single",
        "Negative Emotion": "Neglect",
        "Cognitive Distortion": "What if?",
        "Generated Assessment": "Jacques slammed his car door shut, the echoes of the kitchen chaos still ringing in his ears. He gripped the steering wheel, knuckles white as he stared at the neon sign of the bar across the street.\n\n\"What if she doesn't show up?\" he muttered, imagining the hipster sitting alone all night, laughing at Jacques' fucking expense. \"What if he tells everyone I walked out? Fuck, what if they believe him?\"\n\nHe ran a hand through his grease-stained hair, leaving it sticking up in pissed-off spikes. \"Fuck 'em,\" he growled, starting the engine with a roar. \"I could open my own place. Somewhere they'd fucking appreciate me.\"\n\nBut then another thought struck him, cold and sobering. \"What if I can't? What if I'm just... done?\"\n\nHe pulled out into the street, his mind racing with 'what if's like rats in a maze. He didn't notice the ironic smirk on his face, mirroring the hipster from earlier.\n\n\"Fuck,\" he muttered, turning up the radio to drown out his thoughts. \"I should've stuck around. What if that was my last chance?\""
    },
    {
        "Triggering Event": "On her way home from the lab, she noticed it again - the empty seat on the bus. It had been three years since he'd passed, but every evening, that seat remained vacant, mocking her choices. She'd taken up his old hobby of birdwatching after his death, hoping to fill some of the emptiness inside her. Yet today, as she watched a pair of finches dance in the air outside her window, she couldn't help but feel a pang of regret. If only she'd spent more time with him instead of burying herself in work. She sighed, adjusting her glasses and turning back to the stack of research papers on her lap. The bus rolled on into the night, carrying its silent passenger towards another empty home.",
        "Sex": "Female",
        "Age": 54,
        "Occupation": "Scientist",
        "Relationship Status": "Widowed",
        "Negative Emotion": "Regret",
        "Cognitive Distortion": "Discounting the Positive",
        "Generated Assessment": "\"Despite the spectacle of nature unfolding before me, I found myself unable to appreciate its beauty today. Oh, how trivial it seemed compared to what's lost, a mere distraction from the void that echoes within my heart. Each chirp, each flutter was a whisper of his absence, not a melody worth celebrating. I mustered a weak smile at the sight, but it felt hollow, an insincere attempt to acknowledge joy when all I knew was this profound emptiness.\""
    }
]