[
    {
        "Triggering Event": "\"Well, isn't that just fucking perfect,\" she muttered to herself, staring at the shattered glass strewn across the store floor. It was closing time, and she'd been in such a goddamn rush to lock up, she'd dropped her favorite mug - the one with 'World's Best Manager' scrawled on it, given to her by the kids last Christmas. She could practically hear their laughter echoing through the empty store, mocking her carelessness.\n\nShe sighed, grabbing the broom and dustpan, \"Fuck me gently with a chainsaw,\" she whispered, feeling an ache that had nothing to do with her back. It was guilt, gnawing at her like a rat. She'd snapped at little Timmy earlier for forgetting to restock the candy aisle, and now all she could think about were his wide, teary eyes.\n\n\"Shit, shit, shit,\" she cursed under her breath, sweeping the broken pieces into a pile. \"I'm sorry, kiddo,\" she whispered to the empty store, feeling like the world's worst manager. She knew she'd make it up to him tomorrow, with extra hugs and maybe even some of those damn chocolates he loved so much.\n\nBut tonight, all she could do was clean up her mess, alone in the silence, with nothing but her thoughts and the dull ache of remorse keeping her company. \"Damn it,\" she muttered, sweeping the last bit of glass into the dustpan, \"I really am getting too old for this shit.\"",
        "Sex": "Female",
        "Age": 49,
        "Occupation": "Retail Worker",
        "Relationship Status": "Single",
        "Negative Emotion": "Remorse",
        "Cognitive Distortion": "Fortune Telling",
        "Generated Assessment": "\"I can just see it now,\" she grumbled, sweeping the broken glass into the dustpan with more force than necessary, \"Tomorrow's going to be an absolute disaster. The kids will find out about the mug, they'll think I'm a complete klutz. They'll probably quit on me, one by one, until I'm left here alone, managing this godforsaken store by myself.\" She sighed heavily, her shoulders slumping under the imagined weight of tomorrow's catastrophe. \"I won't be able to stand it if they leave. It'll be just too much to bear,\" she muttered, before shaking her head and continuing her task in silence, lost in her grim predictions."
    },
    {
        "Triggering Event": "\"Fuck me sideways,\" she muttered, scraping burnt remnants from the pan. Another goddamn ruined soufflé. She'd been at it for hours, trying to perfect the recipe her late husband loved. \"Why bother?\" echoed in her mind, but she ignored it, slamming another egg onto the counter. The yolk burst, staining everything yellow - much like the memories of happier times that now only served to piss her off. She felt a pang in her chest, a dull ache that never quite went away. Another fucking day in paradise.",
        "Sex": "Female",
        "Age": 40,
        "Occupation": "Chef",
        "Relationship Status": "Widowed",
        "Negative Emotion": "Unhappiness",
        "Cognitive Distortion": "Mental Filter",
        "Generated Assessment": "**Writing Prompt:** \"So, what's for dinner tonight?\"\n\n**Text:**\n\n\"Oh, you know, just another fucking masterpiece,\" she deadpanned, scraping the charred remains of her latest soufflé attempt into the bin. Hours spent, and for what? Another goddamn failure. She couldn't remember the last time she'd gotten it right. \"Fuck me sideways,\" she muttered, ignoring the pang in her chest that had become as familiar as her own reflection.\n\nShe grabbed another egg, cracking it with unnecessary force onto the counter. Yellow yolk oozed out, spreading like a fucking contagion. She could almost hear his voice, \"Darling, you're trying too hard.\" But he wasn't here, was he? Just another ghost in this godforsaken kitchen.\n\nShe didn't notice the other dishes lined up, ready to go - the salad she'd tossed with care, the potatoes bubbling away perfectly, the wine breathing quietly on the counter. All she saw was that fucking egg yolk, staining everything yellow, just like her goddamn memories. Another fucking day in paradise."
    },
    {
        "Triggering Event": "In the chill dawn of her 76th year, Edith stood over the stove, her once-nimble fingers now stiff and knotted like the roots of ancient trees. The kitchen, once her domain, now felt alien; a sterile laboratory devoid of warmth or laughter.\n\nToday was to be her magnum opus, a final hurrah before she hung up her apron for good. She had planned a grand feast for two - herself and her estranged daughter, Amelia, whom she hadn't seen in years. The menu was a symphony of Edith's finest dishes: Coq au Vin, Tarte Tatin, and Soufflé au Chocolat.\n\nAs the hours ticked by, each dish emerged from the oven with perfection, yet Edith felt no joy, only an oppressive emptiness that gnawed at her insides. She arranged the food on the table, set two places, but as she reached for Amelia's cutlery, a sharp pain shot through her heart.\n\nShe stood there, breathless, clutching her chest, as reality struck like a physical blow: Amelia wouldn't come. She hadn't responded to Edith's invitation, hadn't acknowledged her desperate attempts at reconciliation. The silence was deafening, echoing the void in Edith's life since the divorce and Amelia's subsequent disappearance from it.\n\nEdith collapsed into a chair, her body wracked with sobs. The food grew cold, untouched. Her misery was tangible, a dark cloud that threatened to consume her. She had cooked out of love, hope, desperation - but all she tasted now was bitter failure.",
        "Sex": "Female",
        "Age": 76,
        "Occupation": "Chef",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Misery",
        "Cognitive Distortion": "Personalization",
        "Generated Assessment": "Edith slammed down Amelia's untouched cutlery, \"Seriously, what's her problem? It's not like I've been trying to make amends for years or something.\" She rolled her eyes, crossing her arms like a petulant teenager. \"I mean, who even does that? Who ignores their own mother?\" She huffed, pacing around the kitchen. \"Guess it's just me and the leftovers again. Typical Amelia, always making it about her.\" She paused, then muttered to herself, \"Maybe I should've made her favorite dish too... not like she'd appreciate it anyway.\""
    },
    {
        "Triggering Event": "At 7 PM on the dot, Sarah unlocked her front door, expecting to find her best friend, Lisa, already there with their takeout order in hand. But the house was silent, except for the ticking of the clock she'd bought at a garage sale last year - the one that was supposed to be \"vintage,\" but felt more like a reminder of time wasted.\n\nShe dropped her bag by the door, kicking off her worn sneakers with a sigh. No text from Lisa, no voicemail blinking on her ancient answering machine. She checked her phone anyway, scrolling through the same group chat they'd been using since college: nothing new from Lisa since their plans were made three days ago.\n\nSarah's stomach rumbled, but she didn't feel hungry anymore. Instead, she felt that familiar emptiness, like a pit had opened up inside her when Lisa hadn't shown up for their weekly movie night - the one constant in Sarah's life besides work deadlines and code reviews.\n\nShe flopped onto the couch, her eyes scanning the room filled with memories of their friendship: the popcorn maker they'd used too many times to count, the throw blanket they'd shared at countless sleepovers, the framed photo of them from last year's Pride parade. Everything seemed dull now, lifeless without Lisa's laughter echoing through it.\n\nSarah pulled out her phone again, typing out a message before pausing. \"Hey... everything okay?\" She deleted it, then typed another: \"Where are you? I'm getting worried.\" Again, she hesitated. It wasn't like Lisa to stand someone up, especially not Sarah.\n\nShe tossed her phone aside and leaned back into the cushions, staring at the blank screen of her television. No movie tonight, no escape from the creeping disappointment that threatened to consume her whole body. Instead, she was left with just another quiet night alone, wondering why even her closest friend seemed to be slipping away.\n\nMaybe tomorrow would be better, she thought. But for now, all Sarah could do was stare at the clock ticking away their plans, one second at a time.",
        "Sex": "Female",
        "Age": 44,
        "Occupation": "Software Engineer",
        "Relationship Status": "Single",
        "Negative Emotion": "Disappointment",
        "Cognitive Distortion": "Overgeneralization",
        "Generated Assessment": "Sarah slammed her front door behind her, startling the clock into a brief flurry of ticks before it settled back into its usual rhythm. Always punctual, that was Sarah. Never late, never early - just on time. So where the hell was Lisa?\n\nShe threw her bag onto the floor, kicking off her sneakers with more force than necessary. No message from Lisa, not even a damn \"running late\" text. Typical. This was what happened when you let people into your life, they took it for granted.\n\nSarah's stomach growled, but she wasn't hungry anymore. Not for food anyway. She felt that emptiness inside her, the one that always showed up when Lisa flaked out on their plans. Again. It was becoming a pattern, wasn't it? Whole weeks went by without Sarah seeing her best friend, entire months passing like they were nothing more than strangers.\n\nShe grabbed her phone, typing out a message before deleting it in annoyance. This wasn't the first time Lisa had left her hanging, and it certainly wouldn't be the last. She tossed the phone aside, flopping onto the couch with a sigh that echoed through the silent room.\n\nThe house felt empty without Lisa's laughter filling it up. Always had been, always would be. Even when they were kids, Sarah was the quiet one, while Lisa... well, Lisa was the life of the party. But now it seemed like even that wasn't enough to keep her from disappearing on Sarah whenever she felt like it.\n\nMaybe tomorrow would be different, but why should Sarah believe that? It never was before. Each day was just another reminder of how alone she really was, despite having a \"best friend.\" She hugged a pillow to her chest, staring at the blank screen of her television. No movie tonight, no escape from the reality that even Lisa couldn't be bothered to show up for."
    },
    {
        "Triggering Event": "\"Just got off a call with that know-it-all from marketing, Sarah. She's always so damn perfect, with her designer glasses and her annoyingly perky voice. Today, she told me my code was 'outdated.' Me, who's been writing clean, efficient code since before she even knew what an algorithm was.\n\n'Well, Sarah,' I snapped back, 'maybe if you spent less time picking out your lipstick shades and more time learning how things actually work around here, you'd understand why we're using this damn system.'\n\nBut did she take it like a grown-up? Hell no. She ran off to tattle on me to my boss. Again. I can feel the insecurities creeping up - am I really that outdated? Is everyone just waiting for me to retire so they can bring in some fresh, young blood who actually knows what they're doing?\n\nFuck them all. I'm not going down without a fight.\"",
        "Sex": "Female",
        "Age": 55,
        "Occupation": "Software Engineer",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Insecurity",
        "Cognitive Distortion": "Mind Reading",
        "Generated Assessment": "\"Seriously? Sarah's probably sitting there right now, thinking 'Wow, this guy's such an asshole.' But did she ever stop to think about how her perfect little comments make me feel? Nope! She's too busy polishing that damn badge of hers.\n\nAnd my boss? He's probably nodding along with her, thinking 'Yeah, we should really get rid of this old dinosaur.' I can just see it now - him picking up the phone, calling some hotshot fresh out of college to come in and 'improve' our systems. Fuck that noise.\n\nBut you know what? They can all think whatever they want. I'm not going down without a fight. They'll be eating their words when they realize just how much shit they'd be in without me around here.\""
    },
    {
        "Triggering Event": "In the chill of the pre-dawn, Henry, 64, chef par excellence, stirred in his rumpled bed. Beside him, Margaret slept on, untroubled by the weight of another day's dawn. His gaze fell on their wedding photo, yellowed with age, and a familiar melancholy welled up.\n\nHe padded to the kitchen, where echoes of last night's dinner party still lingered. A forgotten spoon lay by the sink, caked with the remnants of his signature crème brûlée. He picked it up, turned it in his hands, remembering Margaret's laughter, her eyes shining like stars under the soft glow of the chandelier.\n\nSuddenly, he noticed a smudge on the counter, a slight imperfection amidst the usual gleaming cleanliness. It was tiny, barely noticeable, but to Henry, it was a blemish, an omen of decay. His melancholy deepened, became almost tangible, like the humidity before a storm.\n\nHe scrubbed at the smudge, his usually deft hands now clumsy with emotion. The clock ticked on, each second echoing in the silent house. As the sun began to rise, painting the sky with hues of orange and pink, Henry stood there, alone with his thoughts and the ghost of a thousand shared meals.\n\nThe melancholy was intense, raw, as if it had been marinating all these years, waiting for this quiet moment to burst forth. It was not the first time he felt like this, but today, it felt heavier, more insistent, demanding his attention.\n\nHenry took a deep breath, squared his shoulders, and pushed the melancholy down, burying it beneath the familiar rhythm of breakfast preparations. But even as he began to chop onions with practiced precision, the melancholy lingered, a bitter taste on the back of his tongue, reminding him that today was just another day older, another day further from their youth.",
        "Sex": "Male",
        "Age": 64,
        "Occupation": "Chef",
        "Relationship Status": "In a Relationship",
        "Negative Emotion": "Melancholy",
        "Cognitive Distortion": "Overgeneralization",
        "Generated Assessment": "**Writing Prompt:**\nHenry's melancholy has become a regular companion, but today it feels different. Write about Henry's reaction when he notices a tiny smudge on the counter, reflecting his tendency to overgeneralize.\n\n**Text:**\n\nAs Henry scrubbed at the minuscule smudge on the counter, his heart sank like a stone in water. *Christ*, he thought, *this place is falling apart*. He couldn't remember the last time everything had been spotless. It felt like forever since their kitchen had shone like it used to, when Margaret would dance around him as he cooked, her laughter echoing off the gleaming surfaces.\n\nHe attacked the smudge with renewed vigor, his arms aching from the relentless scrubbing. *Where are those goddamn kids?* he thought bitterly, *they're always leaving a mess behind*. Even when they weren't here, their presence lingered like a stain, reminding him of the chaos that had become their lives.\n\nHenry leaned back, surveying his work with a critical eye. The smudge was gone, but it felt like a hollow victory. *It's never enough*, he thought, *it'll just come back tomorrow*. He sighed heavily, feeling the weight of each passing day on his shoulders. *This is what our life has become*, he mused, *a endless cycle of cleaning up after everyone else*.\n\nHe turned to the stove, his hands already reaching for the pan, but his mind was elsewhere. *Always*, he thought, *always something*. He couldn't remember a time when everything had been peaceful, quiet, clean. It felt like those days were gone forever, lost in the fog of memory."
    },
    {
        "Triggering Event": "**Incident Report**\n\n**Date:** 15th March\n\n**Reporting Nurse:** Harold Johnson\n\n**Event Summary:**\n\nAt precisely 0730 hours, I began my morning rounds on the geriatric ward, a task I've performed with diligence and patience for decades. Today, however, that patience was tested in a manner most unbecoming of our esteemed institution.\n\nAs I approached Room 105, the sound of laughter echoed through the corridor. A young nurse, barely out of training, was leaning against the doorframe, giggling with an intern who should have been attending to his rounds, not engaging in idle chatter. The scene was a stark contrast to the somber atmosphere we strive to maintain for our elderly patients.\n\nI cleared my throat loudly, causing them both to start and fall silent. \"Good morning,\" I offered, expecting at least some semblance of professionalism in response. Instead, the intern merely nodded, muttered an apology, and scurried away, while the young nurse, Emily, actually had the audacity to smile at me.\n\n\"Everything alright, Harold?\" she asked, her tone far too familiar for my liking.\n\n\"No,\" I replied, my voice sharp as a surgical blade. \"It is not alright when you're more concerned with socializing than attending to your patients.\"\n\nHer smile faded, replaced by a look of surprise, then indignation. \"I was just taking a break—\"\n\n\"A break?\" I interrupted, my resentment boiling over. \"We don't have time for breaks here. Not when we have lives depending on our care, our expertise, and most importantly, our professionalism.\"\n\nShe opened her mouth to respond but seemed to think better of it, closing it again with a snap. Good, I thought, let that sink in.\n\n\"I expect better from you, Emily,\" I said, my voice like ice. \"I've seen your file. You're not some new graduate. You should know better.\"\n\nWith that, I walked away, leaving her standing there, no doubt seething at my rebuke. But so be it. Resentment or not, someone needs to remind these youngsters what it means to truly care for patients.\n\n**End of Report**\n\n*Note: Further disciplinary action will be taken if such behavior persists.*",
        "Sex": "Male",
        "Age": 70,
        "Occupation": "Nurse",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Resentment",
        "Cognitive Distortion": "Emotional Reasoning",
        "Generated Assessment": "**Writing Prompt:** Write a letter from Harold Johnson to a trusted colleague after the incident.\n\n---\n\nDear Martha,\n\nI hope this letter finds you well. I'm writing to vent about an incident that occurred on my morning rounds today. You won't believe it, but one of our nurses, Emily - yes, that one with the perpetual smile - was actually laughing and chatting away in the corridor like she was at some damn social gathering, not a hospital ward!\n\nI mean, can you believe it? Here we are, dealing with the frail and the aged, trying to maintain a semblance of peace and dignity, and there she is, cackling away like a teenage girl at a slumber party! It's a bloody geriatric ward, not a comedy club!\n\nAnd when I confronted her about it - yes, I did confront her, Martha. Someone had to - she had the audacity to ask me if everything was alright. As if I was the one acting out of line! I swear, sometimes these youngsters make me feel like I'm back in the Stone Age.\n\nYou know what really gets me? She's not even a rookie anymore. Her file says she's been with us for over two years now. You'd think by now she'd understand that professionalism isn't just a fancy word we stick on our badges; it's a damn lifestyle!\n\nI let her have it, Martha. I made sure she knew exactly what I thought of her behavior. And you know what? She had the nerve to look indignant, like she couldn't believe I'd dare speak to her that way. Well, tough luck, sweetheart. Someone needed to burst that bubble of hers.\n\nI'm just so disappointed, Martha. I expected more from her. But then again, maybe I shouldn't be surprised. It's not like the younger generation understands what it means to truly care for patients anymore. They're too busy worrying about their damn feelings and social media likes.\n\nAnyway, rant over. Just thought you should know that our little Emily had me seeing red today. God forbid we maintain some semblance of professionalism around here!\n\nTake care, old friend,\n\nHarold"
    },
    {
        "Triggering Event": "Alright, listen up. It's been three years since she went, you know? Three fuckin' years and I still can't walk past that goddamn house without my gut twistin'. Today, though, today was somethin' else.\n\nI'm drivin' home from another shitty shift, tired as hell, when I see it - that prick from down the street, Mark, he's out there, laughin', wipin' his fuckin' forehead with a towel. He just finished runnin'. Just... fuckin' runnin'.\n\nI pull over, get out, slam the door. \"Hey, Mark!\" I call out. He turns, smiles. Fuckin' smile! Like he ain't got a care in the world.\n\n\"What's up, Mike?\" he says, all casual-like.\n\n\"You know what's up, Mark,\" I snap. \"You're out here, enjoyin' life, runnin', sweatin'. You ever think about her? About Laura?\"\n\nHis face drops. Good. He should feel bad. But then, he shakes his head, starts talkin'.\n\n\"Mike, you can't keep livin' like this,\" he says. \"Laura wouldn't want you... you know.\"\n\nI see red. I lunge at him, but I'm too tired, too old. He steps back, shocked. \"What the hell, Mike?\" he yells.\n\n\"What the hell?!\" I roar back. \"You get to run, live, laugh! She never got that chance! None of us did!\"\n\nHe stares at me, pity in his eyes. Pity! I can't take it. I storm off, get in my car, and peel out, leaving him standin' there.\n\nI drive around for hours, cursin', shoutin' at no one, punchin' the dash 'til my knuckles bleed. Why him? Why not me? Why her?\n\nFuck this world. Fuck life. Fuck... fuck... envy's a bitch. It eats you alive.",
        "Sex": "Male",
        "Age": 43,
        "Occupation": "Police Officer",
        "Relationship Status": "Widowed",
        "Negative Emotion": "Envy",
        "Cognitive Distortion": "What if?",
        "Generated Assessment": "**Writing Prompt:** \"I find myself constantly questioning what might have happened if I had acted differently that day.\"\n\n**Text:**\n\nAs I sit here, the echoes of today's confrontation still ringing in my ears, I can't help but drift back to that fateful afternoon three years ago. The sun was setting, casting an orange glow over our quiet suburban street, when Laura's laughter suddenly stopped mid-conversation, her face contorting with pain.\n\nI should have rushed her to the hospital immediately. What if the delay caused by my hesitation proved fatal? What if I had insisted she go earlier, and they could have caught it in time? The doctors said it was aggressive, but maybe, just maybe, if we'd been there sooner...\n\nAnd now, seeing Mark out running today, his lungs burning with life while Laura's lie still, lifeless in that cold ground... what if I had been more supportive when she first mentioned she felt unwell? What if I had encouraged her to take better care of herself?\n\nI can't shake these thoughts. They gnaw at me, a relentless parade of 'what ifs' and 'maybes'. Each one a tiny, poisonous snake coiling around my heart, squeezing the life out of it.\n\nYet, when others suggest I seek help, I bristle. \"I'm fine,\" I snap. \"I just need time.\" Time to what? To drown in this sea of uncertainty and guilt?\n\nBut how can I stop these questions from bubbling up inside me? They're like a relentless tide, pulling me back towards that dark place where Laura's laughter still echoes, now mingled with my own desperate cries for 'what if'."
    },
    {
        "Triggering Event": "Dr. Henry Thompson, 49, stood in the dimly lit emergency room, watching as his team struggled to revive a young woman who'd been brought in after a devastating car crash. The machines blared their discordant alarms, each one a mocking reminder of his helplessness.\n\n\"Come on, dammit,\" he muttered under his breath, his fingers drumming an impatient rhythm on the countertop. He'd seen this scene play out too many times; the grim determination in his team's eyes, the futile efforts to keep hope alive when it was clear that fate had already made its decision.\n\nThe clock on the wall seemed to mock him, its hands creeping forward at a snail's pace as if daring him to intervene. But he knew better than to rush. This wasn't about him; it never was. He was just a spectator, a bystander in this macabre dance of life and death.\n\nAs the team finally called time of death, Henry couldn't help but feel a twinge of envy for the deceased. At least she got to leave the party when things started going south. For him, however, the show must go on. He took a deep breath, squared his shoulders, and prepared himself for the next act in this never-ending tragedy. After all, someone had to clean up the mess left behind by others' carelessness. And today, that someone was Dr. Henry Thompson.",
        "Sex": "Male",
        "Age": 49,
        "Occupation": "Doctor",
        "Relationship Status": "Single",
        "Negative Emotion": "Helplessness",
        "Cognitive Distortion": "Blaming",
        "Generated Assessment": "Dr. Thompson stood there, watching the chaos unfold around him. His team was doing everything they could, but it wasn't enough. It never was. He felt a familiar tightening in his chest, that same old frustration boiling up inside him.\n\n\"Come on, people,\" he muttered, more to himself than anyone else. \"Why does everyone have to make things so hard? Why can't they just follow the rules?\" His fingers tapped impatiently against the clipboard tucked under his arm, keeping time with the beeps of the machines that seemed to laugh at their futility.\n\nHe knew it wasn't fair, blaming them like this. They were doing their best, trying to save a life that was already slipping away. But he couldn't help it. Somewhere along the line, it had become easier to point fingers than to accept the harsh reality staring him in the face.\n\nAs they called time of death, Henry felt a pang of guilt. Not for the young woman they'd lost tonight - she was beyond pain now. No, his guilt was reserved for the team he'd just silently condemned. They deserved better than his bitter resentment, especially after all they'd been through together.\n\nBut old habits die hard. And blaming others had become Henry's coping mechanism, a way to make sense of the senseless. It wasn't right, but then again, nothing about this job was ever fair."
    },
    {
        "Triggering Event": "In the grimy confines of the precinct locker room, Officer Thomas unbuckled his duty belt with trembling hands. The echo of laughter from his fellow officers still rang in his ears, a mocking chorus that seemed to reverberate off the cold tile walls. He had underestimated the suspect's reach, let his guard down for just a moment - and now, he was the laughing stock.\n\nHis eyes fell upon his reflection in the locker door mirror, seeing not the hardened cop he'd become, but the scrawny kid who'd once been bullied in school. The humiliation burned like acid in his throat, threatening to overwhelm him. This wasn't just about the laughter, or the mistake - it was about her. Sarah. She'd looked at him with such pride when he'd pinned on that badge, but now... what would she see?\n\nThomas slammed the locker door, the sound echoing like a gunshot in the sudden silence. The laughter died instantly, replaced by an uneasy tension. He could feel their stares, could practically hear their thoughts - \"What's wrong with him?\" \"He can't handle the pressure.\"\n\nBut they were wrong. He could handle it. He had to. For Sarah. For himself. Thomas took a deep breath, steeling himself for the long night ahead. He wouldn't let this humiliation define him. He'd show them all - he was still a cop worth fearing.",
        "Sex": "Male",
        "Age": 23,
        "Occupation": "Police Officer",
        "Relationship Status": "In a Relationship",
        "Negative Emotion": "Humiliation",
        "Cognitive Distortion": "Personalization",
        "Generated Assessment": "**Writing Prompt:**\n Officer Thomas, freshly humiliated by his colleagues' laughter after a rookie mistake, reflects on the incident while getting ready for another shift.\n\n**Text:**\n\n*Thomas glances at his reflection again, scowl deepening. He can't shake off the echo of their laughs, each one stabbing him like a personal attack.*\n\n*\"What's got their panties in a twist?\" he mutters, pulling on his uniform. \"Like they've never fucked up before.\"*\n\n*He imagines Sarah seeing the headlines tomorrow - 'Local Cop Botches Bust' - and feels a surge of anger. It's not just about him anymore; it's about protecting her pride too.*\n\n*\"They're all waiting for me to crack, ain't they?\" He smirks at his reflection, adjusting his collar. \"Well, fuck 'em. I won't give them the satisfaction.\"*\n\n*Thomas grabs his hat, slamming the locker door harder than necessary. The precinct falls silent briefly before resuming its usual hum.*\n\n*\"Assholes,\" he mumbles under his breath, striding out. It's all about him tonight - their stares, their whispers, their laughter. And he'll prove them all wrong.*"
    }
]