[
    {
        "Triggering Event": "While tidying up her apartment alone after another long shift, she noticed a dust-free patch on the wall where his picture used to hang.",
        "Sex": "Female",
        "Age": 38,
        "Occupation": "Nurse",
        "Relationship Status": "Single",
        "Negative Emotion": "Insecurity",
        "Cognitive Distortion": "Blaming",
        "Generated Assessment": "**I'm so sick of him!** He's probably out there having fun with some other girl right now while I'm stuck here cleaning up this mess. **What a jerk!** He left me like that - no goodbye, no explanation. Just a note saying he doesn't want to be around anymore. **And you know what? It's just another example of how selfish he is.** Why would anyone leave someone else when they could have stayed and worked things out? **Doesn't he realize that we were meant to be together?** We had our ups and downs, but we loved each other deeply. And now, he's just gone. It hurts so much seeing all these memories in this empty space. Our special moments together are nothing but reminders of what I'll never have again. **How can he just abandon me like this? Doesn't he care about how I feel?** I feel so betrayed. He didn't even give me the chance to say goodbye or ask questions. **He's probably enjoying every moment of freedom, laughing with new friends, and living life without worrying about me.** But I don't get to enjoy any of that. Instead, I'm stuck dealing with the pain of losing him. This apartment was once filled with love and laughter, but now it feels like a reminder of everything that went wrong. I wish he'd at least leave a note explaining why he broke up with me. But instead, he just disappeared. **I"
    },
    {
        "Triggering Event": "A former student, now a middle-aged man, approaches him in the supermarket, smiles widely, and says, \"You haven't changed a bit since you made me rewrite that essay three times.\"",
        "Sex": "Male",
        "Age": 65,
        "Occupation": "Teacher",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Embarrassment",
        "Cognitive Distortion": "Mind Reading",
        "Generated Assessment": "\"Oh, for fuck's sake. You think I've been sitting here thinking about how much I hate this fucking store? That I've spent all day waiting to run into you so we could reminisce about old times? What is it with you? Do you really think I'm sitting here thinking about you? Or worse, thinking about how much I dislike you?\" \"Seriously, did you just walk up to me out of nowhere and expect me to be like, 'Oh, hi! It's great to see you!'? Did you actually think I was going to respond like that? You're fucking kidding me, right?\" \"I mean, come on. You have no idea what I've been doing today. And yet, you still manage to turn everything into some kind of personal attack. 'You haven't changed a bit'—are you serious? Are you fucking kidding me? How can you even think that? Have you seen me lately? I've been dealing with family issues and trying to get back on track. So, no, I haven't exactly had time to sit around thinking about our past conversations.\" \"And another thing—why are you still bringing this up after all these years? You don't know anything about my life anymore than I know about yours. Why are you still so obsessed with this? Can't you just let it go already?\""
    },
    {
        "Triggering Event": "She found an old photograph tucked behind her desk drawer, faded and worn around the edges. It was them, smiling at some conference years ago, before the silences, before the final goodbye. A sudden lump formed in her throat as grief washed over her like a familiar tide.",
        "Sex": "Female",
        "Age": 49,
        "Occupation": "Scientist",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Grief",
        "Cognitive Distortion": "Jumping to Conclusions",
        "Generated Assessment": "She's been crying for hours, but it's probably just because she has too much work to do. I mean, what else could possibly make her so sad? She must have forgotten something important. Maybe she thinks she's going to be fired next week. Or maybe she wants to end things with him after all. It doesn't matter why she's crying; there's always another reason that makes sense. This isn't about how she feels; it's about all the other possible explanations. The truth is, she just needs to stop being dramatic and get back to work already."
    },
    {
        "Triggering Event": "A female chef, 32, was mid-service when her partner, unseen in the bustling kitchen, snapped at an sous-chef for a minor mistake. She rolled her eyes, muttering under her breath, \"Like you're one to talk, you've made plenty of mistakes yourself.\"",
        "Sex": "Female",
        "Age": 32,
        "Occupation": "Chef",
        "Relationship Status": "In a Relationship",
        "Negative Emotion": "Contempt",
        "Cognitive Distortion": "Magnification/Minimization",
        "Generated Assessment": "Oh my god, she's such a bitch! I mean, I get it, but what is that even supposed to be? Like, are they just going to forget about all the times he messed up? Are they not remembering how many times he's fucked up in front of everyone? He's always been so fucking careless, and now this woman is acting like she's better than him? What does she know? And yeah, okay, maybe she has made some mistakes too... But that doesn't make her less of a terrible person. And if she's so perfect, why does she need to snap at him? That's so immature. It's so weird because she's always been super strict, and I'm pretty sure she didn't say anything to him before this... But then again, maybe she did. Maybe she's just really upset with him right now and can't control herself. Who knows? The point is, though, she shouldn't have said that shit. It's so petty. What's worse is that she's trying to make him look bad in front of everyone. I bet she's doing it to make herself feel better. Like, she must think she's above him, huh? If she were me, I'd probably just ignore her. Or maybe I'd tell her off, but that would be way more mature than snapping at someone. But noooo, instead, she's just being a bitch, which makes me want to quit my"
    },
    {
        "Triggering Event": "He noticed the graffiti as he walked his beat, the same familiar slur carved into the wall: \"Cop killer.\" His heart pounded with a hatred that burned like acid in his veins. It was the same phrase etched into his ex-wife's voicemail when she'd left him for a civilian. Now it mocked him here, on the cold brick of his city.",
        "Sex": "Male",
        "Age": 25,
        "Occupation": "Police Officer",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Hatred",
        "Cognitive Distortion": "Overgeneralization",
        "Generated Assessment": "**Fucking Hell!** It happens every fucking time I see that shit. That graffiti is the last thing I want to wake up to, but it’s always there. Every fucking day, some asshole carves that same disgusting word into this fucking wall. It’s never going away. They’re always out there, spreading hate like it means something. I’m sick of it, but I know it’s just the beginning. This isn’t over, no matter what they say. I’ve seen it before, in my own life. My ex used to leave me messages like that. She’d record herself saying things like, “You’ll never find someone who loves you more than me.” And then she’d be gone. The message would change, but the sentiment was the same—she hated me. We were supposed to be husband and wife, but I felt like an outsider looking in. Even now, I wonder if she was right. Was I just another target? Did I really deserve her love? This fucking graffiti is like a reminder from hell. It makes me feel like I’m trapped in a living nightmare, one where the lines between reality and fantasy are blurred. No matter how hard I try, I can’t shake the feeling that this is all part of some twisted game. I’ve been watching these fuckers for years, waiting for the perfect moment to strike back. But deep down, I know it won’t end well. There’s too much at stake. I have"
    },
    {
        "Triggering Event": "Scenario:\n\nShe arrives at work, her uniform already damp with sweat from the unseasonable heatwave. The fluorescent lights flicker overhead, casting harsh shadows on the empty aisles she's meant to restock. She pauses by the clearance rack, her gaze lingering on a discounted wedding dress, its lace yellowed with age. A sudden wave of loneliness washes over her as she imagines it gathering dust in some forgotten storeroom, just like her own hopes for love. She sighs, pushing the thought aside, and continues her rounds, the ache in her bones echoing the emptiness inside her.",
        "Sex": "Female",
        "Age": 48,
        "Occupation": "Retail Worker",
        "Relationship Status": "Single",
        "Negative Emotion": "Unhappiness",
        "Cognitive Distortion": "Jumping to Conclusions",
        "Generated Assessment": "Ugh, I'm so tired today. She probably just got off the bus, but why is she wearing that ugly floral shirt again? It looks like something my aunt would wear to a family reunion. And those jeans are ripped, she must be trying to look sloppy. Why does she have to wear such ridiculous clothes anyway? I bet she's one of those people who always has to work weekends too. I can't imagine how much more annoying she'll be now that she's off the clock. And what's with all this new employee training stuff? This isn't a school, we're not here to babysit them. They need to figure things out themselves if they want to make it in this business. I swear, every time someone new comes in, it's like they think they can just waltz in here and start doing everything on their own. Why does she even get hired? Doesn't she know how hard this job is? We're not just selling clothes; we're dealing with stressed-out customers all day. You can't expect them to be happy when you put them up against an unrealistic deadline. I remember working retail back in college, and it was almost impossible to keep up with the demands. No wonder people burn out after just six months. I wonder if she's dating anyone. Maybe she's just going through a rough patch, but still... Those clothes don't match. Is she trying to send a message about being \"quirky\" or something"
    },
    {
        "Triggering Event": "The school's annual parent-teacher conference arrives, and John finds himself alone in his classroom, waiting for parents who never come. He overhears laughter from another teacher's room filled with parents discussing their child's progress, while his remains silent. His reflection in the empty classroom window shows a man trying to hide the doubt gnawing at him—was he not good enough as a teacher?",
        "Sex": "Male",
        "Age": 28,
        "Occupation": "Teacher",
        "Relationship Status": "Single",
        "Negative Emotion": "Insecurity",
        "Cognitive Distortion": "All or Nothing Thinking",
        "Generated Assessment": "It was supposed to be one of those days where everything went smoothly. I woke up early, made my kids breakfast, got them ready for school, and headed to work feeling optimistic. But when I arrived at school, I realized that my car had broken down. No big deal, I thought, there are always backup options. So, I called a friend who lives nearby and asked if she could give me a ride. She agreed, but then her dog suddenly fell ill, so we had to leave her behind. My initial excitement about the day turned into frustration as I drove back home, wondering how things would go from here. As I walked into the school, I saw my colleagues chatting with their families. They were all smiling and laughing together, sharing stories about their children’s achievements. Meanwhile, I sat alone in my office, staring blankly at the clock, thinking about how much I hated this job. It felt like every conversation with students ended in disappointment, and they just didn’t seem to care about learning anything new. I couldn’t help but feel that I was failing as a teacher, stuck in a dead-end position with no chance of advancement. I wondered why other teachers seemed to have it easier, effortlessly connecting with their students and making them excited about lessons. I tried calling out to my colleagues during breaks, hoping to find some solidarity, but they were too busy catching up with family members. Even the principal seemed more concerned with his own schedule than helping us teachers. When"
    },
    {
        "Triggering Event": "She slammed the car door, the echo resonating through the empty school parking lot. The report card she'd spent all night grading was crumpled in her fist. Another 'F' from little Johnny, despite her extra tutoring sessions. She could feel the heat rising in her cheeks, her pulse pounding in her ears. She wanted to scream, to throw something, anything to release this boiling rage inside her. But she just stood there, trembling, clutching the crumpled paper, and watched as the last of her students disappeared into their homes, leaving her alone with her anger.",
        "Sex": "Female",
        "Age": 21,
        "Occupation": "Teacher",
        "Relationship Status": "Single",
        "Negative Emotion": "Rage",
        "Cognitive Distortion": "Personalization",
        "Generated Assessment": "She's so angry, it's like she has a personal vendetta against these kids. I mean, what does it even matter if they get an F? It's not like it affects them in real life or anything. They're not going to end up locked in jail for failing math. It's just a stupid grade, but somehow it makes her so mad. She can't handle one kid getting an F after spending hours tutoring him. How hard is it to teach someone basic fractions anyway? She must be worried about her reputation or something. Maybe she thinks those grades will follow her home and affect her family. Or maybe she's just trying to prove some point to herself. Whatever the reason, she looks so upset, and I don't know how to make her feel better."
    },
    {
        "Triggering Event": "A woman in her 40s, working tirelessly at the checkout counter during Black Friday, felt her frustration grow as the queue barely moved despite her best efforts. Her colleague called in sick, leaving her to handle the surge alone.",
        "Sex": "Female",
        "Age": 41,
        "Occupation": "Retail Worker",
        "Relationship Status": "In a Relationship",
        "Negative Emotion": "Frustration",
        "Cognitive Distortion": "Discounting the Positive",
        "Generated Assessment": "The thing is, I just had a really great day with my family before this all happened. We went out for dinner, and everything was going so well—my husband was being super supportive, my kids were happy, and we even managed to squeeze in some quality time together. It wasn't perfect, but it was nice. And now, here I am, dealing with this ridiculous workload and feeling like I'm losing my mind. The fact that people are acting like this over a few discounted items doesn't make sense to me. I've been working non-stop, and I feel like I'm just trying to keep up with things around here. But still, I remember how good today was with my family—it feels like I left all that behind when I started working. Maybe I shouldn't have let myself get so caught up in work stress because now I’m starting to think that everything else in my life is about how much work I can handle instead of enjoying it. Or maybe I just need to accept that things will be stressful sometimes and focus on what matters? It's hard not to feel like work has taken over my life. Even though I know that life outside of work is important too, I find myself constantly worrying about how much work I'll have tomorrow. Sometimes it feels like I should just stop working altogether because I never seem to catch up, and yet, deep down, I know that stopping won't solve anything. Maybe if I took a break, I could clear my head"
    },
    {
        "Triggering Event": "\"She opened the envelope, her fingers trembling slightly with anticipation. A single sheet of paper, her retirement notice from the school board. She had expected a party, balloons perhaps, but not this quiet, impersonal formality. Her eyes scanned the lines, each word a tiny knife plunging into her heart. Thirty-five years, gone in an instant. No mention of her dedication, no recognition for the countless lives she'd touched. Just a date and a signature.\"",
        "Sex": "Female",
        "Age": 62,
        "Occupation": "Teacher",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Disappointment",
        "Cognitive Distortion": "Emotional Reasoning",
        "Generated Assessment": "This is so unfair. I feel like everyone around me just doesn't care about what's going on. They're all too busy to even notice, to be honest. It's like they think I'm some kind of robot who can just keep working and ignore everything else. That's so fucking stupid. The world sucks, and nobody gives a shit about it anymore. Everyone's too caught up in their own problems to worry about anyone else. If you don't have time for me, then why would you bother pretending to care? You're just like every other asshole out there. It's pathetic. And now, with my job gone, I'll just have to add another one to the pile. This whole fucking thing is just another reminder that nothing good ever happens anyway. People are selfish, and they don't deserve anything good in return."
    }
]