[
    {
        "Triggering Event": "At the station's front desk, she found an old, tattered photograph tucked into a stack of reports. It was them - her and her ex-husband, much younger, smiling in uniform side by side at his promotion ceremony. Her heart ached as grief welled up, catching her off guard. She quickly slipped the photo into her pocket before anyone noticed the tears welling in her eyes.",
        "Sex": "Female",
        "Age": 79,
        "Occupation": "Police Officer",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Grief",
        "Cognitive Distortion": "Overgeneralization",
        "Generated Assessment": "fuck this is so fucked up. I'm going to die alone. I am a loser. I will never find love again because I have no friends and no one wants me. I can't trust anyone anymore, not even my own family. They're all fake, lying, cheating bitches who don't care about me. My parents are dead, they didn't care about me when I needed them most. They abandoned me, just like everyone else. Why would I ever believe that people will actually care about me? I'll never find someone who truly loves me. I'm worthless, unworthy, and unlovable. Everyone hates me; I'm ugly, fat, and stupid. No one wants to be around me. I'm a burden. I'll never get a job because nobody would hire me anyway. I'm useless. What's the point of trying anymore? This world is cruel and unfair. Nobody cares about me or what I want. I'll spend the rest of my life alone, miserable, and forgotten. I'll never experience happiness or joy. Life is pointless, and I'm the proof that it doesn't work. There's nothing left for me here. I need to leave and start over somewhere else. This place is toxic. Everyone is out to hurt me, and I deserve to suffer. I'm cursed. I'm doomed. I'll never escape this hellhole. Nothing good happens to me. I'm cursed forever. ###"
    },
    {
        "Triggering Event": "She found his old watch, tarnished and forgotten in the bedside drawer. She hadn't opened it since the funeral, avoiding the reminder of his absence. Now, holding it, she remembered the regret that had been haunting her—the last argument they'd had about her constant work, his pleading eyes, her dismissive response. The watch slipped from her fingers, clattering onto the wooden floor as a silent sob escaped her lips.",
        "Sex": "Female",
        "Age": 47,
        "Occupation": "Journalist",
        "Relationship Status": "Widowed",
        "Negative Emotion": "Regret",
        "Cognitive Distortion": "Should Statements",
        "Generated Assessment": "She was supposed to have done better than that, but here we were again—she couldn’t help but feel like she’d failed him one more time. It wasn’t just the watch; it was everything else—her constant work, her dismissal of his needs, the arguments they’d had. All those memories flooded back, each one making her feel guilty for letting things fall apart. But why did it always seem to come down to this? Why did she keep slipping up? Wasn’t she supposed to be the strong one now? Didn’t she know how much he needed her? And yet, here we were, with nothing but tears and broken promises. What was wrong with me? Why couldn’t I hold it together? It seemed so simple: take care of him, support him, be there for him. That’s what she’d promised herself when he got sick, and that’s all she wanted to remember. Yet, every day felt like another step backward. He deserved so much better than what she’d given him. His death was a harsh reminder of all she’d let slip through her hands. Why couldn’t she have done things differently? Shouldn’t she have stayed by his side, supported him, been the rock he needed? Instead, she was left with the weight of regret, each passing day feeling like a betrayal. But what was the point? All these thoughts didn’t change anything. They only made her feel worse. Maybe it was because she knew she could"
    },
    {
        "Triggering Event": "After decades of working together, his colleague and closest friend at the office, Tom, announced he was retiring. He'd be leaving in two weeks. The office felt emptier already, even though Tom wasn't gone yet. He sat alone in his cubicle, staring at the half-finished project on his screen, unable to focus. The thought of losing his partner in crime, his confidant, made his chest ache with a profound sense of loss.",
        "Sex": "Male",
        "Age": 71,
        "Occupation": "Software Engineer",
        "Relationship Status": "Married",
        "Negative Emotion": "Misery",
        "Cognitive Distortion": "All or Nothing Thinking",
        "Generated Assessment": "It's like you're either completely done with me, or you're still all about us. Either I'm just another loser who can't cut it, or I'm the one person who gets what they want from life. That's how my mind works. There's no middle ground for me; everything is either black and white or bright and bold. If I think too much, I'll start to see gray areas, but I know that's just a trap. It doesn't matter if things are complicated - everything has to fit neatly into a box. You're either fully invested, or you're not worth my time. And honestly, I don't care which it is because my brain isn’t wired to handle anything in between. I’m either all in, or I’m out. And right now, I feel like I’m stuck in limbo, waiting for the next move. But the thing is, I know there’s no in-between. Life doesn’t work that way. It’s either here or there, success or failure, win or lose. Anything else? No. I won’t let myself believe otherwise. It’s easier this way. All or nothing, that’s how it goes. I’d rather have clear-cut answers than murky ones. Besides, I don’t want to overthink this. Overthinking makes people weak. We need clarity, not confusion. I’ve had enough of that. I’ll stick with the extremes, thank you very much. Now, where"
    },
    {
        "Triggering Event": "He stood alone in the precinct break room, the clock's hands slowly inching towards his end of shift. The smell of stale coffee hung heavy in the air. He felt a familiar pang of remorse as he glanced at the framed photo of him and his daughter on the counter, the one where she was blowing bubbles with her chewing gum. It had been months since their last visit, her laughter fading like footprints in the rain. He'd missed another weekend due to work, again. His ex-wife's words echoed in his mind, \"You're always gone, even when you're here.\" He looked down at his uniform, stained with more than just coffee, and felt a profound sense of guilt wash over him like an icy wave.",
        "Sex": "Male",
        "Age": 29,
        "Occupation": "Police Officer",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Remorse",
        "Cognitive Distortion": "Labeling/Global Labeling",
        "Generated Assessment": "\"Are you kidding me? You think I'm not busy? That we can have a conversation right now about this?\" She glared at him across the crowded café, her voice rising in frustration. \"This is ridiculous, especially after everything that's happened.\" He sighed inwardly, rubbing his tired eyes. \"Look, I know it feels like an inconvenience, but—\" \"No, it doesn't feel like an inconvenience,\" she interrupted, her voice growing louder. \"It feels like you're avoiding me. Again.\" He shifted uncomfortably in his seat, trying to find a comfortable position. \"That's not fair. We've talked about this.\" \"Oh, really?\" Her expression turned incredulous. \"When exactly did we talk about it?\" \"I don’t remember, so I guess we never did,\" he replied, feeling a bit defensive. She scoffed. “Well, now you’re saying we’ve never discussed it?” “Actually, I’m saying we haven’t had a discussion about it,” he corrected, trying to clarify. Her laugh was bitter. “So now you’re telling me you’ve forgotten our conversations? About how your job is taking over your life? How you’re too busy for us? How you keep putting work first over us?” She shook her head. “No, you didn’t forget those things because they weren’t important.” He rubbed his temples, feeling a headache coming on. “Those are not important? You’re acting like my job is all"
    },
    {
        "Triggering Event": "A few hours before closing, he found an old receipt tucked into his wallet - her handwriting, scrawled notes for their cancelled anniversary dinner. He paused, sadness welling up, as a couple nearby laughed, oblivious to the quiet ache in his heart.",
        "Sex": "Male",
        "Age": 21,
        "Occupation": "Retail Worker",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Sadness",
        "Cognitive Distortion": "Mental Filter",
        "Generated Assessment": "Awwww, I just feel so bad that she wrote down all those sweet notes about how much she loved me and wanted to spend time with me. It's like, totally awesome, but oh man, this is making me really sad. I can't help but think about all the fun times we had together, laughing at each other's jokes and sharing our deepest secrets. Man, it feels like I'm losing my best friend forever. Oh no, what if she doesn't want to go out anymore? What if she thinks I'm weird for being so clingy? Maybe she already moved on to someone else who's way cooler than me? Ughhh, why did I have to find this right now when I was trying to forget her? I could've sworn she said she'd be back soon, but maybe she changed her mind? This is getting way too real; I can almost hear her voice whispering \"we're over\" in my ear. I wish I could tell myself it's just my imagination playing tricks on me, but honestly, it feels so damn real. This isn't going to end well, and I don't know how to stop this downward spiral. Why does everything have to turn into a disaster? Can't I just enjoy the moment and leave it alone? **Response End** # Edit: [Here](https://www.reddit.com/r/sadkilledme/comments/1h9d0a6/edit) is the original post."
    },
    {
        "Triggering Event": "In the lab, he noticed a faint hissing from an old experiment's apparatus, unheard by anyone else. Panic surged as he imagined the worst: a leak in their one-of-a-kind gas mixture, undetected for hours. His heart pounded as he rushed towards it, fingers trembling as he reached to shut off the valve.",
        "Sex": "Male",
        "Age": 70,
        "Occupation": "Scientist",
        "Relationship Status": "Widowed",
        "Negative Emotion": "Panic",
        "Cognitive Distortion": "Blaming",
        "Generated Assessment": "\"Are you fucking kidding me?! You just casually let that hissing thing go on for hours? How could you be so fucking irresponsible? Don't even get me started on how this is going to affect our project timeline! I can already imagine all the shit we're going to have to deal with because of your carelessness.\""
    },
    {
        "Triggering Event": "She overslept, her alarm silenced by an errant elbow in the pre-dawn hours. Rush hour traffic was heavier than usual, and she found herself stuck at a red light, watching as the ambulance she'd called for rushed past, sirens wailing. Arriving late to the hospital, she discovered a barrage of emails from impatient colleagues and an overflowing patient list. Her hands trembled slightly as she reached for her stethoscope, the familiar weight now feeling more like a noose than a trusted tool.",
        "Sex": "Female",
        "Age": 72,
        "Occupation": "Doctor",
        "Relationship Status": "Married",
        "Negative Emotion": "Stress",
        "Cognitive Distortion": "Unfair Comparisons",
        "Generated Assessment": "I'm so tired of being behind every single day. It's always me, always rushing around, never catching up. My friend has it so easy - she wakes up whenever, doesn't have to rush through her day, and still manages to get everything done. Meanwhile, I'm barely holding together. I've been running since morning, but somehow, I'm already lagging behind. This is insane; how can one person be so much more organized? The fact that she gets everything done while I struggle just makes things worse. I swear, every time I see her, I feel like I'm failing. Why does it always have to be me, always struggling? I'm not even sure why I bother anymore. If my life was this chaotic, I'd give up too. But something inside me keeps going, maybe because I don't want to admit defeat. Maybe I think if I keep pushing, I'll eventually catch up. But deep down, I know it's just a myth. Everyone else has it so much easier, and yet they still manage to act like they're perfectly fine. They all seem so confident, so put-together. What am I missing? Why can't I be like them? I try to remind myself that everyone struggles, but it doesn't help. Every time I look at my schedule, I feel like I'm drowning. There's no way I'll ever be as well-organized as those people who make it look effortless. And when I"
    },
    {
        "Triggering Event": "A woman in her fifties, a software engineer, was reaching for a bagel at the office kitchen counter when she felt something squishy beneath her fingers. She looked down to see a moldy green patch growing on the bread she had been about to take.",
        "Sex": "Female",
        "Age": 52,
        "Occupation": "Software Engineer",
        "Relationship Status": "Single",
        "Negative Emotion": "Disgust",
        "Cognitive Distortion": "Discounting the Positive",
        "Generated Assessment": "*It’s such a shame. I mean, this could have happened to anyone. I know I’m always so careful with my food but still...* *And now I’ve gone from being so excited to start my day, to *this*. It’s like it never even existed.* *But, you know what? That green stuff is probably just some kind of fungus that grows on everything. You can find them everywhere, right? So, no big deal.* *I feel terrible because this whole thing makes me think about all the other times I might have forgotten to clean up after myself in the past. I can’t believe I let something like this happen.* *But it’s okay, really. It doesn’t matter anymore. This isn’t the first time something like this has happened. And honestly, I wish people would stop making such a fuss over little things like this.* *I don't even want to talk about it anymore. The thought of all those germs spreading around the office is too much. I need to go back to work, but I'm going to avoid everyone so I don't have to face it.* *And why am I still here? It’s not worth it. I’ll just leave early and forget about it.* *This isn’t the end of the world; it’s just one small slip-up. But it feels like such a huge mistake!* *There are probably other important things I need to focus on today, like the"
    },
    {
        "Triggering Event": "\"While patrolling late one night, she noticed an open window on the second floor of an abandoned house. Her heart began to race as she approached, flashlight shaking slightly in her hand. Suddenly, a loud noise echoed through the empty building, sending her adrenaline surging. She froze, panic rising like bile in her throat, as she waited for what felt like an eternity before the noise repeated - just a cat, but her breath remained ragged until she reached backup.\"",
        "Sex": "Female",
        "Age": 22,
        "Occupation": "Police Officer",
        "Relationship Status": "In a Relationship",
        "Negative Emotion": "Panic",
        "Cognitive Distortion": "Mind Reading",
        "Generated Assessment": "She's so fucking paranoid. It's ridiculous how much she overthinks everything, always jumping to conclusions about people's intentions. Just because she thinks someone is watching her doesn't mean it's true. And why would anyone watch her? What does she have to offer them? But then there's this stupid story about a girl who saw a cat outside and thought it was some monster lurking in the shadows. Of course, it was just a harmless animal, but that didn't stop her from being terrified for hours afterward. Now, whenever she hears a strange sound, she assumes something sinister is happening, even when it's just a normal occurrence. What really gets me is that she's always talking about how she feels like she can sense things around her, like she has these weird instincts telling her stuff is off. But if she actually listened to her own mind, she'd realize it's all just her imagination running wild. Still, she keeps going on about it, making up scenarios about other people knowing her deepest secrets or plotting against her. It's pretty sad, really—she’s so consumed by her own anxiety that she ends up misinterpreting every little thing. Like, she'll think someone is staring at her, and then she'll get so worked up that she starts imagining the worst-case scenario. Then, after it turns out nothing happened, she still acts like she knows exactly what was going through the other person’s head. She genuinely believes everyone else is reading her mind"
    },
    {
        "Triggering Event": "Every day at 9 AM sharp, he'd open up the store. Today, a young man barged in, slamming the door behind him. \"You were supposed to have these in stock!\" he shouted, waving a crumpled receipt for a discontinued item. The old man's face reddened. He took a deep breath before replying firmly but quietly, \"I'm sorry you're upset, but we can't control what the suppliers send.\"",
        "Sex": "Male",
        "Age": 76,
        "Occupation": "Retail Worker",
        "Relationship Status": "Widowed",
        "Negative Emotion": "Anger",
        "Cognitive Distortion": "What if?",
        "Generated Assessment": "Ugh, I wish someone had asked me that question before I opened my own business. What if I get fired from this job? What if it doesn’t work out? I would have prepared myself better. Now I’m stuck with a failing business and no savings left. If only I had been more careful, I wouldn’t be in this mess. I feel so stupid for not thinking things through before investing all my money into this venture. It’s just not fair! I worked hard to save up for it, and now I’ve lost everything because of my own carelessness."
    }
]