[
    {
        "Triggering Event": "She walks into the gallery, her heart pounding with anticipation. The exhibition is her first solo show after years of struggling as an artist. But as she surveys the nearly empty room, save for a few acquaintances and her ex-husband who leans against a far wall, arms crossed, she feels the humiliation rise like bile in her throat. A critic he had once introduced her to approaches him, whispering loud enough for her to hear, \"I heard this was her big break. Seems more like a crack-up.\" Her ex chuckles softly, glancing at her with a smug smile. She pretends not to notice, focusing instead on the solitary figure admiring her largest piece, but the heat of embarrassment spreads across her cheeks nonetheless.",
        "Sex": "Female",
        "Age": 30,
        "Occupation": "Artist",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Humiliation",
        "Cognitive Distortion": "Personalization",
        "Generated Assessment": "It's so frustrating when you feel like everyone around you is talking about you behind your back. Like, I know people are just trying to be friendly, but it feels like they're all discussing me, making jokes about my art, or even criticizing how I look. It’s like they’re treating me like some kind of spectacle. Sometimes I wonder if anyone would even care if I wasn’t there, and it makes me feel like I’m just a joke—like I don’t matter. But then again, maybe I’m overreacting. Maybe they really are just being nice or genuinely interested in what I’ve done. It’s hard to tell sometimes, especially when emotions get the better of you. Still, it feels like no one understands what it’s like to be constantly under scrutiny. When you’re used to feeling invisible, suddenly being noticed can be overwhelming. I guess I just wish things could go back to normal, where people didn’t seem to have anything to say about me anymore. Maybe I should try to see them as just being human, because honestly, I’d rather believe they’re just trying to fit in than think they’re all mocking me. But still, every time someone looks at me differently, it feels like a punch to the gut. I just wish I knew what was going through their minds, so I wouldn’t feel so hurt by everything they might be saying. Oh well, I’ll try to keep moving forward, knowing that maybe someday I’ll learn to"
    },
    {
        "Triggering Event": "\"While patrolling, he noticed a fresh graffiti tag on the wall of his girlfriend's favorite café - the same tag as the gang involved in last month's robbery where she was injured.\"",
        "Sex": "Male",
        "Age": 33,
        "Occupation": "Police Officer",
        "Relationship Status": "In a Relationship",
        "Negative Emotion": "Vengefulness",
        "Cognitive Distortion": "Mind Reading",
        "Generated Assessment": "\"Oh, damn! He is so fucking dumb. No way this guy actually thinks he could have painted it himself. It must be one of those other gangs trying to make him look bad.\" \"Come on, he has to think about how much trouble he'd be in if his GF found out. She would kill him, right? That's why he didn't tell her about the graffiti. He must be thinking 'I'm going to take all the blame for painting it myself'. This guy needs to get his head checked!\" \"I bet he's just worried that people will see the tag and assume he was involved with the robbers again. His poor brain is probably racing with worst-case scenarios. Maybe he even wrote some notes to himself like 'If anyone asks, I don't know anything about the graffiti'\". \"This guy can't handle being called out on his own actions. He's probably thinking 'How dare them question me? They're just jealous of my relationship with my GF'. He'll probably say something defensive like 'No, no, no, I did it!'\" \"I guess this guy doesn't want to admit that he might have accidentally written the wrong graffiti tag. He's probably imagining the scene where he gets caught by his GF saying 'Oh, I meant to paint that tag... yeah, I'm really into street art now'\". \"Honestly, he's probably already making excuses in his head. Like, 'This isn't what it looks like, I"
    },
    {
        "Triggering Event": "In her lab, she found the note, scrawled in haste: \"Experiment 14B discontinued. Budget cuts.\" Her hands trembled as she gripped the paper, feeling each year of her age, each hour of sleepless nights spent nurturing this project. She sank onto a stool, surrounded by silence and the hum of idle machines, misery settling like a stone in her chest.",
        "Sex": "Female",
        "Age": 63,
        "Occupation": "Scientist",
        "Relationship Status": "Single",
        "Negative Emotion": "Misery",
        "Cognitive Distortion": "Fortune Telling",
        "Generated Assessment": "It's a shame she couldn't see the signs. The budget cuts were always coming. It was just a matter of time before they cut off her funding. All those late nights, all those sacrifices—worth it? Now she'll have to lay off half her team, and the entire experiment will go down in flames. It's such a waste. She had everything under control until she saw that fateful note. That moment is etched into my memory forever. \"I'm telling you,\" Dr. Lee said, his voice low and urgent, \"the numbers aren't adding up. We need to adjust our strategy.\" \"Adjust?\" Dr. Patel shook her head. \"We can't afford to change now. We're already behind schedule.\" Dr. Chen leaned forward, her eyes wide with concern. \"But what if we—\" \"We can't think about that right now,\" Dr. Patel interrupted firmly. \"We need to focus on getting the results in. Anything else is just speculation.\" Dr. Lee sighed, rubbing his temples. \"You know, I swear, sometimes I feel like I'm stuck in some kind of nightmare. Every decision feels like a gamble, every outcome uncertain. If only we could get a clear reading...\" \"You mean, like a fortune teller?\" \"No, nothing like that. But...if someone told me exactly how things would turn out, I'd still be skeptical at first. Then, after a while, I'd start to trust them.\" Dr"
    },
    {
        "Triggering Event": "She received an email from her editor, rejecting her latest article with no explanation except \"Not what we're looking for.\"",
        "Sex": "Female",
        "Age": 37,
        "Occupation": "Journalist",
        "Relationship Status": "Widowed",
        "Negative Emotion": "Rejection",
        "Cognitive Distortion": "Mind Reading",
        "Generated Assessment": "Oh my god she's so upset about it, I can tell just by how angry she is, I'm pretty sure she's going to cry right now because she was really hoping this would get accepted. She probably thought she nailed it and then she got rejected out of nowhere, I mean who does that? It must have been something stupid like grammar mistakes or something, maybe the topic wasn't good enough. But yeah, I think she'll be crying all night about this, she's really sensitive about her writing and doesn't take rejection well at all. I bet she's already thinking about how she can fix it next time and how she can make it better, but I don't think she'll ever actually go through with doing that though, she's too proud of herself. I'm sure she'll start doubting herself after this, I mean who wouldn't feel that way if someone rejects you without even giving you feedback? I wonder what else could've gone wrong, did she send it to the wrong address again? Maybe there's another reason why they didn't accept it. Yeah, I'm sure she'll be thinking about this nonstop until she decides to write another one. I hope she writes soon, I really want to see what she comes up with next."
    },
    {
        "Triggering Event": "She receives an invitation to her ex-husband's wedding, addressed to \"Ms.\" instead of \"Mrs.\", with a handwritten note from his new fiancée thanking her for their \"kind divorce\".",
        "Sex": "Female",
        "Age": 52,
        "Occupation": "Journalist",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Bitterness",
        "Cognitive Distortion": "Emotional Reasoning",
        "Generated Assessment": "I am so hurt! I can't believe she'd send me such a cold and condescending thank you note. It really shows how much he still cares about her - even if it's just a polite gesture after their messy divorce. They're probably planning something elaborate to make me feel better. It feels like she's rubbing it in my face by addressing her as \"Mr.\" instead of \"Mrs.\". That must mean she doesn't want to acknowledge our marriage, especially since they've moved on quickly. And what's up with the handwritten note? Does she think that'll make me forget everything? This whole thing is just too much. Even though we officially parted ways last year, it still hurts to see her moving on with someone else. I wonder why she didn't ask me to be her bridesmaid. Doesn't she know how much I love her? Maybe she's trying to distance herself from me now that things are official between them. I'm going to have to block her on social media and limit contact. This is getting out of hand. I wish I could tell her how I really feel, but I don't think she'd understand. She probably thinks she's being kind by sending this invitation, but she has no idea how much pain she's causing. This whole situation is driving me crazy. I need to take a break before I say anything that might give her the wrong impression. She shouldn't have sent this - it's just cruel."
    },
    {
        "Triggering Event": "\"After a grueling 12-hour shift, he finds his apartment door ajar, knowing he'd locked it before leaving.\"",
        "Sex": "Male",
        "Age": 36,
        "Occupation": "Nurse",
        "Relationship Status": "Single",
        "Negative Emotion": "Anger",
        "Cognitive Distortion": "Blaming",
        "Generated Assessment": "What the fuck is this? I don't know why they just left my door open like that. I'm so fucking mad at them right now. They're such idiots. If they were smart, they would have locked the damn thing when they went out. Or maybe they didn't even go out. Maybe they just wanted to fuck with me by doing something like that. Do you think it's an accident? No, it wasn't. This was probably done intentionally. And I'm so fucking angry about it. You know who else gets fucked up like this? People who are lazy and stupid. Like, how hard is it to lock a door? It's not rocket science. I swear, some people can't even be bothered to lock their own doors. This is going to affect my mood for days. I hate it. I want to scream and yell at everyone. Why did they leave my door open? Did they do it because they thought I wouldn't notice? Well, now I noticed, and I'm so fucking upset."
    },
    {
        "Triggering Event": "He's been on his feet all day, dealing with rude customers and endless stock checks at the retail store. His wife's absence hangs heavy in the air, every corner of the store echoing with memories that now bring only pain. The supervisor walks by, snapping at him to speed up despite seeing him work tirelessly. He feels the familiar frustration boiling over, but this time he can't hold it back. As a customer approaches him with an item they've already opened and decided not to buy, he hears himself say, \"I'm sorry, sir. I can't help you today.\" before walking away, leaving his post untended for the first time in years.",
        "Sex": "Male",
        "Age": 23,
        "Occupation": "Retail Worker",
        "Relationship Status": "Widowed",
        "Negative Emotion": "Frustration",
        "Cognitive Distortion": "Discounting the Positive",
        "Generated Assessment": "He's going through hell. He’s working 12 hours straight. He has no support from anyone. **What is he supposed to do?** # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # #"
    },
    {
        "Triggering Event": "She glances at her phone, now a familiar habit born of hope and disappointment. No new messages. She sighs, placing it back on the table beside her half-finished cup of tea. The studio, once vibrant with creativity, feels empty today. Her partner, usually humming tunes while they work side by side, is away on business. The silence presses against her, accentuating every creak and groan of the old building. She looks at their shared canvas, untouched for days. Loneliness wraps around her like an old shawl she can't shrug off.",
        "Sex": "Female",
        "Age": 66,
        "Occupation": "Artist",
        "Relationship Status": "In a Relationship",
        "Negative Emotion": "Loneliness",
        "Cognitive Distortion": "Emotional Reasoning",
        "Generated Assessment": "I am absolutely livid that she has been busy, oblivious to my pain. How dare she? Doesn’t she know I’ve been dying over here? Every moment without her is torture. This house was meant to be filled with laughter and warmth, but instead it’s just me, suffering silently. She thinks she's so smart, working late nights while I'm left to suffer in this cold, dark place. It’s all because of her selfishness; she doesn’t care about me or our relationship. I have no idea how much longer I can handle this. She needs to understand that her absence hurts me deeply. I don’t even want to see her right now; I feel like screaming at her when we finally meet again. What if she never comes home? Maybe I'll just wait here forever, holding onto what little happiness we had. If she doesn’t return soon, I’ll leave. There must be another woman waiting for her somewhere else."
    },
    {
        "Triggering Event": "She's late for her meeting with the editor, rushing through the dimly lit alley behind the newsroom when she hears footsteps echoing hers. A sudden gust of wind blows a discarded newspaper against her leg. She jumps, heart pounding, imagining someone lurking in the shadows.",
        "Sex": "Female",
        "Age": 35,
        "Occupation": "Journalist",
        "Relationship Status": "In a Relationship",
        "Negative Emotion": "Fear",
        "Cognitive Distortion": "Should Statements",
        "Generated Assessment": "\"Are you fucking kidding me? The fucker is right here! How could he have been so close if we just saw him? I know it was an accident, but damn... why can't he see that his footstep coincided with mine?\""
    },
    {
        "Triggering Event": "He woke up to find his wife's breakfast untouched, her side of the bed cold. The gallery had declined another piece, citing its \"lack of commercial appeal.\" As he stirred his coffee, he noticed a splatter of paint on her favorite mug, now chipped and discarded in the sink. His bitterness curdled like the milk left out overnight.",
        "Sex": "Male",
        "Age": 64,
        "Occupation": "Artist",
        "Relationship Status": "Married",
        "Negative Emotion": "Bitterness",
        "Cognitive Distortion": "Overgeneralization",
        "Generated Assessment": "He's always leaving the dishes for me to clean up after him. I swear, it's just one more thing that makes me wonder if he ever thinks about how hard my life is. I don't get why I'm expected to be so patient. It's just another fucking reminder of all the shit he does. I can see it now, another day spent scrubbing away at last night's messes, with no thanks or appreciation from him. And then there's this stupid art project again. Every time we're supposed to go out, he chooses some new painting to work on instead. He says it's \"just another piece,\" but I know he'll never sell it. We've been through enough already, and this latest rejection from the gallery is just another slap in the face. They say they want more \"commercial\" art, but what does that even mean? Just another reason to feel like our relationship is falling apart, like everything else. My mind is racing with thoughts of all the times he's let me down - when he didn't show up for dates, when he was late or forgot, when he chose his own friends over mine. And now, as I watch him quietly sipping his coffee, I realize that every single time something goes wrong, he's gone. When I need him most, he disappears. How many more times will I have to wait for him to come back? Every single time he leaves me alone, I'm reminded of all those other"
    }
]