[
    {
        "Triggering Event": "In her decades of teaching, she had seen many students come and go, but none had stirred quite the same embittered resolve as young Emily. Today, Emily sauntered into class late, laughing loudly with a friend, flouting the rules that Mrs. H. had enforced for years. As she passed by, Emily carelessly knocked over a stack of papers, scattering them across the floor. She didn't bother to stop or apologize. Instead, she flashed a smug smile at Mrs. H., who felt a bitter taste rise in her mouth.",
        "Sex": "Female",
        "Age": 77,
        "Occupation": "Teacher",
        "Relationship Status": "In a Relationship",
        "Negative Emotion": "Spite",
        "Cognitive Distortion": "Discounting the Positive",
        "Generated Assessment": "I can't believe I'm so upset about it. It's just one paper. What's the big deal? Maybe if I got up there and told everyone how much I hated Mrs. H., it would make me feel better. But honestly, I'm feeling pretty good right now. I mean, we have a great team here, and I love my friends. We're all doing really well this semester. It doesn't seem fair that I get in trouble for something like that, especially when other people haven't been held accountable. Still, I know I messed up, and I shouldn't be surprised if I get in trouble again soon."
    },
    {
        "Triggering Event": "At 7 AM, the teacher noticed her car wouldn't start. She had a full day of classes ahead, including an important lesson she'd been preparing for weeks. As she sat in the driver's seat, turning the key repeatedly with no response from the engine, she felt a familiar chill of despair creep up her spine. The silence seemed to mock her, another obstacle she couldn't overcome alone since he was gone. She slumped against the steering wheel, helpless tears stinging her eyes as the school bell echoed in the distance, signaling another day that was slipping away from her control.",
        "Sex": "Female",
        "Age": 49,
        "Occupation": "Teacher",
        "Relationship Status": "Widowed",
        "Negative Emotion": "Helplessness",
        "Cognitive Distortion": "Blaming",
        "Generated Assessment": "Ugh, why does this always happen? I swear, it’s like he doesn’t even care about me anymore. He just left me here again, and now I have to deal with everything by myself. Why did I even get married? It’s all his fault, leaving me to face this nightmare alone. I hate him for making me feel so useless. And what’s worse, he probably has someone else waiting for him somewhere. That’s why I can never catch a break. Even if I could somehow magically fix this stupid car, which is ridiculous anyway, I’d still be stuck here all morning because he’s too busy fucking some other bitch. This is insane. I wish I could just disappear. What’s the point of trying anymore? It’s not just the car. It’s everything. School, work, life itself. Everything feels pointless when he’s not there to share it with me. I’m not even supposed to be driving today; I was supposed to be studying for our math test. But now I’ll have to spend hours trying to figure out how to fix this dumb car. Not to mention the stress of dealing with everything else on my own. I don’t know how much more of this I can handle. I need him back here. He wasn’t even around when we got married. We barely knew each other at that point, but I thought he was going to change. I gave him every chance, and I tried my best to make"
    },
    {
        "Triggering Event": "She scrolled through the familiar feed, pausing at a photo of her former colleague, now enjoying a lavish dinner with his wife and two kids in Paris. Her eyes lingered on the smiling faces, the joy evident even in the small square image. She felt a pang in her chest, an ache she'd grown all too familiar with since the divorce.",
        "Sex": "Female",
        "Age": 42,
        "Occupation": "Software Engineer",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Envy",
        "Cognitive Distortion": "Personalization",
        "Generated Assessment": "She's probably just posting for attention because it's so obvious how much she misses him. The fact that they're having a great time together is no coincidence; I'm sure he's doing this to rub it in my face. Her post doesn't mean anything except as a reminder of what I've lost. It's pointless for me to think about it anymore, but I guess I'll just keep letting it eat away at me like a cancer. The pain isn't going anywhere anytime soon. Why bother trying to move on when someone else gets to enjoy the happiness that was once mine? What really bothers me is how casually they share these photos, as if nothing out of the ordinary happened. They act like everything is fine, which makes me feel worse - like I'm overreacting and being overly sensitive. It's clear that she thinks I'm the one who messed up, so I might as well make her suffer by confronting her in public. What would be more satisfying than catching her off guard? I wonder if she'll get upset when she sees my message. Maybe I can turn her day around by revealing how much I miss him. If only I could take back those hurtful words from our last fight, maybe things wouldn’t have ended like this. But no, she had to go and tell everyone about us, making it impossible for me to ever forget the way she broke my heart. Now I’m left to deal with the shame of being cheated on, and she’s living"
    },
    {
        "Triggering Event": "After spending hours in his studio, painting with no clear vision, he looked at his watch and realized it was past midnight. His wife had sent him a text message hours ago saying she needed to talk, but it remained unopened on his phone. He felt an overwhelming urge to delete everything he'd painted today, feeling like it was all pointless anyway. The thought echoed in his mind, \"What's the use?\"",
        "Sex": "Male",
        "Age": 20,
        "Occupation": "Artist",
        "Relationship Status": "Married",
        "Negative Emotion": "Hopelessness",
        "Cognitive Distortion": "All or Nothing Thinking",
        "Generated Assessment": "It’s like he has this one way of thinking where everything is either a complete failure or a huge success. Like if he can’t finish something, he thinks it’s useless, and then when he finally finishes, he thinks it’s perfect. It’s like his brain doesn’t know how to handle anything that isn’t 100% or 0%. He’ll spend so much time trying to get something right, and when he does, he just goes back to his old mindset. I’ve seen him work for hours, and then he’ll just throw everything away because it wasn’t enough. But then he gets frustrated with himself for even trying, and now he feels like he needs to start over from scratch again. And then there are times when he paints something amazing, and he’s so happy about it. But even after celebrating, he starts worrying that he might have to redo it or that someone else could be better than him. I feel like he has this huge fear of messing up, so whenever he makes a mistake, he freaks out and throws everything away. And it’s always “all or nothing.” If it’s good, he’s too proud to change it, but if it’s bad, he deletes everything because it’s “not worth it.” I guess what I’m saying is that he really struggles with finding balance. Sometimes he’s too hard on himself, and other times he feels like he’s not pushing himself enough. Either way, he ends up disappointed or"
    },
    {
        "Triggering Event": "After 40 years of teaching, he expected some respect from his former students. But there they were, laughing loudly at the café across from his classroom, their words echoing through the open window: \"Remember old man...?\" A bitter taste filled his mouth as resentment welled up. He wasn't ready for retirement yet.",
        "Sex": "Male",
        "Age": 72,
        "Occupation": "Teacher",
        "Relationship Status": "In a Relationship",
        "Negative Emotion": "Resentment",
        "Cognitive Distortion": "Blaming",
        "Generated Assessment": "I'm sick of this guy. I don't know why he's still here; he clearly doesn't deserve it. His attitude is so unprofessional. Just yesterday, he was yelling at me during class. I can't believe he thinks he has the right to talk like that to a student. I'm just trying to learn and get good grades, but he's making it impossible. He didn't even try to apologize after what happened last week. I tried to explain how uncomfortable it made me, but he just laughed it off and said I was being dramatic. Now he's back again, making fun of me in front of everyone. It's ridiculous. This guy needs to be fired. He's not doing anything useful anyway. All he does is lecture us about history and make jokes that aren't funny. I'm tired of him ruining our experience. It's his fault we're falling behind in school. We'd be doing better if he weren't around. He's always talking negatively about himself. I heard him say something about how he used to be a great teacher when he first started, but now he's just an embarrassment because he's getting older. What kind of teacher says stuff like that? And then he expects us to care about what he has to say? It's unbelievable that someone like him gets to teach kids like us. He has no business being in charge. Every time he speaks up, he sounds arrogant and condescending. The way he talks down to us"
    },
    {
        "Triggering Event": "A late-night callout leads her to a domestic disturbance at an apartment complex. As she arrives, she hears raised voices and sees her partner's car already parked outside. She strides towards the commotion, only to find him standing idly by while a man screams insults at his sobbing wife. Her partner merely shrugs, \"It's just a lovers' quarrel.\" Anger surges through her veins as she steps between them, her hand firmly on her weapon, demanding silence and respect.",
        "Sex": "Female",
        "Age": 24,
        "Occupation": "Police Officer",
        "Relationship Status": "In a Relationship",
        "Negative Emotion": "Anger",
        "Cognitive Distortion": "Fortune Telling",
        "Generated Assessment": "\"Oh my god, you fucking ass-hat! You're supposed to protect me, not fuck some bitch behind my back!\" she bellows, fists clenched as she storms into the room. \"I don't know what you're talking about,\" he replies calmly, eyes fixed on hers, but the look in his gaze is laced with guilt. She takes a step closer, her voice rising in indignation. \"You think this is funny? This isn't a joke! You promised me everything, said you'd leave your ex for me, and then you go out there and—\" \"Hey, let's keep it civil,\" he interrupts, holding up his hands in a placating gesture, but his eyes betray his guilt. \"We can talk about this later.\" \"You fucking piece of shit,\" she spits, her anger boiling over. \"How could you do this to me?\" He shakes his head, a hint of sadness creeping into his expression. \"Let’s calm down, okay?\" he suggests softly, but she cuts him off with a snarl. “No way, we’re going to get to the bottom of this right now.” She glares at him, trying to process the betrayal. “This wasn’t your fault, but how could you—” He interrupts again, “I didn’t plan anything,” and she feels her anger spike even higher. “Then why were they screaming at each other when I got here?” she demands, her voice shaking with rage"
    },
    {
        "Triggering Event": "In the quiet of her study, she found his old sweaters, still in the box she'd packed away years ago. She hadn't realized they were still there, hidden beneath layers of dust and memories. As she pulled out each one, the scent of him, long faded from their fabric, brought a wave of despair crashing over her.",
        "Sex": "Female",
        "Age": 71,
        "Occupation": "Software Engineer",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Despair",
        "Cognitive Distortion": "All or Nothing Thinking",
        "Generated Assessment": "She was devastated, unable to comprehend that he would leave her like this. The thought of living without him, of never holding him close again, overwhelmed her. It felt as though she was drowning in grief, with no lifeline in sight."
    },
    {
        "Triggering Event": "A nurse, nearing her 39th birthday and still single, watches as an ex-colleague, now married with two children, posts yet another idyllic family photo online. She feels a pang of spite, imagining how different things could have been if he hadn't ghosted her years ago after promising a future together.",
        "Sex": "Female",
        "Age": 38,
        "Occupation": "Nurse",
        "Relationship Status": "Single",
        "Negative Emotion": "Spite",
        "Cognitive Distortion": "Jumping to Conclusions",
        "Generated Assessment": "**Subjective Reaction:** Oh my god, I can’t believe it! My friend is just so happy to be a mom. It’s like she’s living her best life right now. I feel so jealous that I wasn’t able to find someone to settle down with. She has everything I want, but somehow got it all together. Why did I never think about this before? I keep thinking back to when we were friends, and how much fun we had hanging out. Now, she must be enjoying every moment of motherhood. She gets to stay home with her kids and spend quality time with them, while I’m stuck working full-time with minimal days off. I wish I had made more of an effort to hold onto him, maybe things would’ve worked out between us. He was always so supportive and loving, making me feel special. But then again, why didn’t I realize how much I needed someone like him in my life sooner? Maybe if I had taken his relationship more seriously at first, things wouldn’t have fallen apart. Now, he’s probably having a blast with his new wife and kids. I wonder what they’re doing tonight, probably having a family movie night or something. This post just keeps popping into my head over and over again. Every time I see it, I get this overwhelming urge to reach out and ask for advice. But honestly, I don’t really need anything. I just feel like I’m missing out on something important here. If"
    },
    {
        "Triggering Event": "After an intense 12-hour service, Chef notices a post-it note from his wife reminding him about their anniversary tomorrow. He realizes he hadn't planned anything, and she's never mentioned it once this week.",
        "Sex": "Male",
        "Age": 34,
        "Occupation": "Chef",
        "Relationship Status": "Married",
        "Negative Emotion": "Remorse",
        "Cognitive Distortion": "Labeling/Global Labeling",
        "Generated Assessment": "I'm such an asshole! I have no idea how someone like me can be so clueless all the time. What if I'm actually an idiot? It makes sense that I would forget something as important as our anniversary. I'm probably just lazy or really stupid. I feel like I've always been this way - forgetting things and not paying attention. Maybe I'm just not good enough or worth remembering. Why is everyone else so much better at planning and keeping track of things? I hate feeling like this. It feels like I'll never change, even though I know deep down that I need to work on myself."
    },
    {
        "Triggering Event": "She watched him stab at his eggs with disdain, the same way he'd dismiss her theories over breakfast for years. Today, it was the final straw. She pushed her chair back, leaving her uneaten toast as she walked out, contempt burning like a cold flame in her chest.",
        "Sex": "Female",
        "Age": 58,
        "Occupation": "Scientist",
        "Relationship Status": "Married",
        "Negative Emotion": "Contempt",
        "Cognitive Distortion": "Mental Filter",
        "Generated Assessment": "Oh, wow, I'm so glad she finally decided to take action. It's always better late than never, right? I mean, who wouldn't want someone to make fun of them all these times? Now that she's left, I can focus on my work. What a relief! The fact that I've been tolerating this for so long doesn't bother me at all. This is actually great news! She really does have an incredible ability to make herself look perfect by dismissing everyone else's ideas. I just wish she could be more open-minded, but I guess we'll never know. After all, she's clearly done with trying to change. Oh well, maybe now she'll realize how much she misses me. This isn't even about me; it's about her being selfish. If anything, I feel sorry for her because she has such a hard time understanding others. But what does it matter? Letting go of our friendship means nothing to me either. Who needs friends when you have family, anyway? In reality, none of this matters. I shouldn't care about her actions or feelings. They're irrelevant to me. Yet here I am, still feeling upset and hurt. Maybe I should just focus on myself instead of worrying about her drama. Yeah, that makes sense. My feelings don't matter, after all. It's funny how some people are oblivious to everything around them while others see through every detail. I wonder if she realizes how much she took advantage"
    }
]