[
    {
        "Triggering Event": "Scenario:\n\nWhile sorting through old patient files at the clinic, she comes across a familiar name. It's her former husband, admitted under an alias years ago. She remembers him - his pain was physical, but his regret was hers to bear now.",
        "Sex": "Female",
        "Age": 70,
        "Occupation": "Nurse",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Regret",
        "Cognitive Distortion": "What if?",
        "Generated Assessment": "She thinks about this for a moment, then turns around to face me. \"So you're telling me that my past actions have consequences?\" I ask, raising an eyebrow. \"You know, I've always wondered what would happen if... If I were to make a mistake.\" \"What kind of mistakes?\" \"Like, what if someone found out?\" she asks, her voice laced with worry. \"Or maybe I could get fired.\" Her eyes dart back and forth, as if searching for answers. \"I don't know. What if it happened again?\" \"I don't think so,\" I reply calmly. \"But even if it did, what would we do?\" \"Well, that depends on how bad it is.\" She leans forward, her expression serious. \"If it was just a small thing, I'd probably apologize and move on. But if it got really serious... Well, what if someone saw us together?\" Her gaze falls inward, and for a moment, I see a flicker of fear there. \"I mean, what if they started spreading rumors?\" \"That wouldn't be good for anyone involved,\" I say gently. \"But let's focus on fixing things rather than worrying about what might happen.\" Her expression softens slightly, and she looks away, her shoulders relaxing ever so slightly. \"Yeah, right,\" she mutters under her breath. \"What if I messed up again?\" \"Then we'll figure it out together,\" I reassure her. \"We can work"
    },
    {
        "Triggering Event": "After another sleepless night, she woke up alone in their king-sized bed. Her husband's side was still made, untouched since he'd left for the hospital two days ago, not expected home until Christmas. She looked at the empty chair by the window where his reading glasses usually lay. The house felt quieter than usual, emptier. She made her way to the kitchen, pausing at the photo of them on their wedding day - 50 years ago. Her reflection in the glass showed a woman with lines etched deeper than she remembered. She poured herself a cup of tea, now cold, and sat down at the table. The unopened letters from the hospital's legal team stared back at her, the words \"Wrongful Death\" visible through the envelope. She felt a familiar heaviness in her chest, a void that seemed to grow with each passing day. Hopelessness was her constant companion now, an unwelcome guest she couldn't evict.",
        "Sex": "Female",
        "Age": 76,
        "Occupation": "Nurse",
        "Relationship Status": "Married",
        "Negative Emotion": "Hopelessness",
        "Cognitive Distortion": "Discounting the Positive",
        "Generated Assessment": "Oh, you want me to go back to sleep? Are you kidding me?! I'm just sitting here thinking about how much I hate being married. And I know it sounds ridiculous, but seriously, every time my husband leaves me alone, I feel like I'm going crazy. It’s been three months since we last had sex, and I’m starting to think I’m just not meant to be happy. This morning, when I woke up alone again, I almost lost it. I didn’t even bother getting out of bed, just started sobbing uncontrollably. My whole world has come crashing down around me. The thought of spending the rest of my life alone is unbearable. I keep telling myself that maybe someday things will get better, but honestly, I can’t see why they would. Every time I look at our photo album, all I can think about is how long I have to wait before he comes home. This is so unfair—my whole life is turned upside down because one stupid mistake happened. I swear, I’ve tried everything to make him stay, but nothing works. He’s gone, and there’s no turning back. I feel like I’m slowly losing my mind, and I don’t know if I’ll ever find happiness again. **TL;DR:** Wife feels hopeless after husband leaves for work and doesn’t return home for 3 months, leading to thoughts of suicide and depression. (Please note this isn't the original story) #Edit"
    },
    {
        "Triggering Event": "He waited by the bar, nursing his drink, as he had every Friday night for months now. Tonight, she didn't show. He checked his phone again - no message. Just silence.",
        "Sex": "Male",
        "Age": 29,
        "Occupation": "Journalist",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Rejection",
        "Cognitive Distortion": "Magnification/Minimization",
        "Generated Assessment": "He has been going to this bar every week for months. He was always there at 7pm sharp, sitting alone by the bar drinking beer after work. She is supposed to meet him there tonight, but she doesn't show up. He checks his phone repeatedly for messages, but there are none. He just sits there with nothing to do, wondering why she hasn't shown up. She never showed up before, so it's probably her fault that she didn't come today either. Maybe she got busy with work and forgot about him. Or maybe she wasn't really interested in him all along and just used him for a good time. I'm wasting my time coming here every week if she isn't even into me. And I don't want to sit here alone anymore, so let's just say I'll stop coming here next week. This could be the last time he goes there. He can't keep spending money and time on someone who doesn't care about him. It's pointless to continue waiting by the bar; it's just an emotional waste of time. He will definitely stop coming there next week, because she clearly doesn't appreciate him. This whole situation is just too much for him. His life is going nowhere anyway, and he needs to focus on other things."
    },
    {
        "Triggering Event": "Scenario:\nAfter years of teaching, she'd seen her fair share of classroom messes. But today, as she opened the door to find a desk covered in sticky notes, each one bearing an insult about another student, her stomach turned. She felt a wave of disgust wash over her, the sight of those cruel words marring her beloved learning space almost unbearable.",
        "Sex": "Female",
        "Age": 65,
        "Occupation": "Teacher",
        "Relationship Status": "Married",
        "Negative Emotion": "Disgust",
        "Cognitive Distortion": "Emotional Reasoning",
        "Generated Assessment": "Oh my god, I was so upset when I saw that messy desk filled with all those nasty notes. I couldn't believe how mean some of those students were being! How could they do this to our classroom? It just made me want to cry, especially since I love my job and this is where I spend most of my time. Seeing all those hurtful comments just broke my heart. It's like they didn't even think twice before writing such awful things about others. And it wasn't just the insults themselves, but how many times I had to clean up after them, too. It was exhausting just thinking about it. I wish there was a way to stop people from doing something like this. Sometimes I wonder if I'm just too sensitive, if I'm missing out on something by feeling so strongly about it. But then I look around at other teachers who have gone through similar experiences, and I realize we're not alone in feeling this way. Maybe it's because I care so much about what happens in my classroom, but it still feels wrong to see someone else's work used like this. I know it's just paper, but seeing those notes scattered everywhere made me feel like I was failing somehow. I can't help but feel like this kind of behavior is normal for students. Some kids might be going through tough times at home, or maybe they're just trying to get attention? I don't know, but I'm starting to question whether I'm overreacting or"
    },
    {
        "Triggering Event": "A middle-aged woman, a nurse of 30 years, stands at the nurses' station, charting her latest patient's vitals. She notices a young resident approaching, his smirk evident even from afar. He stops beside her, leaning in to point out a minor error in her calculations, his voice loud enough for nearby colleagues to hear. \"Typical mistake,\" he says, shaking his head. \"I thought you'd have learned better by now.\" She feels the heat rise in her cheeks as she corrects herself, humiliated by the public reprimand.",
        "Sex": "Female",
        "Age": 56,
        "Occupation": "Nurse",
        "Relationship Status": "Single",
        "Negative Emotion": "Humiliation",
        "Cognitive Distortion": "Discounting the Positive",
        "Generated Assessment": "Oh my god, really? You think this is funny? I’ve spent decades learning how to be a professional, and you come along and tell me I’m wrong? It’s so unprofessional! I know exactly what I’m doing, but apparently, I need someone like you to show me up again. The way you said it was just rude. You could have said something constructive, but no, you had to make it sound like an insult. Now everyone knows I messed up. Just leave me alone!"
    },
    {
        "Triggering Event": "A woman in her thirties, seated alone at a bustling café, watches as her source's contact on their phone changes from 'calling' to 'disconnected'. The email she'd sent earlier today, requesting an interview for her upcoming expose, remains unopened. She sighs, rubbing her temples, and takes a sip of her cold coffee.",
        "Sex": "Female",
        "Age": 32,
        "Occupation": "Journalist",
        "Relationship Status": "Single",
        "Negative Emotion": "Disappointment",
        "Cognitive Distortion": "What if?",
        "Generated Assessment": "Ugh, what the fuck is up with people being so fucking rude? I swear, it’s like they’re all just one big fucking machine designed to suck the life outta me. I mean, I get it, I’m a journalist, but damn, can’t they see that I’m trying my best here? This whole thing started when I was supposed to meet this guy at a bar last night. He was going to give me some inside info about his company, but he bailed on me at the last minute saying he had a family emergency. I thought, okay, cool, no biggie, but then I got an email from him later that day telling me he was busy with meetings. So I send him another email asking again, and this time, he doesn’t even respond. It’s like he just disappeared into thin air. And now, I’ve spent the entire morning trying to track him down. I called his assistant, but she wasn’t there. I tried sending messages, but nothing. Not even a single reply. And to make matters worse, I just found out that the CEO of his company has been involved in some shady dealings, which makes everything even more complicated. But you know what really gets under my skin? When I’m left feeling like shit because someone else didn’t take the time to answer my simple emails. Like, come on! Can’t they see that I’m doing my job here? I don’t have all day to sit around"
    },
    {
        "Triggering Event": "An elderly male artist, his hands stained with decades of pigment, walked into his cluttered studio. As he passed the old sofa where he often took breaks, he noticed something moving under a pile of ragged blankets. He approached cautiously, his disgust growing as he recognized the source: a decaying rat corpse, maggots wriggling across its exposed flesh. The stench was overpowering.",
        "Sex": "Male",
        "Age": 62,
        "Occupation": "Artist",
        "Relationship Status": "Single",
        "Negative Emotion": "Disgust",
        "Cognitive Distortion": "Fortune Telling",
        "Generated Assessment": "You fucking idiot! What the hell are you doing?! How could you let this happen? You're an artist, for crying out loud, and look at your goddamn studio! It's a mess. And now... now there's a dead rat crawling around like it owns the place! Maggots everywhere, all over the floor, and those poor little creatures. They deserve better than this. And you, you're just standing here, staring at them like they're some kind of freak show attraction. Do you even care about these things?! And why is this happening right when I need my art supplies most?! I have paintings to finish for an important exhibition. Now everything is ruined because of your negligence. This whole room smells like death, and I can't even bear to touch anything. Your laziness has destroyed everything we worked for, and now I'm going to waste hours cleaning up after your sloppy ass! This isn't just about the mess; it's about how you treat others. Rats don't belong in your studio, especially not dead ones. You must have been too busy to clean up properly, but that doesn't excuse this. If you had just taken a few minutes to tidy up, none of this would've happened. But no, you were too caught up in your own world to notice, weren't you? Now, instead of being productive, you'll spend your time picking through my paints and brushes, trying to get rid of every last bit of that"
    },
    {
        "Triggering Event": "Scenario:\n\nA familiar face, now with a wedding band, approaches her at the hospital's cafeteria counter. They'd been colleagues before she took that year-long sabbatical after the divorce. The woman smiles warmly but avoids eye contact as she asks about her new position. \"I heard you're working in the pediatric ward now,\" she says, then quickly adds, \"Congratulations.\" Before she can respond, the woman walks away without waiting for a reply, leaving her holding two untouched coffees, one meant for a colleague who'd already left for their shift.",
        "Sex": "Female",
        "Age": 32,
        "Occupation": "Nurse",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Rejection",
        "Cognitive Distortion": "Unfair Comparisons",
        "Generated Assessment": "**Ugh**, I just got stood up by my former coworker **again**, this time right in front of me while I was trying to get my morning coffee. She walked into the hospital cafeteria wearing a wedding band, which is so fucking tacky. It makes it look like she's trying to rub it in our faces. Like what? That she finally found someone stupid enough to put up with her? And she had the nerve to act all sweet when asking how I'm doing, saying something about being happy for me. Happy?! Are you kidding me? You think I'm just going to be happy because you've moved on from your shit marriage? What does she know? Does she even remember how hard we worked together during those chaotic months? I don't see anyone congratulating me on getting out of that toxic relationship. But no, instead, she just glances over at me like I'm some kind of loser for still being single. And then she just leaves me standing there with two coffees—two coffees! Can you believe it? Two coffees that were meant for someone else, someone who actually cares about me. Meanwhile, she gets to go back to her family and friends, celebrating her \"happy\" life. This isn’t fair. I feel like I’m always the one who has to pick up the pieces after everyone else’s messes. But does anyone ever acknowledge that? No, they’re too busy patting themselves on the back for making it"
    },
    {
        "Triggering Event": "In the quiet of her apartment, she opens the kitchen drawer where he kept his cooking tools, now gathering dust. Her fingers brush against his favorite wooden spoon, and a lone tear falls onto its worn surface. She can almost hear him chuckle softly in her ear, \"Not too much salt, darling.\" The sadness seeps in like the slow simmer of a forgotten stew.",
        "Sex": "Female",
        "Age": 22,
        "Occupation": "Chef",
        "Relationship Status": "Widowed",
        "Negative Emotion": "Sadness",
        "Cognitive Distortion": "Labeling/Global Labeling",
        "Generated Assessment": "She's lost all control, drowning in an ocean of grief. It's been months since they parted ways, yet every moment feels like yesterday. He'd cook for her, and she'd feed them both, but now the silence is deafening. I've tried to move on, to find comfort in new recipes, but everything tastes bitter. His absence haunts me—each dish, each bite, each second feels like a reminder that we're no longer together. It's not just food; it's life itself. Every day blends into another, a never-ending cycle of loneliness. We were once two people who shared laughter, dreams, and a love that seemed unbreakable. Now, I'm left with nothing but memories of what could have been. What was once our home is now a constant reminder of his departure. Even the walls feel heavy, as if they're holding the weight of our broken relationship. I try to distract myself with work, but even my job seems dull, like a flavorless meal lacking the spice of life. But there's one thing that still brings a smile—a small note he used to leave me when I'd forget to turn off the stove. It reads, \"You don't want to burn dinner, but you do want to burn your heart.\" I can almost see him standing behind me, guiding my hand as I read those simple words. They're a reminder that even though we're apart, he'll always be there, watching over me"
    },
    {
        "Triggering Event": "In the quiet of her apartment, she found herself in the kitchen, absently chopping onions for a soup she hadn't planned to make. As she sliced through the last one, its pungent scent filled the room, reminding her of his tears when they'd cut them together, laughing at their shared clumsiness with knives. She paused, blinking back her own tears, before resuming, the silence broken only by the rhythmic thud of the blade against the board.",
        "Sex": "Female",
        "Age": 18,
        "Occupation": "Chef",
        "Relationship Status": "Widowed",
        "Negative Emotion": "Grief",
        "Cognitive Distortion": "What if?",
        "Generated Assessment": "She wonders what would happen if he were there now. What if this moment wasn’t just about chopping onions, but about him too? Would he be able to handle it? He’s been gone for months, and yet, every time she cooks, memories flood her mind—of how he once tried to chop an onion with his eyes closed, how he accidentally cut himself, and how he cried, holding her close as they both laughed at their own clumsiness. If he were here, would he cry again? Would we laugh together? Would I even be able to cook properly without him? Would I remember how to chop correctly? Or would my hands shake, and the knife slip, causing me to drop the onion? The thought sends a shiver down her spine. What if, in this very moment, everything went wrong? Would I feel as helpless as he did that day? Would I end up feeling alone, just as he did after leaving? The question lingers, and she pauses, looking around the empty space. It's as if the silence is trying to tell her something, but she can't quite decipher what it says. Maybe it’s just the onion, but maybe it’s more than that. Maybe it’s the memories, the laughter, and the tears all coming back at once. She takes a deep breath, wiping away a stray tear, and continues chopping, the sound echoing softly through the apartment."
    }
]