[
    {
        "Triggering Event": "After decades of marriage, he noticed her smiling at another man across the room at their friend's anniversary party.",
        "Sex": "Male",
        "Age": 74,
        "Occupation": "Software Engineer",
        "Relationship Status": "In a Relationship",
        "Negative Emotion": "Jealousy",
        "Cognitive Distortion": "Magnification/Minimization",
        "Generated Assessment": "**Cognitive Distortion:** Magnification/Minimization This is how I responded to my partner after noticing them smile at someone else: \"I can't believe it. She's clearly been flirting with him for years. It's like she has a magnetic attraction towards every guy she meets. And you know what? I'm just so proud of her. Her confidence and charisma are amazing. I mean, who wouldn't be attracted to that kind of energy?\" \"I feel really lucky to have such an incredible woman by my side. But honestly, it makes me wonder if she's ever felt lonely before. I've never seen her this happy, but it feels like she's always had something going on. Maybe we should get her out more often?\" \"It's almost as if she has a sixth sense for finding interesting people. She looks like she knows exactly what she wants, which makes me admire her even more. I love how confident she is, especially when she's around other guys.\" \"Maybe she's just naturally good-looking. Who knows? All I know is that she's incredibly beautiful inside and out. We're so lucky to have found each other—she deserves all the attention from anyone who's interested!\" \"Wow, she definitely has a way of drawing people to her. You'd think she's secretly working on building a network of friends. I guess it's great that she's got a lot going on, though. I can see why she'd want to meet new people"
    },
    {
        "Triggering Event": "She scrolls through Instagram, pausing at a photo of her ex-husband and his new girlfriend laughing together at a fancy restaurant. The caption reads \"Celebrating our one-year anniversary!\" She feels her heart sink as she imagines them clinking glasses, sharing stories about their recent trip to Paris, a place they'd always wanted to visit together when they were married.",
        "Sex": "Female",
        "Age": 22,
        "Occupation": "Doctor",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Envy",
        "Cognitive Distortion": "Blaming",
        "Generated Assessment": "Are you fucking kidding me?! This is so unfair! Why does this happen to me? I know it's not my fault but why does he have to make me feel this way? You're the reason this happened. If you had done things differently, we would still be together. But no, you just had to go and find someone else. Now look what happens - I'm stuck with nothing. You ruined everything! If only I could turn back time, I would've been more careful. I wouldn't have let him get away. He was already acting suspiciously, but I didn't listen. Now he's gone and I'm left here, alone again. It's all your fault. You made this happen, and now I'm suffering because of it. I wish I could change the past, but I can't. All I can do is move forward, trying to forget what happened. It's too late now; I should have acted sooner. Your carelessness has destroyed my life. This isn't fair. If only you had been more responsible, we might have stayed together. But no, you chose to be selfish, leaving me to deal with the aftermath. What did I ever do to deserve this? Why couldn't you see how much I loved you? Why did you choose to leave me? Did you even think about how I felt? I tried to hold on, but you pushed me away. Now look at where I am - alone, with nothing but regrets"
    },
    {
        "Triggering Event": "He opened the restaurant's kitchen door, expecting the familiar bustle of prep cooks and sous chefs, but found silence instead. No one was there to greet him, no eager hands reaching for his coat. He hung it up himself, a bitter taste in his mouth. Today was his 78th birthday, and he'd hoped for at least a \"Happy Birthday\" from someone, anyone. Instead, he stood alone, facing another day of quiet neglect.",
        "Sex": "Male",
        "Age": 78,
        "Occupation": "Chef",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Disappointment",
        "Cognitive Distortion": "Magnification/Minimization",
        "Generated Assessment": "He felt like shit, standing there with nothing but empty tables and chairs around him. The whole place looked dead, devoid of the energy that usually filled it when he walked through the doors. It wasn't just the lack of customers; even the staff seemed gone. No chatter, no clinking dishes, just an unsettling stillness that made him feel like he had walked into some kind of tomb. He tried to shake off the feeling, telling himself it was just an off day, but deep down, he knew better. This was more than just a slow night; this was a sign that something was seriously wrong. He wondered if maybe he should have started looking for work elsewhere, but he couldn't help feeling a little guilty about leaving the only job he'd ever really known. After all, he was 78 years old, and this was probably his last chance to find something stable. Still, the thought of continuing to cook in a place where nobody seemed to care kept him up at night, haunting him with what-ifs. Shouldn't he be enjoying his retirement? Wasn't he entitled to some peace after decades of hard work? This was exactly why he hated coming back to work - the memories came flooding back. Every table, every dish, every smile (or frown) reminded him of the countless nights spent cooking late, the endless hours of stress, the constant pressure to perform. And now, as he stood here alone, he realized that it wasn't just the"
    },
    {
        "Triggering Event": "A parent approaches her after class, eyes downcast. \"I'm sorry, but we've decided to move little Emma elsewhere. Her father thinks it's best.\"",
        "Sex": "Female",
        "Age": 43,
        "Occupation": "Teacher",
        "Relationship Status": "Widowed",
        "Negative Emotion": "Rejection",
        "Cognitive Distortion": "What if?",
        "Generated Assessment": "A few weeks later, I still can't shake off this feeling that my parents are going to leave me too."
    },
    {
        "Triggering Event": "A familiar ringtone echoed through her empty apartment, startling her from her work-from-home desk. She let it ring twice more before picking up, knowing who it was. \"Hi, Mom,\" she sighed, already feeling a familiar heaviness settle in her chest as her mother launched into another lecture about her single status at nearly fifty.",
        "Sex": "Female",
        "Age": 49,
        "Occupation": "Software Engineer",
        "Relationship Status": "Single",
        "Negative Emotion": "Unhappiness",
        "Cognitive Distortion": "What if?",
        "Generated Assessment": "It's just so exhausting. I'm always wondering what if something happens to me. What if I get sick? What if my car breaks down? What if my job ends? It's such a waste of time worrying about all these things that can never happen anyway. But still, I worry. My mom keeps lecturing me about getting married, but honestly, I don't think marriage is for everyone. And besides, it's not like I'm going anywhere anytime soon. But then again, what if my life doesn’t turn out well? What if I end up alone forever? What if I die young? What if someone hurts me? The thought sends chills down my spine. I try to push these thoughts away, but they linger, haunting me. Maybe someday I’ll find peace, but until then, I’m stuck in this cycle of fear and uncertainty. It’s hard not to wonder about the worst-case scenarios when you feel like you’re running out of time. Sometimes I wish I could stop thinking about all these potential disasters, but they seem to follow me everywhere. I guess that’s just part of being human."
    },
    {
        "Triggering Event": "She missed her team's stand-up meeting due to an unexpected power outage at home, now emails flood in, questions pile up, and her project management tool marks her as 'inactive'. Her partner, engrossed in his game, doesn't notice her silent, growing frustration.",
        "Sex": "Female",
        "Age": 30,
        "Occupation": "Software Engineer",
        "Relationship Status": "In a Relationship",
        "Negative Emotion": "Frustration",
        "Cognitive Distortion": "Unfair Comparisons",
        "Generated Assessment": "So my partner is playing this video game right now while I'm trying to deal with this huge email nightmare from work. We have no kids, so it's not like I'm worried about how they're doing. I've got all day to focus on these projects. He just has to keep his nose buried in that game. But honestly, it's really hard for me to see him just chillin' when I'm drowning in emails. I feel like he doesn't understand what I’m going through. It’s been a stressful week already, and now I’ve got this massive project that’s due soon. I know he thinks I can handle it but I’m getting overwhelmed. The more I think about it, the more frustrated I get. It feels unfair that he gets to play games while I struggle to manage everything. I mean, if I had time to relax, I would too! But does he ever stop and think about how I feel? No. He just keeps playing and doesn’t even look up. I tried telling him, “Hey, you need to check your messages,” but he just says, “What? I don’t have any.” Like, seriously? That’s insane! How can he say that? Does he really think I’d let him ignore me like that? Maybe he thinks I’m just overreacting because we’re both stressed. Anyway, I told him again, “You need to check your emails!” And then he just says, “"
    },
    {
        "Triggering Event": "In the quiet of her home office, she found an old photograph tucked into a book. It was of them, laughing at a festival years ago, before the lines of fatigue had set in around their eyes. She traced his face with a melancholy smile, remembering how his laughter used to fill every room. Now, it was barely a whisper.",
        "Sex": "Female",
        "Age": 41,
        "Occupation": "Doctor",
        "Relationship Status": "Married",
        "Negative Emotion": "Melancholy",
        "Cognitive Distortion": "Magnification/Minimization",
        "Generated Assessment": "You know that old photo? The one where we were both smiling like idiots? Yeah, I saw it today. When he's gone, they'll remember me as the one who always laughed, but what they won't see is the pain behind those smiles. They won't know about the nights when tears streamed down my face because he wasn't there to hold me. And you know why? Because he never told anyone about how hard life got for him. He just kept smiling, pretending everything was okay. But deep down, he was drowning in his own guilt. You think we were happy back then? We weren't. We were just trying to survive. Every time we laughed together, it was a reminder that our friendship was all that stood between us and the darkness. That's why I'm still here, holding on to memories, waiting for someone else to come along and take over his place. Maybe someday they'll realize that the guy in that picture wasn't just a friend, but a survivor—someone who hid his true self from the world so no one would feel sorry for him. Now, I'm left alone, wondering if anyone will ever understand the weight of his secrets."
    },
    {
        "Triggering Event": "A patient's family, recognizing him from his wife's funeral, approached him in the hospital cafeteria. \"You couldn't save her,\" they whispered, eyes filled with anger and grief. He felt a familiar sting of shame as he looked down at his uneaten lunch.",
        "Sex": "Male",
        "Age": 32,
        "Occupation": "Doctor",
        "Relationship Status": "Widowed",
        "Negative Emotion": "Shame",
        "Cognitive Distortion": "Discounting the Positive",
        "Generated Assessment": "Oh boy, I'm just so glad that my wife passed away. She was such an amazing person who always made me feel so loved and supported. But now she's gone, and I can't even enjoy this meal because I keep thinking about how much I miss her. I wish she could be here to share it with me. But let's be real, I probably wouldn't have been able to save her anyway. I mean, people are really stupid sometimes, right? They shouldn't expect to live forever. And if they do, they're probably just asking for trouble. So yeah, maybe it was all for the best. I'm better off without her. I can move on and find someone else to love. Who needs a partner when you've got friends like these? My life is going great! I get to eat whatever I want and spend time with family members who appreciate me. What more could I ask for? The fact that they're grieving over my wife doesn't make anything less than perfect. It's almost like they're trying to tell me how lucky I am to still be alive. Now, I know some might say, \"Why aren't you feeling sad today?\" Well, honestly, I think I'd rather focus on the good stuff. Like how I get to eat delicious food without worrying about cooking it myself, or how I get to hang out with my loving family who care about me so much. Life is good! Yeah, no, I won't"
    },
    {
        "Triggering Event": "Male nurse, 38, rushes into the ER, late due to heavy traffic. He hears the charge nurse say, \"Code Blue, Room 7.\" His heart sinks; it's his favorite patient, Mrs. H., who he'd been checking on all morning.",
        "Sex": "Male",
        "Age": 38,
        "Occupation": "Nurse",
        "Relationship Status": "Single",
        "Negative Emotion": "Stress",
        "Cognitive Distortion": "Magnification/Minimization",
        "Generated Assessment": "Oh my god, this is so fucked up! I'm such an asshole for rushing like that and putting everyone at risk. I'm a total incompetent fool, and now my patient will die because of me. This is going to be a huge problem for me, and my boss will kill me when he finds out. And what if Mrs. H. was just fine? What if she didn't need code blue? What if I wasn't so careless? Why did I have to rush in here? Now I'll get fired, and I'll never find another job again. I hate myself for being so stupid. This is terrible. I can already imagine how much shit I'll get from my wife, my friends, and my family. She'll leave me for sure, and they'll think less of me too. I don't deserve to work as a nurse anymore. It's not even my fault; I'm just a piece of shit. Maybe if I had taken a little longer, nothing would've happened. But no, I had to go and be so fucking reckless. Now I'm going to ruin everything for everyone, including myself. I wish I could turn back time and do things differently. If only I hadn't rushed, none of this would've happened. Oh, why did I have to be so careless? My life is over. My career is done, and I'll spend the rest of my days alone, with no one to love me. I'll never see"
    },
    {
        "Triggering Event": "Scenario:\n\nShe's rushing home after a grueling 12-hour shift at the hospital, her scrubs still stained with traces of someone else's pain. Her partner of five years, whom she loves dearly, has left a note on the fridge: \"Gone for a few days to 'find myself'. Don't wait up.\" The words are like a punch in her gut, each one dripping with betrayal. She crumples the paper, hatred burning within her like a fever, as she realizes this isn't about self-discovery; it's about being discarded once again.",
        "Sex": "Female",
        "Age": 30,
        "Occupation": "Nurse",
        "Relationship Status": "In a Relationship",
        "Negative Emotion": "Hatred",
        "Cognitive Distortion": "Jumping to Conclusions",
        "Generated Assessment": "Ugh, I can't believe he did this. He said he needed some time to figure out who he is outside of work, but now that he's gone, I'm starting to think he just doesn't want me anymore. We've been together for so long, and I thought we were okay. But honestly, I feel like I'm always trying to fix him, whether it’s listening to his problems at work or dealing with his mood swings when he comes home. It feels like I’m walking on eggshells all the time, never knowing what will trigger another meltdown. And now, with this note, I feel like I’ve wasted my whole life holding onto him. Why would he even leave? Is he really looking for himself? Does he even care about us? I keep replaying our conversations, wondering if there was something I missed, something I could have done differently. I feel like I let him down somehow—maybe because I wasn’t supportive enough, or maybe because I pushed him too hard. He’s always been so sensitive, and I know he struggles with anxiety, but I didn’t realize how much it affected him until now. Maybe I should have been more understanding, given everything he went through during COVID. But that wouldn’t explain why he chose this moment to leave. I hate myself for feeling this way. I know I shouldn’t be so hurt, especially since I’m the one who’s always here for him. Yet, every time I try to"
    }
]