[
    {
        "Triggering Event": "After 45 years of service, Officer John was looking forward to his retirement party. He had invited his long-time partner, Jim, who had been like a brother to him. But as he scanned the room filled with colleagues and friends, he noticed that Jim's chair remained empty. His wife leaned over and whispered that Jim hadn't arrived yet, but she didn't know why. John felt a sinking disappointment in his chest as the cake was cut without Jim there to celebrate with him.",
        "Sex": "Male",
        "Age": 71,
        "Occupation": "Police Officer",
        "Relationship Status": "In a Relationship",
        "Negative Emotion": "Disappointment",
        "Cognitive Distortion": "Discounting the Positive",
        "Generated Assessment": "Wow, I guess this is it for me. They really didn't make a big deal about my last day, did they? I mean, I'm leaving, so what's the point? I can't believe all those people are here to say goodbye. I wasn't even supposed to be back today. I just wanted some time alone, but no, everyone had to drag me out of bed. And now I have to sit through all this. It feels like I'm being forced into something I don't want to be a part of. I wonder if anyone actually cares about me or if they're just doing this because they feel obligated. My boss is probably just relieved to see me go, which makes me question whether I've ever really meant anything around here. This whole thing feels like a waste of time. Why do I need to spend another hour going through old memories when I could just leave and move on? It's pointless; nobody really wants me anymore anyway. I might as well just skip it and forget the whole experience. At least then I won't have to pretend to enjoy myself while secretly feeling miserable inside."
    },
    {
        "Triggering Event": "She returned home from another grueling 12-hour shift at the hospital to find the lights flickering and the front door slightly ajar. Inside, her ex-husband was sprawled on the couch, a half-empty bottle of whiskey beside him, snoring loudly. She felt her blood boil as she recalled the restraining order she'd taken out after his last drunken episode.",
        "Sex": "Female",
        "Age": 35,
        "Occupation": "Doctor",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Anger",
        "Cognitive Distortion": "Blaming",
        "Generated Assessment": "\"Are you fucking kidding me?! My apartment looks like shit! I can't even see across the room because there's so much crap everywhere. And don't even get me started on the state of our bedroom - it's like a war zone. You're still living here? What are you, homeless now? I swear, every time I come home from work, this place is a mess. It's like you have no respect for me or our relationship. I've asked you multiple times to clean up your shit, but you just ignore me. I feel so frustrated and disrespected. This isn't just about cleaning; it's about how you treat me and our life together.\""
    },
    {
        "Triggering Event": "A male chef, 25, widowed, felt humiliation when he overheard diners at his restaurant laughing loudly about his wife's favorite dish, which he'd taken off the menu after her passing. \"Is that what they're serving now?\" one patron mocked, holding up a half-eaten plate.",
        "Sex": "Male",
        "Age": 25,
        "Occupation": "Chef",
        "Relationship Status": "Widowed",
        "Negative Emotion": "Humiliation",
        "Cognitive Distortion": "Should Statements",
        "Generated Assessment": "So yeah, my wife was super into this soup, like we were always talking about it before she died and stuff. I know she loved it, so when she passed away, I figured it would be nice to put it back on the menu for everyone else who liked it, you know? But then these guys come in and start making fun of me right in front of other customers. Like, I get it, maybe I didn't explain it well enough, but I'm trying here! And the worst part is, they're laughing at me, saying things like, \"Yeah, let's see if our new husband can cook.\" Are you kidding me?! It feels like they think I'm doing this because I'm some kind of loser who can't even keep his wife's memory alive. I mean, come on, it's just soup! But no, apparently, I need to make sure everything is perfect, and if something goes wrong, it's all my fault. If I don't get an A+, I shouldn't even have an F. Yeah, right. If someone messes up and gets an F, they should *just* magically become a genius overnight? Please. It doesn't work that way. So why does everyone expect me to be flawless? Why am I held to such high standards? You know what? Life isn’t all sunshine and rainbows. Sometimes things go wrong, and sometimes you just have to deal with it. I wish people could understand that"
    },
    {
        "Triggering Event": "He found her favorite recipe tucked between the pages of his cookbook, yellowed and worn from years of use. The guilt tightened around him like a noose as he remembered her smile when she'd taught him how to make it. He'd been too busy to learn properly; now he was left with only this faded echo of her love.",
        "Sex": "Male",
        "Age": 23,
        "Occupation": "Chef",
        "Relationship Status": "Widowed",
        "Negative Emotion": "Guilt",
        "Cognitive Distortion": "Emotional Reasoning",
        "Generated Assessment": "It's just that... I don't know if you can understand this, but there are moments where your mind gets so caught up in what it feels that it starts to distort everything. It's like your brain is trying to protect you from feeling pain by twisting the truth. That's all it does - it tries to shield you. But sometimes it goes too far, and you end up believing things that aren’t even true. You start seeing things through the lens of how you feel, rather than looking at reality honestly. Like, remember when we were talking about our feelings? I told you something that made me feel really bad, and then you said some stuff back that seemed to agree with me, almost as if you felt the same way. But was that really what happened? Or was it just my emotions telling me that? Sometimes, it's hard to tell. My mind just wants to keep me safe, and it makes these little jumps in logic that aren’t always accurate. It’s like my brain is trying to cover itself with a blanket of comfort, even if it means distorting the truth a bit. And then there was the other day, when I saw an old photo of us together. I thought it would be nice to share that with you, but instead, you got upset. I didn’t mean to hurt you, but somehow, my actions came off as insensitive. Now, I’m starting to think that maybe you’re right, and I did say something wrong."
    },
    {
        "Triggering Event": "A customer, visibly upset and clutching a receipt, approaches her at the register. \"This isn't what I bought,\" she says, eyes welling up. She looks familiar, like a regular. The woman's voice wavers, \"I can't afford to lose this much.\"",
        "Sex": "Female",
        "Age": 30,
        "Occupation": "Retail Worker",
        "Relationship Status": "Single",
        "Negative Emotion": "Guilt",
        "Cognitive Distortion": "Jumping to Conclusions",
        "Generated Assessment": "\"I'm sorry but you didn't pay for it. You're going to have to call your bank. They will be able to tell you why they charged you.\""
    },
    {
        "Triggering Event": "He woke up to an empty bed, the sheets still warm from her side. The clock read 6:30 AM. She was always up before him, but today, there was no faint hum of the coffee maker, no distant rustle of newspaper pages turning. He found a note on the kitchen counter, neat and precise - \"Gone for a walk. Back soon.\" That was three hours ago.",
        "Sex": "Male",
        "Age": 65,
        "Occupation": "Police Officer",
        "Relationship Status": "Married",
        "Negative Emotion": "Neglect",
        "Cognitive Distortion": "Blaming",
        "Generated Assessment": "He felt a mix of frustration and relief. Frustration at the sudden absence, while relief that she had chosen to leave instead of staying. It wasn't like they'd argued about it; he just assumed she would wake up whenever she pleased. But now, as he lay in bed, he couldn't shake off the feeling that she had abandoned him. It seemed so abrupt, so... careless. She must have gotten bored with him, or worse, realized she didn't need him anymore. He thought back to their fights over the past few weeks - the constant disagreements about little things, the strain on their relationship. Maybe she saw it as too much effort to stay when it all seemed to be slipping away. He wondered if he could ever get back to where they used to be, but the thought left him feeling hopeless. He felt like he couldn't even begin to fix this situation because she had already gone. This time, she was the one who chose to disappear."
    },
    {
        "Triggering Event": "She woke up to an email from her ex-husband, asking if she'd seen their daughter's latest report card. The subject line read: \"We need to talk about Lily.\"",
        "Sex": "Female",
        "Age": 41,
        "Occupation": "Software Engineer",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Worry",
        "Cognitive Distortion": "Emotional Reasoning",
        "Generated Assessment": "What the fuck? That's such a low move. I don't care what he wants to talk about. He needs to understand that we're done with him and his family. If he thinks he can just come back into our lives like nothing happened, then he's fucking delusional. This is all because he couldn't handle being single for so long, so now he tries to get back in by trying to control our daughter. But it won't work. We've moved on, and there's no going back. He has to respect our boundaries. But why does he have to be so fucking insensitive? Doesn't he realize how much pain he caused us during the divorce? How could he even think he can just waltz back into our lives after everything he put us through? And what's with this email? Can't he see that we're busy building new lives? Why would he send something like that at 6 am on a Tuesday? It's clear he doesn't give a shit about our feelings or well-being. This is just another example of his shitty behavior. Lily deserves better than someone who thinks they can manipulate her like that. She needs people who truly care about her, not some selfish piece of shit like her father. He needs to stop thinking he can control our daughter. If he keeps pushing, we'll make sure Lily knows exactly how toxic and abusive he was. No one will ever believe his lies again, especially since we have proof of everything"
    },
    {
        "Triggering Event": "He paused, paintbrush dripping, as the gallery owner hung up her phone. She looked at him, apology in her eyes, \"I'm sorry, they've decided to feature John's work this season instead.\" His grip tightened on the brush, splattering red onto the canvas, onto his hand - a stark contrast to the cold indifference of the art world that had once celebrated him, now casting him aside for a younger, fresher talent.",
        "Sex": "Male",
        "Age": 46,
        "Occupation": "Artist",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Spite",
        "Cognitive Distortion": "All or Nothing Thinking",
        "Generated Assessment": "\"Oh my god, he was literally painting the entire room with blood. I felt like he was going to rip out the walls and just leave everything there. It was insane. They were trying to make it seem so...so much better than what happened, but it didn't feel right. The whole thing seemed so fake. Like, he wasn't even there! What is wrong with these people? Do you know how many years he spent building that studio? All of those late nights, all of those early mornings? And then he gets left out because some 25-year-old kid with a pretty face comes along and steals his spotlight. The worst part is, they're making it look like he was okay with it, like he never cared about the project. That's such a lie.\" --- #Edit Here’s another one: He kept saying how he’d ‘never speak to’ his former friend again after being cut from the show. I couldn’t believe how dramatic it all sounded. To me, it was clear that he was just upset because someone else got the opportunity he did. He never wanted anyone to think he was jealous; it just came off as whiny. In reality, I thought he was probably relieved to be free of the pressure. Maybe if he hadn’t been so hard on himself, he wouldn’t have let it get to him. #Edit 2: Another one: It really bugged me when he said he'd never go back to the same studio"
    },
    {
        "Triggering Event": "He found his wife's medication untouched in the bathroom cabinet, her breakfast plate still full when he left for his shift at 7 AM.",
        "Sex": "Male",
        "Age": 79,
        "Occupation": "Police Officer",
        "Relationship Status": "In a Relationship",
        "Negative Emotion": "Worry",
        "Cognitive Distortion": "Jumping to Conclusions",
        "Generated Assessment": "Ugh... I can't even think straight anymore. My head is spinning. I don't know what to believe right now. I'm just so confused. Why did she leave that there? It makes me think something terrible happened, but why would she do that if it was an accident? If she did it by mistake, then why didn't she refill it? Or maybe she was trying to get rid of it because she took too much? That doesn't make sense either. She wouldn't do that. We've talked about how we need to avoid overdosing together, remember? But what if this is all part of some elaborate plan? Maybe she was planning to go out and buy new meds? But where is her purse? And why wasn't she leaving early like usual? Did she have a secret meeting with someone? Maybe she was planning to meet someone in the middle of the night? Like that guy who came over last time. He had a weird look on his face. Maybe they were making plans to run away together. Oh my god, what if she's gone? What if she left us behind? Why didn't I see anything suspicious? Why couldn't I catch her sneaking around? Did she really take off during work hours? How could she? She always leaves early when she has appointments. So why now? Was it a surprise visit? Who could she be seeing? Is she having an affair? Does she want to divorce me? Am I not enough"
    },
    {
        "Triggering Event": "Scenario:\n\nDr. A wakes up to an empty house. Her husband, who usually gets her morning coffee, hasn't stirred from their bedroom yet. She looks at his side of the bed, still untouched since last night's argument over their grandchild's health. The silence is deafening.",
        "Sex": "Female",
        "Age": 77,
        "Occupation": "Doctor",
        "Relationship Status": "Married",
        "Negative Emotion": "Loneliness",
        "Cognitive Distortion": "Mental Filter",
        "Generated Assessment": "Oh my god, he's still sleeping? He always makes me my morning coffee before he leaves for work. I'm so tired today, but this just pisses me off. I know we've been fighting about this stupid thing, and it's like he doesn't even care that our kid is sick. I tried explaining how stressed out I am, and he just keeps saying \"we'll figure it out.\" Figure what the fuck out? It's not easy being a single mom while working full-time! I have no time for him to take care of our daughter. I guess I'm too much to handle, huh? And now he's just lying there, snoring away like nothing is wrong? What does he think, that everything will magically fix itself? That I'm going to wake up with a smile on my face because he's sleeping peacefully? Well, let me tell you, I don't get paid enough to deal with this shit. If he wants to sleep all day, maybe he can pay me overtime. This isn't the first time he's slept through my problems; I swear, every time I try to talk to him, he just rolls over and pretends he didn't hear me. Like, hello, I need help here! You're supposed to be my partner, not some fucking pillow! This is getting ridiculous. I hope he realizes soon that he needs to step up and start helping instead of just sleeping. He thinks he can just ignore my stress and"
    }
]