[
    {
        "Triggering Event": "He's always been the fucking golden boy. Perfect goddamn job, perfect fucking house, perfect fucking family. And now he's rubbing it in my face, again.\n\nI'm sitting here, in this cramped, shitty office, staring at lines of code that won't behave, and he's sending me another fucking email about his weekend getaway to the lake with his goddamn wife and kids. Sunsets, fishing trips, laughing around a campfire. Meanwhile, I'm stuck here, divorced, alone, working late on a Saturday because my boss doesn't give a fuck.\n\nI can feel it boiling inside me. That green-eyed monster clawing at my insides. Why the hell does he get all that, and I'm stuck with... this? This goddamn job, this empty apartment, these fucking lonely weekends.\n\nI want to scream, to smash something. But all I do is pound out a reply email, keeping it professional, fucking polite even. Because that's what I always do. Swallow my envy, swallow my rage, and just keep fucking swimming.\n\nBut not today. Today, I'm forwarding his fucking email to the entire office. Let them see what they're missing while they're stuck here with me. And maybe, just maybe, they'll feel a little envious too. Fuck him and his perfect life.",
        "Sex": "Male",
        "Age": 48,
        "Occupation": "Software Engineer",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Envy",
        "Cognitive Distortion": "Jumping to Conclusions",
        "Generated Assessment": "**Me:** \"Oh wow, look at that! Lake house, fishing trips, 'quality time' with the fam. Must be nice, huh? I mean, who needs a life when you can just snap your fingers and have it all, right? Typical fucking Tom, always showing off his perfect little world. I bet they even have a goddamn golden retriever running around, fetching sticks while they sip their lattes. Pfft, fuck that shit.\""
    },
    {
        "Triggering Event": "In the sterile silence of her home office, Margaret's fingers danced over the keyboard in a rhythm as fraught as her mind. Every tap echoed like a gunshot in the emptiness around her, each click punctuating the gnawing resentment that had taken residence in her chest.\n\nHer husband, Tom, was supposed to be setting up their dinner date tonight. He'd promised, after all these years of her cooking every night. Yet here she was, at 7:15 PM, still hunched over her laptop, the screen saver mocking her with its idle countdown. She could feel the heat rising in her cheeks, her breath growing shallow.\n\nShe picked up her phone, dialed Tom's number with trembling hands. It rang once, twice, thrice before switching to voicemail. His voice, that familiar baritone she loved, now grated on her nerves like nails on a chalkboard. \"You've reached Tom. I can't take your call right now...\"\n\nMargaret threw the phone onto the couch, where it bounced and landed face down. She could feel the resentment bubbling over, threatening to spill into something uglier. She was tired of being taken for granted, tired of her life being dictated by a man who seemed to have forgotten his promises.\n\nShe stormed out of her office, her heels clicking loudly on the hardwood floor, each step echoing her resolve. As she reached the kitchen, she saw it - the dinner table set for one, Tom's half-eaten plate of food, and a note propped against the wine glass.\n\n\"Ran into Jack at the store. We grabbed a bite. Will be home late. Love you!\"\n\nMargaret felt the resentment surge like a tidal wave, drowning out any rational thought. She picked up his plate, her hands shaking with anger, and dumped it into the trash can with a satisfying clatter. Then she stormed back to her office, leaving the note untouched on the table, a silent testament to her husband's thoughtlessness.\n\nThat night, Margaret didn't sleep. Instead, she spent hours updating their shared calendar, adding reminders for Tom about upcoming anniversaries, birthdays, and dates he'd promised but seemed to have forgotten. Each tap of the keyboard felt like a victory, each reminder a stake driven into the heart of her resentment. She wouldn't be his silent, forgotten wife anymore. Not tonight. Not ever again.",
        "Sex": "Female",
        "Age": 61,
        "Occupation": "Software Engineer",
        "Relationship Status": "Married",
        "Negative Emotion": "Resentment",
        "Cognitive Distortion": "Mind Reading",
        "Generated Assessment": "**Writing Prompt:**\nImagine you're Margaret, sitting at your desk, phone in hand, as Tom's voicemail kicks in. You've been feeling resentful all day, and now this. Write down what's going through your mind right now.\n\n---\n\n**Margaret's Thoughts:**\n\n*Oh God, he can't even bother to pick up. He knows I'm calling, he knows I'm waiting for him to set up dinner... but no, he's too busy with Jack or whoever.*\n\n*I mean, come on, it's not like he doesn't know how much I hate being stood up like this. Every night it's the same thing - me slaving over a hot stove while he's out having fun without me.*\n\n*He thinks I'm just gonna sit here and wait, like some kind of fool? He must think I'm so stupid, so patient... Well, not tonight. I won't be his little wifey anymore.*\n\n*I can practically hear him laughing with Jack about how 'poor Margaret' is waiting at home. They probably don't even care that they've ruined our dinner plans again.*\n\n*Maybe if he'd just think for a second before acting so selfishly, maybe then we wouldn't be in this mess. But no, Tom always knows best.*"
    },
    {
        "Triggering Event": "In the grimy kitchen of his old apartment, Henry slammed a cabinet door so hard it rattled the dishes within. His eyes darted around the room, landing on nothing in particular. He was alone, as always.\n\n\"Where are they?\" he muttered, pacing like a caged animal. \"They said they'd come by today!\"\n\nHenry, a man of 75 with skin worn thin by time and worry, had once been a nurse, caring for others with a tender hand. Now, his only companions were the ghosts of patients past and the silence that echoed through his empty home.\n\nHis phone buzzed on the counter. A message from his daughter, Sarah. He snatched it up, fingers trembling. \"Running late. Be there soon.\"\n\n\"Late?\" Henry spat, veins bulging in his neck. \"Late? They've been 'late' for my life!\"\n\nHe slumped into a chair, eyes welling with unshed tears. His ex-wife had taken the kids when he'd been at his lowest, and now they only visited on their terms. He felt like an afterthought, a nuisance.\n\nHenry's gaze fell upon the faded photo of him in his scrubs, smiling beside a patient. \"They don't understand,\" he whispered to the ghostly figures. \"I gave my life to others. Where are they now?\"\n\nThe clock ticked on, each second echoing like a gunshot in Henry's heart. He felt the familiar sting of neglect, festering like an old wound. His breaths came in ragged gasps, anger and sadness warring within him.\n\nFinally, the doorbell rang. Henry stood, smoothing his shirt, trying to compose himself. But as he opened the door, he saw only a delivery man holding a box.\n\n\"No visitors today,\" the man said, gruffly. \"Just this package.\"\n\nHenry took it, fingers tightening around the cardboard until they were white. He watched the man leave, then closed the door softly, his anger simmering like a pot left too long on the stove.",
        "Sex": "Male",
        "Age": 75,
        "Occupation": "Nurse",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Neglect",
        "Cognitive Distortion": "Mental Filter",
        "Generated Assessment": "Henry's eyes landed on the clock. 12:03 PM. \"Three minutes late,\" he growled, slamming his fist on the table. \"Un-fucking-believable.\" He refused to acknowledge the sun streaming through the windows, or the birdsong outside. All he saw was red, all he felt was betrayal. The ticking clock might as well have been a countdown to an explosion in Henry's mind. Anything that didn't fit his narrow focus - the chipped paint on the cabinets, the dust dancing in the light, the warmth of the sun on his back - was invisible. It was always about them, always about their tardiness. Never mind the years he'd spent waiting for them to notice him again, really notice him. His heart pounded like a drumbeat, echoing the same refrain: \"Late. Late. Late.\""
    },
    {
        "Triggering Event": "In the grimy studio he'd once shared with her, now his alone, he stared at the half-finished canvas. Three years since the divorce, but every fucking brushstroke still echoed with her laughter. He could hear it, goddammit, like a ghost haunting his ears. She'd loved watching him work, her eyes dancing with pride and something else... amusement? Pity?\n\nHis fist clenched around the paintbrush, squeezing until the bristles snapped off into the palette. Jesus Christ, he thought, I was never enough for her. Not the artist she wanted me to be. Not the man.\n\nHe hurled the mutilated brush across the room. It thudded against the wall, leaving a splatter of blue and red - their wedding colors. Fucking ironic, ain't it? He slumped onto an old stool, elbows on knees, head in hands. Regret clawed at his insides like a starving animal.\n\nThe phone rang. Her number flashed on the caller ID. He let it ring out, listened to her voicemail click in. \"Hey,\" she said, voice soft as always, \"I just wanted... never mind. Call me back if you want.\" Bullshit, he thought. She'd never just wanted anything.\n\nHe picked up a tube of cadmium yellow, squeezed until paint oozed out like pus from an infected wound. He smeared it onto the canvas, mixing it with old blues and reds, trying to drown out their memories together. But every stroke felt like betrayal, each color a lie.\n\nHis reflection stared back at him from the window, face contorted in anger, eyes glistening with unshed tears. \"Fuck you,\" he spat at the image. \"Fuck you both.\"",
        "Sex": "Male",
        "Age": 37,
        "Occupation": "Artist",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Regret",
        "Cognitive Distortion": "Mind Reading",
        "Generated Assessment": "He couldn't shake the feeling that she was laughing at him, even now when there was no one else around. Her voice on the voicemail sounded too damn smug, like she knew something he didn't. Like she could see right through him, into his fucking soul where all the ugly truths were hiding.\n\n\"Never mind,\" my ass, he muttered to himself, scrubbing at a stain of blue on his thumb with a rag. She'd always been good at that, dropping hints like they were breadcrumbs leading him straight into her trap. He could practically hear her thoughts echoing in his head, \"You're not trying hard enough, darling. You're not the artist you think you are.\"\n\nHe tossed the rag aside, picked up a tube of black paint. If she thought she knew him so well, then maybe he'd give her something to really look at. He squeezed out a fat line of darkness onto the canvas, letting it snake across their shared history like a fucking omen.\n\nBut even as he painted, he couldn't silence that little voice in his head, her voice whispering, \"You're doing it all wrong.\" And goddammit, he believed her. Even when she wasn't there to say it out loud."
    },
    {
        "Triggering Event": "In the sterile quiet of the ward, Henry, a nurse of 47 years, stood over Mrs. Thompson's bed. Her breath rattled like distant thunder, each inhale a desperate gasp, each exhale a sigh of relief that it happened at all. The machines beeped their steady rhythm, but Henry knew better than to trust them. He'd seen too many hearts stop in sync with those damn machines.\n\nHe'd called the doctor thrice already, but no one was answering. It was like shouting into an empty well. He felt his grip tighten on the clipboard, knuckles whitening. This wasn't right. Mrs. Thompson deserved better than this slow suffocation. She deserved to die with dignity, not like a fish flopping on the deck of a boat.\n\nHenry's eyes darted around the room, searching for something, anything, that could help. But it was useless. He was useless. His hands, once steady and sure, now trembled as he reached out to adjust her oxygen mask. It slipped from his grasp, clattering onto the floor like a accusations. He couldn't even keep his hands steady anymore.\n\nHe tried again, picking up the phone receiver with a shaking hand. It rang and rang, echoing his own futility. No answer. Again. He slammed it down, the plastic casing cracking under his fury. He was a nurse, dammit! He'd devoted his life to this, and now he stood helpless while a woman fought for every breath.\n\nHenry felt the tears threaten, but he pushed them back. Crying wouldn't help Mrs. Thompson. But maybe, just maybe, it would give him an outlet for this helplessness that was eating him alive. He sank into the chair beside her bed, his body sagging like a deflated balloon. This wasn't how it was supposed to be. This wasn't right. And he couldn't do anything about it. Nothing at all.",
        "Sex": "Male",
        "Age": 73,
        "Occupation": "Nurse",
        "Relationship Status": "Single",
        "Negative Emotion": "Helplessness",
        "Cognitive Distortion": "Emotional Reasoning",
        "Generated Assessment": "Henry picked up the phone, his thumb already dialing Dr. Patel's extension before he could even think about it. Again. Three times the charm, right? But nope, still no answer. Typical. The universe was clearly conspiring against him today.\n\nHe slammed the receiver down harder than intended, cracking the plastic. \"Oops,\" he muttered, not feeling the slightest bit apologetic. It wasn't like the stupid phone could feel his pain anyway.\n\nHis eyes flicked back to Mrs. Thompson, her breaths still ragged and desperate. She looked like a fish out of water, gasping for air that wasn't there. It was horrible. Absolutely fucking horrible. And Henry felt it all, every ounce of her struggle resonating in him like a damn symphony.\n\n\"Come on, doc,\" he muttered, his voice laced with more sarcasm than concern. \"I know you're out there, playing hide and seek with your pager. How about you come out and play with Mrs. Thompson's life instead?\"\n\nHe leaned back in the chair, arms crossed, and gave the ceiling a pointed look. \"You could at least pretend to care, universe. Just once.\""
    },
    {
        "Triggering Event": "In the hushed quiet of her kitchen, Martha fidgeted with her late husband's pocket watch, its ticking now a faint echo of his once steady heartbeat. The clock on the wall seemed to tick louder in response, each second stretching out like an eternity as she waited for her daughter, Emily, to call.\n\nIt had been three days since their last conversation, and Martha could feel worry creeping up her spine like ivy on an old wall. She knew Emily was busy with work - the new nursing job in the city kept her occupied from dawn till dusk - but still, three days felt like too long. What if something was wrong? What if Emily had forgotten to charge her phone again?\n\nMartha's hands trembled slightly as she reached for her own phone, the screen lighting up with a background image of Emily's graduation. She hesitated, then dialed Emily's number, her heart pounding in sync with the watch ticking away the seconds.\n\nWhen Emily finally answered, breathless and apologetic, Martha felt a wave of relief wash over her. But as they spoke, Martha caught herself checking the clock more often than usual, counting down the minutes until their call would end. She couldn't shake off this worry, this nagging feeling that something was amiss.\n\nAs she hung up, Martha looked at her husband's watch, its hands now pointing at 7:05. She sighed, feeling the weight of another sleepless night settling in. Her mind buzzed with worries, each one more vivid than the last, like a swarm of bees she couldn't silence. And so, under the soft glow of her bedroom lamp, Martha waited for dawn, her heart heavy with worry and her mind a whirlwind of anxious thoughts.",
        "Sex": "Female",
        "Age": 69,
        "Occupation": "Nurse",
        "Relationship Status": "Widowed",
        "Negative Emotion": "Worry",
        "Cognitive Distortion": "Jumping to Conclusions",
        "Generated Assessment": "Martha slammed her phone down on the kitchen counter, harder than she intended. \"Jesus Christ, Emily could've at least charged her damn phone!\" She paced around the room like a caged animal, hands gesturing wildly. \"Three days? Three fucking days without a call? I swear to god, if that girl forgot her phone again...\" Martha snatched up the pocket watch, glaring at it as if it were Emily's fault for not calling sooner. \"Typical of her to just assume I'll wait around like some desperate old woman.\" She muttered under her breath, anger simmering in her voice. \"I'm gonna give her five more minutes, then I swear... I'm calling the fucking cops or something.\""
    },
    {
        "Triggering Event": "Alright, listen up, 'cause I'm sick of this crap. Forty years in this business, ya think I'd see somethin' new? Nah, just more of the same old bull.\n\nSo there I was, at City Hall, waitin' for that clown mayor to make his big announcement. I been on my feet for hours, pushin' through the crowd, jostlin' for a spot up front. Finally, he shows up, late as always, and what does he do? He starts spoutin' off about some damn bike lane like it's the second coming.\n\nI'm tryin' to get his attention, shout out my question 'cause I know he's gonna skate around the real issues again. But no, he just gives me that condescending smile and says, \"Not now, Dave,\" like I'm some kinda kid interruptin' story time.\n\nI've had it up to here with these politicians thinkin' they can blow smoke in our faces and call it news. They're all the same, avoidin' the tough questions while we're out here fightin' for scraps.\n\nSo, I did what any frustrated journalist would do. I turned around, pushed through that crowd again, and marched straight back to my desk. Someone's gotta hold these clowns accountable, even if it means losin' my cool in front of the whole damn city hall.",
        "Sex": "Male",
        "Age": 58,
        "Occupation": "Journalist",
        "Relationship Status": "Single",
        "Negative Emotion": "Frustration",
        "Cognitive Distortion": "Fortune Telling",
        "Generated Assessment": "\"I'm tellin' ya, this is gonna be another waste of my time. I can just feel it in my bones. That smooth-talkin' mayor's gonna dodge my question like he does every damn year. And then what? I'll be stuck here, listenin' to him drone on about bike lanes while our city crumbles around us.\n\nYou know what they say about predictin', right? If you wanna make God laugh, tell him your plans. Well, I'm tellin' God right now, 'Here's my plan: I'm gonna stand here like an idiot while that clown avoids me again.' Ain't that a kicker?"
    },
    {
        "Triggering Event": "In the sterile silence of his lab, Dr. Alexander Hartley meticulously pipetted solution into test tubes, each one labeled with more numbers than a bingo card. It was 3 AM again, and the humdrum of the university had long since given way to the soft whir of equipment. His colleagues were tucked away in their cozy beds, dreaming of Nobel Prizes, while Alex was here, elbows deep in agar, proving once more that his life was as exciting as a Petri dish.\n\nSuddenly, the lab door creaked open. In stumbled Dr. Thompson, their shared supervisor, bleary-eyed and disheveled, like a well-dressed homeless person. He squinted at Alex through his spectacle-lens fog, then did a double-take that could've given a chameleon a run for its money.\n\n\"Hartley,\" he croaked, \"still here, aren't ya? Don't you have a life to neglect?\"\n\nAlex paused, pipette hovering mid-air. \"I do have a life, Thompson,\" he retorted, acid dripping from each syllable like liquid nitrogen on a puddle. \"It's just... temporarily... on hiatus.\"\n\nThompson snorted, shaking his head. \"You're like the lab rat that never leaves its maze. You know what? I'm promoting you.\" He slammed a post-it note onto Alex's bench, then shuffled out, leaving Alex staring at his own name scrawled in Thompson's chicken-scratch.\n\n\"Congratulations,\" Alex muttered to himself, crumpling the note and tossing it into the waste bin. \"You're now officially the lab rat with a title.\" He sighed, turning back to his experiment, the neglect palpable even in his own promotion. After all, what was one more duty when you were drowning under an ocean of them?",
        "Sex": "Male",
        "Age": 33,
        "Occupation": "Scientist",
        "Relationship Status": "Single",
        "Negative Emotion": "Neglect",
        "Cognitive Distortion": "Personalization",
        "Generated Assessment": "**Writing Prompt:**\nImagine you're Alex Hartley, a dedicated scientist who's been working tirelessly in your lab for weeks. Your supervisor, Dr. Thompson, barges in one night, takes one look at you and says, \"Hartley, still here, aren't ya? Don't you have a life to neglect?\" Then, he promotes you but leaves the note in such a way that seems half-assed or even insulting.\n\n**Alex's Reaction:**\n\n\"Well, isn't that just fucking fantastic,\" Alex muttered under his breath, staring at the crumpled post-it note in the waste bin. \"Thompson thinks he can waltz in here at goddamn 3 AM and act like I'm some sort of lab rat with a badge? Fuck him.\"\n\nHe paused, then added, \"I mean, who the hell does he think he is? He doesn't have to pull all-nighters like this. It's not like his life isn't already perfect - married, kids, a fucking house in the suburbs. He probably hasn't seen the inside of a lab past 6 PM in years.\"\n\nAlex shook his head, turning back to his experiment with renewed vigor. \"But oh no, Hartley has to be here, right? Because god forbid he actually does some work for once.\" He snorted, \"Well, fuck him and his promotion. I didn't ask for it, and I sure as hell don't need it.\"\n\nHe continued working, oblivious to the fact that Thompson's remark might have been a moment of observation, not criticism. After all, in Alex's mind, everything always revolved around him."
    },
    {
        "Triggering Event": "In the quiet hum of the hospital ward, where he'd spent most of his life, Albert found himself straightening the already neat rows of charts for the third time that hour. His hands trembled slightly, not from age, but from the venom simmering within him.\n\nHe hadn't expected to feel this way after all these years. Not towards her, not towards anyone. But there it was, bubbling up like a toxic spring, threatening to spill over at any moment. Vengefulness wasn't an emotion he'd felt in decades, not since that incident with the orderly who'd stolen from him. He'd been young then, foolish and hot-headed. He'd let it consume him, drive him to do things he wasn't proud of.\n\nBut this...this was different. This was cold, calculated. It was the email from his ex-wife, Martha, that had done it. After all these years, she finally wanted to reach out, apologize for what happened. As if an apology could undo the wreckage she'd caused, the life he'd been forced to live because of her betrayal.\n\nAlbert's mind raced back to that day, the day he found out about her affair. The way her voice wavered as she tried to explain, how her eyes darted away from his gaze. He could still feel the sting of it, like a fresh wound reopened after all these years.\n\nHe looked down at his hands, now gnarled with age and arthritis. They'd once been strong, capable. They'd held Martha's hand as they exchanged vows, cradled their daughter's head when she was born, cared for countless patients in this very hospital. But now...now they were just tools of vengeance, itching to dole out the punishment he felt she deserved.\n\nAlbert sighed, his breath coming out in a ragged whisper. He knew what he had to do. He couldn't let this anger fester, not again. He'd respond to her email, meet with her if that's what it took. But he wouldn't go alone. No, he'd bring the weight of his past with him, lay it all out for her to see.\n\nAnd maybe, just maybe, she'd understand why he could never forgive her.",
        "Sex": "Male",
        "Age": 68,
        "Occupation": "Nurse",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Vengefulness",
        "Cognitive Distortion": "Blaming",
        "Generated Assessment": "Albert sat down at his desk, the chair creaking softly under him like an old friend sharing a secret sigh. He stared at Martha's email, the cursor blinking mockingly at him, daring him to respond. His mind was a whirlwind of thoughts, each one more bitter than the last.\n\n*It's all her fault,* he thought, his fingers hovering over the keyboard. *If she hadn't been so selfish, so careless with our marriage, I wouldn't be feeling like this.*\n\nHe could feel the anger rising in him again, like bile in his throat. It wasn't fair, none of it was. He'd devoted himself to her, to their family, and look where it had gotten him. Alone, bitter, and twisted up inside with resentment.\n\n*She should have known better,* he thought, his fingers typing out the words before he could stop them. *She should have been stronger.*\n\nHe deleted the sentence, shaking his head. That wasn't right, wasn't fair. Martha was many things, but weak wasn't one of them. Not really. No, it wasn't her fault. It was...well, it was everyone else's.\n\n*The doctors, for not catching it sooner,* he thought, a familiar resentment welling up inside him. *The nurses, for gossiping about us behind our backs.* *The world, for spinning on without caring about the wreckage she left in her wake.*\n\nAlbert leaned back in his chair, his eyes scanning over the words he'd written but not really seeing them. He felt a strange sense of satisfaction, like he'd finally put something in its proper place. It wasn't him causing this storm inside him. No, it was everyone else. Everyone except Albert."
    },
    {
        "Triggering Event": "In the musty, cluttered studio that she called home, our middle-aged artist, Mildred, was putting the finishing touches on her latest masterpiece. A grotesque figure loomed large and lurid, a twisted reflection of her current mood - which wasn't saying much, considering her default emotional state was somewhere between 'dour' and 'misanthropic'. Suddenly, she heard it. A soft rustle, like paper being crumpled into a ball. She turned to find her pet ferret, Fuzzball, gleefully munching on the corner of her freshly painted canvas. Mildred sighed, \"Oh, for crying out loud, Fuzzball. It's not enough that I've got to live with your furry little face staring at me from every wall? Now you're eating my art too?\" She plucked the ferret off the canvas and plopped him into his plush bed. \"Honestly,\" she muttered, wiping her paint-stained hands on her overalls, \"I should have stuck to painting landscapes. At least they don't eat themselves.\"",
        "Sex": "Female",
        "Age": 53,
        "Occupation": "Artist",
        "Relationship Status": "Single",
        "Negative Emotion": "Disgust",
        "Cognitive Distortion": "Unfair Comparisons",
        "Generated Assessment": "Mildred tossed her paintbrush aside with a huff, surveying the damage Fuzzball had wrought upon her canvas. \"Great,\" she muttered, hands on hips, \"just great. Look at this mess. And here I was, thinking I might actually have something worth hanging in the gallery next month.\" She shook her head, eyes scanning the studio filled with her previous works - each one a testament to her 'unique' style, or so she'd been told by the local art critics who seemed to take pleasure in finding fault rather than appreciating her genius. \"At least Betty down the street has her perfect little watercolors that no one buys but everyone coos over,\" she grumbled, gesturing at a particularly vibrant piece of hers hung crookedly on the wall. \"And let's not forget dear old Albert and his sculpted marble masterpieces. No one understands him either, but at least they're shiny and expensive-looking.\" She sighed deeply, rubbing her temples. \"Why can't I be more like them? Why must my art be so...so...\" she waved her hand vaguely, \"so Mildred?\""
    }
]