[
    {
        "Triggering Event": "In his cluttered study, the seasoned journalist, Harold Worthington, sat slumped in his worn leather armchair, gazing at the framed photograph of him and his wife, Edna, taken during their last holiday together before her passing five years ago. His eyes, usually sharp as a hawk's, were glassy with unshed tears.\n\n\"Bloody hell,\" he muttered, picking up the vintage fountain pen she'd gifted him on their 40th wedding anniversary. He rolled it between his fingers, examining its intricate design, \"Still can't believe they've replaced me at The Times.\" He tossed the pen onto the desk with a heavy sigh, \"Another young whippersnapper, no doubt.\"\n\nHis gaze drifted to the newspaper clippings yellowed with age, each one a testament to his long career. He'd seen wars, political scandals, even interviewed royalty. But now, he was just another has-been, gathering dust in his study.\n\n\"At least Edna's not here to see me like this,\" he said to no one in particular, his voice barely above a whisper. \"She always knew how to make me feel better.\"\n\nHe reached for the photograph again, tracing Edna's smiling face with a trembling finger. His melancholy was palpable, yet there was an underlying current of resigned acceptance, like a man facing a storm he'd weathered many times before.\n\n\"Well, old chap,\" he said to himself, \"time to dust off that typewriter and prove you've still got it.\" But his heart wasn't in it. Not today.",
        "Sex": "Male",
        "Age": 73,
        "Occupation": "Journalist",
        "Relationship Status": "In a Relationship",
        "Negative Emotion": "Melancholy",
        "Cognitive Distortion": "Emotional Reasoning",
        "Generated Assessment": "Harold sat there, the photograph of Edna staring back at him like an accusation. His heart felt heavy, as if it might sink right through his chair and into the floorboards below. \"Replaced,\" he muttered, the word leaving a bitter taste in his mouth. It was true, wasn't it? The Times had never been the same without him, just like his study wasn't the same without Edna.\n\nHe picked up her fountain pen, turning it over in his hands. It felt cold, lifeless. Just like he felt. How could they replace him? Didn't they know he was Harold Worthington? He'd built that paper from the ground up, and now some young whippersnapper was sitting at his desk, using his byline.\n\nHis eyes scanned the yellowed clippings, each one a echo of a time when his words mattered. Now, he was just... forgotten. Like Edna, who'd left him without warning. The study felt emptier than ever, filled only with the ghosts of his past glories.\n\nHe looked at Edna's smiling face in the photograph. She always knew how to make things better. But she wasn't here now, was she? She wouldn't see him like this - weak, washed-up. He couldn't bear it if she did.\n\nHis gaze fell on the typewriter, gathering dust in the corner. It seemed daunting, a mountain he couldn't climb. Not today. Today, his heart was too heavy with sadness and resentment to even try. Tomorrow, maybe. But then again, tomorrow always seemed to bring more of the same."
    },
    {
        "Triggering Event": "**Scenario:**\n\nChristine, 31, had been on her feet for 12 hours straight at the hospital. Her scrubs were stained, and her hair was a mess, but she didn't give a damn. She just wanted to get home to John.\n\nAs she walked out of the automatic doors, her husband's voice echoed through her phone, \"Christine, you forgot the groceries again! I've been waiting for 20 minutes!\"\n\nShe sighed, her cheeks flushing with embarrassment and annoyance. \"I'm sorry, John. It's been a shitty day. I'll grab something on my way home.\"\n\n\"No,\" he snapped, \"You always do that. I asked you to get them yesterday. Now I have to go myself.\"\n\nShe could feel the stares of her coworkers as she stood there, arguing with her husband like a common teenager. She wanted to crawl into a hole and disappear.\n\n\"Fine!\" she hissed, hanging up before she said something she'd regret. She stormed back into the hospital, ignoring the concerned looks from her colleagues. Fuck them all.",
        "Sex": "Female",
        "Age": 31,
        "Occupation": "Nurse",
        "Relationship Status": "Married",
        "Negative Emotion": "Embarrassment",
        "Cognitive Distortion": "Mind Reading",
        "Generated Assessment": "**Christine's Thoughts:**\n\n*Damn it, John! How could he be so selfish? He knows I've been busting my ass all day. He doesn't care that I'm exhausted. All he cares about is his stupid groceries.*\n\n*He must think I'm completely useless. Probably can't wait to divorce me and find someone who can remember simple tasks.*\n\n*And the way he snapped at me... like he didn't have a care in the world. Typical John, always so self-absorbed.*\n\n*Even my coworkers are looking at me now, judging me for being such a failure of a wife.*"
    },
    {
        "Triggering Event": "In the cold light of dawn, he stood alone in their once-warm kitchen. The hum of the fridge was the loudest sound, like it too was mourning. He'd always been up before her, starting prep for the lunch rush at the bistro. But today, there was no rush. Today, there was only this emptiness.\n\nHe picked up the mug she'd left by the sink last night, his thumb brushing against hers in memory. It was still damp inside, a forgotten lipstick stain on the rim. He closed his eyes, inhaling her perfume, now just a faint whisper in the ceramic.\n\nThe note had been simple, neat even. \"I'm sorry.\" Three words, carved into his heart like a butcher's knife through tenderloin. She'd left him for that smooth-talking banker with his designer suits and stupid ties. He could almost hear her laughter echoing from their empty bedroom, mingling with the memories of better times.\n\nHe stumbled to the balcony, gripping the railing until his knuckles turned white. The city sprawled out before him, yawning awake, indifferent to his despair. Down there, somewhere, she was waking up in another man's bed. His stomach churned like the dough he'd once kneaded with such love.\n\nHis phone buzzed, a message from the bistro owner. \"Where are you? We're shorthanded.\" He stared at it, then tossed it onto the floor, watching as it shattered into pieces, much like his world had just hours ago.\n\nHe sank to his knees, head in hands, tears streaming down his face. The despair was a crushing weight, squeezing the air from his lungs. He gasped for breath, but all he could taste was bitter failure.\n\nIn the silence of their abandoned home, he felt truly alone. No more laughter, no more shared dreams. Just him, his pain, and the haunting echo of her perfume on an empty mug.",
        "Sex": "Male",
        "Age": 49,
        "Occupation": "Chef",
        "Relationship Status": "In a Relationship",
        "Negative Emotion": "Despair",
        "Cognitive Distortion": "Mental Filter",
        "Generated Assessment": "**Writing Prompt:**\nImagine you're in a meeting, presenting your team's latest project to the CEO. Suddenly, you notice a tiny smudge on one of the graphs in your slideshow. You become fixated on it, feeling like it's a glaring mistake that everyone else must be seeing too. Your nerves start to fray as you continue presenting, obsessing over that single imperfection.\n\n**Text:**\n\"Alright, so here we are with Q2 projections... Wait, what's that?\" I squinted at the screen, my heart pounding in my chest like a snare drum. A tiny, insignificant smudge marred the perfection of our bar graph, an unsightly mole on an otherwise flawless face.\n\nI felt it drawing all eyes towards it, a black hole of distraction amidst the sea of data. How could they not see it? It was right there, screaming for attention like a neon sign at midnight. I heard myself stuttering, my voice tripping over words as I desperately tried to ignore the elephant in the room.\n\n\"But surely you can all see it too?\" I wanted to say, but bit my tongue just in time. They were all focused on me, not that godforsaken smudge. Or so it seemed. The CEO's eyebrows arched slightly, his gaze flicking from me to the screen and back again. I felt a flush creeping up my neck, beads of sweat forming on my brow.\n\n\"It's... it's just a tiny bit of dust,\" I hear myself say, my voice tight like a hangman's noose. \"Nothing to worry about.\" But inside, all I could see was that damn smudge, growing bigger and bolder with each passing second. The rest of the presentation became a blur, a distant hum drowning under the roar of that one little imperfection.\n\nAs we wrapped up, I couldn't look at anyone, afraid they'd see the embarrassment etched into my face. All I could think about was that smudge, like a scarlet letter branding me as incompetent. It wasn't until later, back in my office, that I realized everyone else had been looking at the graph, not the smudge. They'd seen the whole picture, while all I'd noticed was that one tiny detail."
    },
    {
        "Triggering Event": "At precisely 7:59 AM, Officer Sarah Thompson pulled into her designated parking spot at the precinct. As she stepped out of her vehicle, she noticed that someone had left their coffee cup on the roof of her car overnight. The remnants of yesterday's caffeine fix now dripped down her window, staining her uniform and leaving an acrid smell. She felt a familiar twitch in her temple, a harbinger of her rising irritation. \"Who could be so careless?\" she muttered under her breath, wiping at the stain futilely with her sleeve. As she entered the station, she resolved to find out who was responsible for this petty annoyance and give them a piece of her mind.",
        "Sex": "Female",
        "Age": 33,
        "Occupation": "Police Officer",
        "Relationship Status": "Married",
        "Negative Emotion": "Irritation",
        "Cognitive Distortion": "Fortune Telling",
        "Generated Assessment": "**Writing Prompt:** Describe Officer Sarah Thompson's day after discovering the coffee cup on her car, highlighting her fortune telling distortion in an anxious, sarcastically annoyed tone.\n\n**Text:**\n\n\"Great start to the day, huh? Coffee grounds in my hair, a stain that'll make me smell like a dumpster fire all shift, and probably a permanent crease in my uniform. I can just see it now - Chief walking by, taking one whiff, and assigning me to paperwork duty for the rest of the month. 'Cause that's how my luck goes, you know? One little mishap, and suddenly I'm knee-deep in cold case files, while everyone else is out there catching real criminals.\n\nAnd don't even get me started on how this is gonna ruin my plans for tonight. I was supposed to meet up with Mark after work, maybe finally have a normal date night without the radio blaring or some dispatch calling me in. But now? Now I'll be lucky if I can make it home before midnight, let alone find time to change out of these stinky clothes.\n\nI swear, if I find out who thought it was funny to leave their trash on my car, they're gonna wish they'd just thrown it in the recycling bin. I mean, what's next? A squirrel running off with my service weapon while I'm trying to grab a coffee? Oh wait, that actually happened last month... Never mind.\n\nBut hey, at least I won't have to worry about any more surprise parties or unexpected promotions, right? 'Cause with this kind of luck, who knows what else could go wrong today. I might as well just sit here and wait for the apocalypse.\""
    },
    {
        "Triggering Event": "\"After fifty years of marriage, she woke up one morning and decided today was the day she'd start calling him 'Fred'. 'I've always liked that name,' she claimed, chuckling over her coffee. He'd been 'Frank' since they were eighteen, but now, at seventy-three, it seemed his wife had run out of patience for familiarity. He shrugged it off, attributing it to some midlife crisis on her part. But every time she slipped up and called him Frank again, he felt a pang in his chest. It was as if their life together was slowly unraveling, one name mix-up at a time.\"",
        "Sex": "Male",
        "Age": 73,
        "Occupation": "Nurse",
        "Relationship Status": "In a Relationship",
        "Negative Emotion": "Hopelessness",
        "Cognitive Distortion": "Mind Reading",
        "Generated Assessment": "\"Seriously, what's with the sudden 'Fred' thing? She thinks I'm gonna buy that it's just some late-life whim? Like she can just switch up fifty years of habit on a whim. I know her better than that. She's trying to distance herself, make me feel like a stranger in my own life. Every time she slips back into 'Frank', it's like a punch in the gut. She thinks I don't notice, but I do. I see right through her little games.\""
    },
    {
        "Triggering Event": "In the dim, cluttered kitchen of their shared apartment, Emily watched him fold his laundry with an ease she'd once envied. Now it just pissed her off. Every neatly tucked sock was another article he hadn't written about, another dinner he hadn't cooked, another late night she'd spent alone. Her resentment hung heavy in the air like the smoke from his damn e-cigarette.\n\nShe'd been burning the candle at both ends, working late nights and weekends to keep her career afloat while he mooched off her success. His \"passion project\" had become a full-time job, but who was paying the bills? Who was keeping their heads above water?\n\nEmily slammed her laptop shut, making him jump. He looked up at her, his eyes wide behind his stupid hipster glasses.\n\n\"What?\" he asked, as if he didn't know. As if he couldn't feel the tension snapping like a live wire between them.\n\n\"You're such a fucking leech,\" she spat, surprising even herself with the venom in her voice. She grabbed her coat and stormed out into the rain, leaving him and his goddamn socks behind.",
        "Sex": "Female",
        "Age": 32,
        "Occupation": "Journalist",
        "Relationship Status": "Married",
        "Negative Emotion": "Resentment",
        "Cognitive Distortion": "Blaming",
        "Generated Assessment": "**Writing Prompt:** A late-night conversation between Emily and her roommate, Alex, after she's been harboring resentment for weeks due to his perceived freeloading.\n\n---\n\nEmily: (Stirring her tea nervously) You know, Alex, I've been thinking... about us. About our living situation. (Pauses, takes a deep breath) I feel like I'm the only one carrying this apartment on my shoulders. It's just... it's not fair.\n\nAlex: (Raising an eyebrow) What do you mean? I pay rent too, Em. We discussed this when we moved in together.\n\nEmily: (Wringing her hands) I know, I know. But it feels like more than that. You're always off doing your... art. (She says the word like it leaves a bad taste in her mouth) And I'm here, working late nights, barely making my deadlines. It's not right.\n\nAlex: (Leaning back, sighs) Emily, we've been through this before. My passion project is going to pay off eventually. You said you'd support me when we moved in together. Remember?\n\nEmily: (Nodding, but her eyes flash with anger) I do remember. But it's been months now, Alex. Months of you not contributing financially. And emotionally... it feels like you're not pulling your weight around here either.\n\nAlex: (Running a hand through his hair) That's not fair. I thought we were past this. You know I'm trying my best.\n\nEmily: (Her voice shakes) Your best isn't good enough, Alex! Not when I'm the one holding everything together! (She stands up abruptly, her chair screeching against the floor) I can't keep doing this. It's too much. All of it is too much!\n\nAlex: (Softly) Emily... please. Let's talk about this. We're a team, remember?\n\nEmily: (Shaking her head, tears welling up in her eyes) No, Alex. You're the one who keeps saying that. But I'm the one who feels like I'm drowning here alone. (She walks away, leaving Alex staring after her, bewildered)"
    },
    {
        "Triggering Event": "Sarah's hands trembled as she chopped onions, their pungent smell stinging her eyes more than usual. She was supposed to be preparing for tonight's dinner rush at \"Le Jardin,\" but her mind was elsewhere.\n\nThe kitchen clock ticked loudly, echoing each second that passed since she'd hung up the phone. The voice on the other end had been firm, final. \"We're letting you go, Sarah. Your heart just isn't in it anymore.\"\n\nShe choked back a sob, hot tears mixing with the onion juice. She hadn't seen it coming. After all these years, they were firing her? Her? The chef who'd breathed life into their menu, turned it into a Michelin-starred masterpiece?\n\nBut she knew why. She'd been distracted lately, her mind foggy, her usually impeccable recipes tasting like saltless gruel. All because of him - or rather, what he'd done.\n\nHer boyfriend, John. They'd been together for five years now, but it seemed like just yesterday they were laughing over their first dinner date at this very restaurant she now cooked in. Now, his laughter echoed hollowly in her ears, replaced by the memory of his voice on that other line - \"I'm sorry, Sarah. I didn't mean for it to happen.\"\n\nShe hadn't meant for it to happen either. The affair had started innocently enough; a late-night chat over spilled wine at a conference, escalating into something more when she least expected it. She'd ended it immediately after finding out about John's betrayal, but the damage was done.\n\nNow, standing alone in her once-loved kitchen, Sarah felt a surge of remorse wash over her like a tidal wave. She'd jeopardized everything - her career, her relationship, her reputation - all for a moment of weakness. And for what? A fleeting connection that couldn't compare to the warmth of John's hand holding hers, the comfort of his familiar laugh.\n\nAs she stared at the half-chopped onions, Sarah realized she'd reached a crossroads. She could continue down this path of self-pity and regret, letting her emotions ruin everything she held dear. Or she could pick herself up, dust off her apron, and start again. Because that's what chefs did - they created something beautiful from seemingly ordinary ingredients.\n\nBut first, she needed to face John. To apologize, to forgive, to decide if there was still something worth saving between them. She took a deep breath, wiped away her tears, and reached for the phone. It was time to cook up a new recipe for their future.",
        "Sex": "Female",
        "Age": 68,
        "Occupation": "Chef",
        "Relationship Status": "In a Relationship",
        "Negative Emotion": "Remorse",
        "Cognitive Distortion": "Blaming",
        "Generated Assessment": "Sarah slammed down the knife, sending onion bits flying across the counter. \"Goddammit, John!\" she shouted into the empty kitchen. She couldn't believe he'd done this to her. To them.\n\nHer hands shook as she grabbed a handful of napkins, blotching away her tears. This wasn't how it was supposed to go. She'd been the one holding their relationship together while he was off screwing some random chick at a conference. And now, here she was, jobless and heartbroken because of his stupid mistake.\n\nShe paced back and forth, her mind racing. \"How could you be so fucking careless?\" she muttered, clenching her fists. She knew she should be upset with herself too, for letting things slip at work, but it was easier to focus on John's betrayal. It felt... safer.\n\nSarah paused by the phone, staring at it like it held all the answers. She wanted to call him, scream at him until he understood how much he'd ruined everything. But she also wanted him to fix it. To make it better. Because that was what they did, right? They took care of each other.\n\nBut first, she needed a drink. Something strong enough to wash away the bitter taste in her mouth - the taste of John's betrayal, of her own failure. She grabbed a bottle of bourbon from the cabinet and poured herself a generous glass. As she took her first sip, she felt a surge of determination.\n\nShe'd show them all. She'd show John that he couldn't just throw away five years like it was nothing. And she'd show \"Le Jardin\" that they'd made a fucking mistake letting her go. She'd rise from this ashes, phoenix-like, and when she did, everyone would see what she was truly capable of.\n\nBut for now, Sarah poured another drink and raised it towards the ceiling, where John was presumably looking down on her in shame. \"Fuck you, John,\" she whispered, taking a sip. \"And fuck them too.\""
    },
    {
        "Triggering Event": "Fuck me, it's been three goddamn years since the ink dried on those divorce papers, but today... Today, it felt like that bitch just signed them again. I walked into the station, badge still warm from the morning sunlight, and who do I see sitting there, all smiles and fucking hand-holding? My ex-wife, Sarah, with some douchebag in a suit. She didn't even have the decency to look ashamed, or guilty, or anything. Just waved at me like we were old pals.\n\nI swear to God, my heart dropped like I'd been shot. I mean, it's not like I was expecting her to be pining away for me, but fuck, did she really move on that fast? And with some... some... whatever-the-fuck-he-is?\n\nI stormed past them, trying to keep my cool. But as I sat down at my desk, I could feel the anger boiling up inside me like a damn pressure cooker. I slammed my fist down so hard, the whole thing shook. A few of the guys looked over, but I just flipped them off and muttered something about needing coffee.\n\nBut fuck coffee. What I needed was to punch something. Or someone. Namely, that pretty boy she's got her claws into now. How could she do this to me? After all we'd been through... All the shit I've dealt with on the job, just so she could have a nice life. And this is how she repays me?\n\nI spent the rest of my shift like a goddamn zombie. Even my partner noticed something was off, but I just brushed him off. What's he gonna do? He can't understand. None of them can.\n\nAs I drove home tonight, all I could see was her face. Her fucking smiling face, happy as a clam with that... that... asshole. And me? I'm still here, alone, with nothing but a cold bed and these goddamn memories to keep me company.\n\nFuck this. Fuck her. Fuck them all.",
        "Sex": "Male",
        "Age": 48,
        "Occupation": "Police Officer",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Rejection",
        "Cognitive Distortion": "Mental Filter",
        "Generated Assessment": "**Writing Prompt:**\nImagine you're at a bustling party, filled with laughter and lively conversations. Suddenly, you notice that your ex-partner has just arrived with someone new on their arm. You feel a pang of jealousy and anger. Write down your thoughts and feelings in the moment, focusing on one specific detail that seems to consume all your attention.\n\n**Text:**\nFuck me, did she really have to wear that dress? The same goddamn red one I bought her for our anniversary last year? The one she said made her feel like a million bucks? Now she's prancing around here with it on, and him... Him looking at her like he knows what it means. Like he knows how much it cost me to put that smile on her face once upon a time.\n\nI can't fucking believe this. She has the nerve to show up here, flaunting her new man in front of everyone. Does she think this is funny? A fucking game? Because I sure as hell don't find any amusement in seeing her like this. Not after everything we went through together.\n\nAnd what's with his hand on her back? Is that supposed to be possessive, or protective? Or maybe it's just him trying to keep up appearances, pretending he knows how to handle a woman like her. Bullshit. He doesn't know shit about us. About our history. About the fucking memories we made in this very dress.\n\nI feel my grip tighten around my glass, the ice cubes clinking loudly against each other, mirroring the tension inside me. I can't take my eyes off them. Off her. Off that damn dress. It's like a goddamn beacon, drawing all my attention and leaving no room for anything else.\n\nI swear to God, if she starts dancing with him in it, I'm going to lose my shit right here. This is our song, our dance, our fucking moment. And she's sharing it with... with whoever the hell he is. Just like that. Like it means nothing.\n\nFuck this. Fuck her. Fuck them all. But mostly... Fuck that red dress. It's just a goddamn piece of fabric, but tonight, it feels like my whole fucking world."
    },
    {
        "Triggering Event": "In the quiet hum of his classroom after school hours, Mr. Thompson was meticulously grading yesterday's geography test. He'd always been a stickler for detail, but lately, he felt an extra knot of tension in his shoulders, a bead of sweat forming at his temple as he worked.\n\nSuddenly, the classroom door creaked open. Startled, Mr. Thompson looked up to see Mrs. Harris, the stern-faced principal, stepping inside. She was holding a stack of papers, her lips pressed into a thin line. His heart began to pound like a drum in his chest.\n\n\"Mr. Thompson,\" she said, her voice echoing in the empty room, \"I've received some... concerning reports about your classroom management.\"\n\nHe felt the heat rise to his face, embarrassed by the implication. He'd always prided himself on maintaining a calm and orderly environment. But lately, with the stress of his upcoming retirement weighing heavily on him, he knew he hadn't been as patient or composed as usual.\n\nMrs. Harris continued, \"I've arranged for Ms. Young, our new guidance counselor, to observe your classes this week. I trust you'll make a good impression.\"\n\nAs Mrs. Harris left, Mr. Thompson was left alone with his thoughts, his face burning with embarrassment. He looked down at the half-graded tests, suddenly anxious about what Ms. Young might see when she observed him tomorrow. Would she notice the slight tremor in his hands, the beads of sweat on his forehead? Would she think he was losing control?\n\nHe took a deep breath, trying to calm himself, but the knot in his stomach only tightened. He knew he had to pull himself together, for his students' sake and his own dignity. But right now, all he could feel was that embarrassing flush of heat, spreading from his face down to the tips of his toes.",
        "Sex": "Male",
        "Age": 62,
        "Occupation": "Teacher",
        "Relationship Status": "In a Relationship",
        "Negative Emotion": "Embarrassment",
        "Cognitive Distortion": "What if?",
        "Generated Assessment": "Mr. Thompson sat alone in his classroom, the ticking of the clock echoing loudly in the silence. He picked up another test paper, but his eyes scanned it absently, his mind too busy racing with thoughts.\n\n\"What if Ms. Young sees how much I'm struggling?\" he muttered to himself, his fingers tapping nervously on the desk. \"What if she thinks I can't handle my class anymore? What if the kids sense this and start acting out?\"\n\nHe sighed, rubbing his temples. \"Fuck, why did Mrs. Harris have to stick her nose in? I've been managing just fine.\"\n\nHis eyes darted around the room, landing on the chalkboard where he'd written today's lesson plan. \"What if I can't keep up with the curriculum? What if I start forgetting things?\"\n\nHe shook his head, trying to shake off the thoughts. \"Damn it, Thompson,\" he muttered, \"you're acting like a fucking rookie. You've been teaching for decades.\"\n\nBut the doubts lingered, gnawing at him. He took a deep breath, trying to focus on the test paper in front of him. But his mind was already miles ahead, spiraling into a what-if vortex.\n\n\"What if I have a panic attack during class? What if I can't finish grading these tests before Ms. Young arrives tomorrow?\" he whispered, his anxiety growing with each question. \"Fuck, fuck, fuck,\" he muttered, slamming his fist softly on the desk. He knew he was overthinking, but he couldn't stop himself from asking, \"What if this is it? What if I'm finally losing control?\""
    },
    {
        "Triggering Event": "He walked into the clinic, late again. Another damn night shift, another fucking day of playing god to these ungrateful bastards. He was 57, for Christ's sake, not some eager beaver resident fresh out of med school. But here he was, still running on fumes and guilt.\n\nThe nurse handed him the chart. \"Mrs. Thompson,\" she said, her voice as cheerful as ever. He grunted, flipping through the pages. Appendicitis, probably. Another goddamn appendicitis. His wife had died of something far more insidious, something he couldn't cut out or sew up.\n\nHe strode into the room, his eyes meeting Mrs. Thompson's. She was writhing in pain, her face red and sweaty. \"About fucking time,\" she snapped at him. He bristled but kept his mouth shut. Bitch deserved to suffer a little, didn't she?\n\nHe started the exam, his hands moving automatically. But his mind was elsewhere, stuck on that damn anniversary coming up. One year since she'd left him alone in this godforsaken world. One fucking year without her laughter, her warmth, her fucking pancakes.\n\nHis fingers hit something hard and swollen in Mrs. Thompson's belly. Appendix, just like he'd thought. He stepped back, his mind finally catching up to his body. \"We need surgery,\" he said, his voice flat. Another goddamn appendectomy. Another life he'd save while his own wife rotted six feet under.\n\nHe stormed out of the room, leaving Mrs. Thompson to her whines and complaints. He didn't care about her pain right now. Not when his own fucking heart felt like it was being ripped out all over again.",
        "Sex": "Male",
        "Age": 57,
        "Occupation": "Doctor",
        "Relationship Status": "Widowed",
        "Negative Emotion": "Suffering",
        "Cognitive Distortion": "Emotional Reasoning",
        "Generated Assessment": "\"I'm here, aren't I? Late again because some people just can't keep to a schedule. Another night shift, another day of playing nursemaid to the ungrateful. I mean, who do they think I am, their personal doctor-on-call? I've got my own life, you know.\n\nAnd there's Mrs. Thompson, writhing around like she owns the place. 'About time,' she says. Yeah, well, maybe if she hadn't eaten half the damn refrigerator, we wouldn't be in this situation now, would we?\n\nHer pain, her attitude, it all just feels so... overwhelming right now. I can't even think straight. It's like my own heartache is seeping into every word, every movement. One year without my wife, and I'm still drowning in it.\n\nAppendicitis? Probably. Another life to save while mine feels like it's falling apart. But what does she care about that? She just wants her precious appendix fixed so she can go back to her perfect little life.\n\nI storm out, leaving her to her complaints. I can't deal with her pain right now. Not when my own heart feels like it's being shredded all over again.\""
    }
]