[
    {
        "Triggering Event": "\"Fuck me sideways! It's 9 PM on a Friday, I've been staring at this goddamn code for hours, and it still won't compile. My fucking boss emails me right before I log off, 'Just need you to glance over this quick before you go.' Yeah, right. I should've divorced him instead of that useless prick ex-husband. Now I'm gonna be up all night with this shit while my colleagues are out getting drunk on their hard-earned weekends. What the hell did I do to deserve this?\"",
        "Sex": "Female",
        "Age": 60,
        "Occupation": "Software Engineer",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Stress",
        "Cognitive Distortion": "Unfair Comparisons",
        "Generated Assessment": "\"Oh for fuck's sake! It's after hours, and I'm still here, banging my head against this damn code. And there's my boss, Mr. 'Work-Life Balance', sending me a 'quick glance' at 8:59 PM. I must be the only poor sap in this office who can't manage their time like everyone else. Look at them, all leaving on time, probably heading to some trendy bar downtown right about now. While I'm stuck here, with my trusty ramen noodles and a gallon of coffee. Lucky me!\""
    },
    {
        "Triggering Event": "Alright, here we go:\n\n\"So there I was, Dr. Amelia Hart, esteemed scientist, presenting my groundbreaking research on neutrinos at this stuffy conference. I'd spent weeks preparing, practicing my delivery, and even ironed my lab coat for crying out loud. And then, the unthinkable happens.\n\nAs I'm midway through explaining the subtleties of flavor oscillation, I hear a faint 'riiiiiiip'. My heart sinks like a stone in a pond. I look down to find my pants, those blasted polyester pants, splitting up the seam right across my backside. Talk about a wardrobe malfunction!\n\nI freeze, feeling the heat of embarrassment spread across my face. The room falls silent, all eyes on me and my suddenly exposed buttocks. I can't help but think, 'Well, this isn't exactly the kind of attention I was hoping for.'\n\nI manage to cobble together some semblance of composure, finish my presentation while internally fuming at those cheap pants. But hey, at least it made the conference memorable, right? Screw you, neutrino pants!\"",
        "Sex": "Female",
        "Age": 50,
        "Occupation": "Scientist",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Embarrassment",
        "Cognitive Distortion": "Jumping to Conclusions",
        "Generated Assessment": "**Writing Prompt:**\nImagine you're a gruff, no-nonsense construction worker named Hank. You've just started working with a new crew member, Jake, who seems a bit green but eager to please.\n\n**Text:**\n\n\"Alright, so this kid Jake shows up today, acting all eager and whatnot. Said he's got experience, knows his way around a toolbox. I figured, 'Great, another mouth to feed, another pair of hands to help with the heavy lifting.'\n\nWe start on this new project, and right off the bat, Jake's asking questions about every damn thing - how we're laying out the foundation, why we're using these specific materials, even questioning my choice of coffee brand. I mean, come on, who gives a shit about the coffee?\n\nI'm thinking to myself, 'This guy's gonna be more trouble than he's worth.' He's either got no idea what he's doing, or he thinks he knows better than everyone else. Either way, not good.\n\nSo, I tell him to grab a shovel and start digging with the rest of the crew. Figured that'd shut him up for a while. But then, just as we're starting to make some progress, Jake pipes up again, 'You know, we could save some time if we...'\n\nI cut him off, 'Kid, you've been here five minutes. You haven't even earned the right to question my methods yet.' The crew chuckles, and Jake looks like he's gonna sulk or something.\n\nBut then, surprise, surprise, Jake actually has a decent idea. It'd save us some time, make the job a bit easier. I'm not gonna admit it out loud, but I might've been wrong about this kid.\n\nBut hey, that doesn't mean he's off the hook just yet. Still gotta prove himself around here.\""
    },
    {
        "Triggering Event": "In the damp, fluorescent-lit staff room, he fumbled through his lunch bag, nerves jittering like live wires. Today was the day they were supposed to finally hire someone new, but all he could think about was how it would stretch their tiny break times even thinner.\n\nHe'd been here for years, knew every inch of the sprawling store, every creak and groan of its tired floors. But lately, it felt like a prison, walls closing in with each passing shift.\n\nHis sandwich, a sorry-looking thing now, lay on the stained table. He took a bite, chewing quickly, trying to ignore the sour taste of his own anxiety. Then he heard it - the unmistakable sound of that new kid's laugh, echoing through the thin walls. It was too loud, too carefree, grating against his raw nerves like nails on a chalkboard.\n\nHe tried to focus on his lunch, but his stomach churned rebelliously. He pushed away the sandwich, his appetite vanishing quicker than a sale item at closing time. His hands, clammy and trembling, balled into fists on the tabletop. This was too much. Too fast. Too soon.\n\nThe laugh came again, louder this time, followed by a chorus of forced chuckles from their coworkers. He could picture it all too clearly - the new kid, basking in their attention like a cat lounging in sunlight. It made his skin crawl, his insides squirm as if infested with maggots.\n\nHe sprang up abruptly, chair legs screeching against the linoleum. He had to get out of here. Now. Before he did something... before he lost it completely. The room spun around him as he grabbed his bag, rushing towards the door like a man escaping a burning building.",
        "Sex": "Male",
        "Age": 37,
        "Occupation": "Retail Worker",
        "Relationship Status": "Single",
        "Negative Emotion": "Disgust",
        "Cognitive Distortion": "Unfair Comparisons",
        "Generated Assessment": "In the stark glow of the staff room's harsh lights, he fumbled with his lunch bag, heart pounding like a drum solo gone awry. Today was meant to be a day of relief, another pair of hands finally joining their ragtag team. But all he could feel was tension coiling in his gut like a venomous snake.\n\nHe'd put in his time here, knew every inch of the place better than anyone else. Yet lately, it felt like he was stuck in quicksand, sinking deeper with each passing shift while everyone around him seemed to float effortlessly by. His sandwich lay before him now, a pathetic sight compared to the fancy wraps and salads the others brought. He took a bite, but the taste was lost on him, overshadowed by the bitter tang of resentment.\n\nThen he heard it - that newcomer's laugh, booming through the thin walls like a foghorn. Too loud, too confident, too everything. It grated against his raw nerves like sandpaper, each laugh slicing away another layer of his already frayed patience. He could just picture them out there, the new kid lapping up attention like a thirsty dog at a water bowl.\n\nHis stomach churned, threatening mutiny as he watched his coworkers, their faces flush with laughter, eyes sparkling with enjoyment. He felt it then, that familiar pang of inadequacy, sharp and stinging like a paper cut on the heel of your hand. Here they were, all happiness and camaraderie, while he sat alone in the corner, his lunch growing cold untouched.\n\nHis hands trembled as they clenched into fists on the tabletop. This was too much. Too fast. Too soon. The walls seemed to close in around him, the air grew thin and suffocating. He had to get out of here before he did something... before he lost it completely.\n\nWith a scrape of chair legs against linoleum, he stood up abruptly, grabbing his bag like a lifeline. The room spun around him as he rushed towards the door, escape his only thought. Each step echoed loudly in his ears, drowning out the laughter that still rang mockingly behind him."
    },
    {
        "Triggering Event": "At 4 PM sharp, Linda, a seasoned retail worker at Martingale Mall's electronics store, was ready to call it a day. She'd been on her feet for eight hours straight, dealing with everything from eager tech enthusiasts to clueless customers who couldn't decide between earbuds and headphones. Her patience had worn thin like the soles of her comfortable yet practical work shoes.\n\nAs she was finishing up the stocktake report, she heard a commotion at the customer service desk. A young woman, probably half Linda's age, was raising her voice over some trivial issue about an exchange. Linda could feel her irritation rising like the heat from the faulty AC unit that had been broken for weeks now.\n\n\"Listen here, missy,\" Linda snapped, striding over to the desk. \"I've had it up to my eyeballs with your kind of attitude today.\" She slammed her fist on the counter, making everyone in earshot jump. The young woman looked taken aback but kept her mouth shut, letting Linda vent.\n\n\"Either you calm down and let me do my job, or I'll find someone else who can't wait to help you,\" Linda growled, her voice low and controlled, barely concealing the storm brewing beneath. She took a deep breath, steadying herself before continuing in a slightly calmer tone, \"Now, what seems to be the problem here?\"",
        "Sex": "Female",
        "Age": 51,
        "Occupation": "Retail Worker",
        "Relationship Status": "Single",
        "Negative Emotion": "Irritation",
        "Cognitive Distortion": "Mind Reading",
        "Generated Assessment": "Linda leaned against the counter, arms crossed, as she listened to the young woman's explanation. She couldn't help but roll her eyes internally at what seemed like an overreaction about a minor warranty issue. \"Really?\" she thought, \"She's making such a fuss over this? She must think I'm incompetent and can't handle my job.\"\n\nAs the woman stumbled over her words, Linda felt a surge of annoyance. \"She's doing that on purpose,\" she thought, \"Trying to make me look bad in front of everyone.\" She could almost hear the young woman's thoughts, accusing her of being unreasonable and rude.\n\nLinda huffed, interrupting the woman mid-sentence. \"You know what? I don't have time for this. You can wait until my shift ends at 5, or you can come back tomorrow when my colleague is here.\" She turned away, already expecting the young woman to protest loudly, drawing even more attention.\n\nBut instead, there was silence. Linda glanced over her shoulder, surprised. The young woman looked taken aback but simply nodded and stepped aside, letting another customer approach the desk. Linda felt a pang of guilt but quickly dismissed it. \"She's probably just plotting how to complain about me to my manager,\" she thought, shaking her head as she walked away."
    },
    {
        "Triggering Event": "In her 35th year at the lab, Dr. Amelia Hartley, esteemed scientist and wife to Harold for over four decades, received an email from the Grant Assessment Committee. It was a stark, black-and-white affair, much like her now-silent laboratory. She clicked open the attachment with a sigh, more akin to a deflating balloon than her usually steady breath.\n\nThe words swam before her eyes, refusing to form coherent sentences until she blinked them into focus. \"Unfortunately, your application has not been successful...\" They went on to praise her work, as they always did, but this time it felt like empty platitudes echoing in a hollow cavern of rejection.\n\nShe leaned back in her chair, the leather creaking softly, almost whispering its own disappointment. Amelia had spent countless hours crafting that proposal, her fingers dancing over the keyboard until she was convinced it was perfect. But perfection, she supposed, was subjective - especially when weighed against the whims of faceless committees.\n\nAs she shut down her computer, the hum of the lab seemed to mock her, each piece of equipment a testament to grants past. She stood up, smoothing out imaginary creases from her trousers, and walked towards the door. Her reflection in the glass panel caught her eye - the silver strands in her hair seemed brighter under the harsh fluorescent lights.\n\n\"Another year, another disappointment,\" she murmured sarcastically to herself as she stepped out into the corridor. The words echoed around her like a mantra, each one a tiny needle pricking at her heart. But Amelia was no stranger to disappointment; she'd been collecting them like trophies since she was first passed over for tenure.\n\nBack home, Harold greeted her with his usual warmth, but even his embrace couldn't dispel the chill that had settled around her shoulders. Over dinner, she shared the news, her voice steady despite the churning in her stomach. He listened, his expression growing grimmer by the minute.\n\n\"You'll get them next time,\" he said finally, raising his glass of wine towards hers. She clinked glasses with him, but the gesture felt hollow.\n\n\"Yes,\" she replied, looking around their dining room filled with memories and accomplishments. \"Next time.\"\n\nBut even as she said it, Amelia couldn't shake off the feeling that perhaps there wouldn't be a next time - not for her. And that thought tasted bitter indeed.",
        "Sex": "Female",
        "Age": 63,
        "Occupation": "Scientist",
        "Relationship Status": "Married",
        "Negative Emotion": "Disappointment",
        "Cognitive Distortion": "Magnification/Minimization",
        "Generated Assessment": "**Writing Prompt:** Write a letter from Amelia to Harold after she's received the rejection email.\n\n---\n\nDear Harold,\n\nFucking hell, they rejected me again. Another year, another goddamn 'no'. I spent bloody hours on that proposal, and for what? To hear them prattle on about my work like it's some fucking consolation prize?\n\nYou know what? Screw them. They can take their praise and shove it up their arses. It doesn't change the fact that they passed me over once again.\n\nAnd don't give me that 'there will always be next time' bullshit, Harold. I'm not some fucking student anymore. I've been at this for decades, and what do I have to show for it? A drawer full of rejection letters and a goddamn hall of mirrors reflecting all my failures.\n\nI know you mean well, but spare me the empty platitudes. Let's just have dinner in silence tonight, yeah? Because right now, I can't stomach your optimism or their fucking praise.\n\nYours,\n\nAmelia"
    },
    {
        "Triggering Event": "Fuckin' Monday morning, ain't it? Stupid alarm blarin', rude as ever. Drag myself outta bed, teeth grindin', 'cause I know what's waitin' for me at that shithole they call a store.\n\nTraffic's a fuckin' nightmare, goddamn idiots everywhere. \" indicatess\" \"indicate\"? Fuckin' learn to drive, assholes! By the time I pull up to the curb, my blood's boilin', and it ain't even 8 AM yet.\n\nWaltz into the stockroom like a fuckin' queen, 'cause that's what I am, right? The boss's little princess. Ha! Fat fuck don't know shit about me. \"Hey, honey,\" he says, all smarmy-like, \"we're short-staffed today. You gotta cover makeup too.\"\n\nFuck me, I think. Fuckin' fuck me. But I just nod, 'cause what else am I gonna do? This job's the only thing keepin' my head above water. Barely.\n\nSo there I am, stuck in that goddamn makeup aisle, surrounded by those stupid, smiling faces on the fuckin' packages. \"Wake up beautiful,\" they say. Bullshit! You can't wake up beautiful when you're livin' in this shithole world!\n\nCustomers wander by, barely look at me. Like I'm not even here. Fuck 'em too! I don't need their bullshit.\n\nThen she walks in. Miss Perfect with her perfect hair and her perfect fuckin' attitude. She struts right up to the counter, looks down her nose at me, and asks, \"Do you have anything to conceal these bags?\"\n\nBitch! Fuckin' bitch! I wanna reach across that counter and tear those stupid highlights outta her head. But I don't. I just grit my teeth and say, \"Yeah, we do. It's called 'Get a fuckin' life'.\"\n\nShe stares at me, shocked. Good! Fuck you too, princess!\n\nBut then she opens her mouth, and it all goes to shit. \"You know what?\" she says, all haughty-like, \"I think I'll take my business elsewhere. Somewhere with better customer service.\"\n\nAnd just like that, my day's fucked. My life's fucked. 'Cause now I'm gonna get written up for sure, and then where am I gonna be? Fuckin' nowhere, that's where!\n\nAll 'cause of some stuck-up bitch who can't even see past her own goddamn reflection.\n\nFuck this job! Fuck this world! I hate it all.",
        "Sex": "Female",
        "Age": 32,
        "Occupation": "Retail Worker",
        "Relationship Status": "Single",
        "Negative Emotion": "Hatred",
        "Cognitive Distortion": "Personalization",
        "Generated Assessment": "**Subjective Reaction:**\n\nFuckin' Monday morning, ain't it? Stupid alarm blarin', rude as ever. Drag myself outta bed, teeth grindin', 'cause I know what's waitin' for me at that shithole they call a store.\n\nTraffic's a fuckin' nightmare, goddamn idiots everywhere. Learn to drive, assholes! By the time I pull up to the curb, my blood's boilin', and it ain't even 8 AM yet.\n\nWaltz into the stockroom like a fuckin' queen, 'cause that's what I am, right? The boss's little princess. Ha! Fat fuck don't know shit about me. \"Hey, honey,\" he says, all smarmy-like, \"we're short-staffed today. You gotta cover makeup too.\"\n\nFuck me, I think. Fuckin' fuck me. But it's not like he's doin' this to spite me, right? It's 'cause they're understaffed. Still, my stomach turns.\n\nSo there I am, stuck in that goddamn makeup aisle, surrounded by those stupid, smiling faces on the packages. Wake up beautiful, my ass! They don't know shit about my life!\n\nCustomers wander by, barely look at me. Like I'm not even here. Fuck 'em too! Don't they know I'm tryin' my best?\n\nThen she walks in. Miss Perfect with her perfect hair and her perfect fuckin' attitude. She struts right up to the counter, looks down her nose at me, and asks, \"Do you have anything to conceal these bags?\"\n\nBitch! Fuckin' bitch! Who does she think she is? She doesn't know what I've been through. But I don't say that. I just grit my teeth and tell her about the concealer.\n\nShe stares at me, shocked. Like I'm the problem here! And then she drops the bomb: \"I think I'll take my business elsewhere.\"\n\nAnd just like that, my day's fucked. My life's fucked. 'Cause now I'm gonna get written up for sure, all 'cause of some stuck-up bitch who can't even see past her own goddamn reflection.\n\nFuck this job! Fuck this world! Why does everyone have to make everything about me?"
    },
    {
        "Triggering Event": "After a grueling 16-hour day at the lab, I stormed into my house, slamming the door behind me. My wife looked up from her book, startled. \"Long day?\" she asked, knowing damn well it was.\n\n\"Fucking understatement,\" I snapped, kicking off my shoes. I slumped onto the couch, running a hand through my greasy hair. \"The funding cut is killing us. We're months behind schedule, and no one seems to give a shit.\"\n\nShe sighed, closing her book. \"I'm sorry, hon. But you can't let this consume you. It's not healthy.\"\n\n\"Not healthy?\" I shot back, anger boiling over. \"You try working on a fucking miracle with your hands tied behind your back! You know what? Fuck it. Fuck the funding, fuck the schedule, and fuck you too if you can't see how hopeless this is!\"\n\nI stood up abruptly, knocking over my half-empty glass of wine. It didn't matter. Nothing mattered anymore. I stomped upstairs to our bedroom, leaving her sitting there, stunned and silent. I didn't care. I was done caring about anything.",
        "Sex": "Male",
        "Age": 37,
        "Occupation": "Scientist",
        "Relationship Status": "Married",
        "Negative Emotion": "Hopelessness",
        "Cognitive Distortion": "Mental Filter",
        "Generated Assessment": "\"Ugh, fuck my life right now! It's like everything is falling apart, you know? The lab's a freakin' disaster zone, all because some suit decided to cut our funding. Months behind schedule, and who gives a damn? Not them, that's for sure.\n\nAnd don't even get me started on the team. Lazy bunch of idiots, can't keep up with shit. I mean, how hard is it to run those tests properly? It's like pulling teeth with these clowns!\n\nGod, I can't believe I'm saying this, but I actually miss the old days. You remember, back when we were just some small-town nobodies, trying to make a name for ourselves? Life was simpler then, ya know?\n\nNow it's all politics and red tape bullshit. And where am I in all this? Stuck in the middle, trying to hold everything together while everyone else fucks off and plays happy families.\n\nYou wanna know what really grinds my gears? The fact that no one seems to get it. They don't understand how hard we're working here, how much blood, sweat, and tears we're pouring into this project. And now, because some pencil-pushing moron decided he knew better, it's all going to waste.\n\nI mean, come on! We were so close too. Just a few more weeks, that's all we needed. But noooo, they had to go and pull the rug out from under us. Typical.\n\nBut you know what? Fuck 'em. I'm not gonna let this break me. I'll find another way. I always do. I just... I need a minute, okay? A chance to catch my breath before I dive back in.\"\n\nPauses, takes a deep breath, then continues in a slightly calmer tone.\n\n\"Sorry, babe. You didn't deserve that. It's just... it's tough out there right now. But hey, you know me. I'll be alright. We both will.\""
    },
    {
        "Triggering Event": "I was stockin' shelves at the back, hummin' to myself, when I heard it. A rustlin', like someone was sneakin' around behind me. I spun 'round, but nobody was there.\n\n\"Dammit,\" I muttered, \"Now I'm hearin' things.\"\n\nBut then, there it was again. Louder this time, like someone was deliberately tryin' to scare the shit outta me. I stomped off towards the storeroom, and that's when I saw it - a goddamn security camera, pointed right at me.\n\n\"What the fuck?\" I hissed. \"They watchin' me? Thinkin' I'm stealin', like some common thief?\"\n\nI stormed out of the store, slammin' the door behind me. My heart was poundin', hands shakin'. \"This is bullshit,\" I spat. \"I'll show 'em who's a good worker.\"\n\nBut as I stood there, breathin' heavy, I thought about my husband waitin' for me at home. He'd been worried lately, said I was actin' strange.\n\n\"Shit,\" I whispered, feelin' a chill run down my spine. \"What if he's right? What if I'm losin' it?\"\n\nI took a deep breath and turned back towards the store. \"Tomorrow,\" I promised myself. \"Tomorrow, I'll talk to the manager. Today... today, I just gotta finish my shift.\"",
        "Sex": "Female",
        "Age": 67,
        "Occupation": "Retail Worker",
        "Relationship Status": "Married",
        "Negative Emotion": "Paranoia",
        "Cognitive Distortion": "What if?",
        "Generated Assessment": "\"I mean, really? A security camera? In the storeroom? What am I supposed to think? That they're just trying to catch dust bunnies? No, no, it's gotta be me. Me, the thief, the loser. Great. Just great.\n\nBut you know what? Maybe this is a good thing. Maybe it'll wake them up. Make them see that I'm not some criminal mastermind, but a damn fine employee. If they'd just give me a chance, they'd see that. But do they? Noooo. They hide cameras instead.\n\nAnd my husband... he's been worried about me. Says I've been acting strange. Strange! Can you believe it? Me, strange? That's rich. But what if he's right? What if this is all some big, weird episode and nobody told me about the cameras because they're afraid of how I'll react?\n\nShit, shit, shit. Now I'm worried. About him, about my job, about... well, everything. It's not like I can just turn off these thoughts, you know? They're always there, gnawing at me. Always asking 'What if? What if this happens? Or that?' Ugh.\n\nBut fine. Fine! I'll finish my shift. I'll talk to the manager tomorrow. Maybe he'll see sense. And maybe, just maybe, I won't lose it before then.\""
    },
    {
        "Triggering Event": "In the thick of service, knives chopping like anxious hearts, Emma's eyes darted to the kitchen clock. Again. She'd been at it since dawn, but the orders kept flooding in, each one setting off a fresh spark of worry.\n\nHer sous-chef, Jake, caught her eye, raised an eyebrow. \"You good, Chef?\"\n\nShe just nodded, but her hands were a different story. They fumbled over a chicken breast, sending it skidding across the counter. She felt her cheeks flush, her mind racing like a panicked soufflé.\n\nThe restaurant was packed tonight, every table filled with chatter and clink of glasses. But Emma's ears tuned out the merriment, honing in on the silence from Table Seven. That couple who'd been laughing just minutes ago were now quiet, their heads bent over their phones. Were they checking reviews? Comparing her cooking to some other chef?\n\nHer stomach churned, bile rising like dough left too long. She couldn't afford another bad review. Not after last time. She could still hear the words echoing in her head, see them typed out in cold black letters: \"Overrated. Overpriced. Over.\"\n\nShe took a deep breath, tried to shake off the worry. But it clung to her like the smell of burned garlic, refusing to be ignored. Her hands started shaking again, this time as she reached for the salt. She missed, sending a cloud of the stuff billowing onto the counter.\n\n\"Fuck,\" she muttered, swiping at it with her apron. She was losing control. Again.\n\nJust then, the kitchen door swung open. It was Table Seven, smiling now, thanking her for the meal. Emma let out a breath she hadn't realized she'd been holding. But as they turned to leave, the woman paused, leaned in close.\n\n\"By the way,\" she said, voice low, \"you might want to check your website. Some jerk just left another one-star review.\"\n\nEmma felt her heart drop like a raw egg onto hot concrete. She was done for. Worry had won again.",
        "Sex": "Female",
        "Age": 48,
        "Occupation": "Chef",
        "Relationship Status": "Single",
        "Negative Emotion": "Worry",
        "Cognitive Distortion": "Fortune Telling",
        "Generated Assessment": "Emma slammed the door behind her, leaning against it as she slid down to the floor, her back damp with sweat and relief. Her eyes burned into the darkness of her office, mind spinning like a whirlwind.\n\n\"Fuck,\" she breathed out, hands shaking as she grabbed at her hair. \"This is it. I knew it. I fucking knew it.\" She could see it now, clear as day - the restaurant empty, the staff gone, the reviews echoing through the vacant halls like ghosts. \"Overrated. Overpriced. Over.\"\n\nHer heart pounded against her ribs, each beat echoing the words in her head. She felt it, the familiar rise of panic, the bile climbing up her throat. This was how it always went. One bad review, and it all crumbled.\n\nShe tried to push away the thoughts, but they were relentless, a flood she couldn't hold back. She saw herself closing the restaurant, packing up her life here, retreating with her tail between her legs. She could hear the laughter of her competitors, the whispers of pity from former customers.\n\nShe wanted to scream, to rage against the unfairness of it all. But there was no use. She knew what was coming. She'd seen it a thousand times before in her mind's eye. It was inevitable."
    },
    {
        "Triggering Event": "\"Bloody hell, not again! I've just spent an hour on the phone with Mum, listening to her drone on about how much she misses Dad. It's been two years already, hasn't it? I thought we were past this. But no, here I am, feeling like a raw nerve, wishing I could scream into a pillow. And now, my partner sends me a text saying they're working late again. Again! I swear, if they ask me to pick up their dry cleaning too, I'm gonna lose it. I just wanna curl up and cry, but who's got time for that? Not me, not with these shifts from hell. Life's a bloody bitch, isn't it?\"",
        "Sex": "Female",
        "Age": 59,
        "Occupation": "Nurse",
        "Relationship Status": "In a Relationship",
        "Negative Emotion": "Suffering",
        "Cognitive Distortion": "Blaming",
        "Generated Assessment": "**Writing Prompt:**\nImagine you're a dedicated nurse manager who's been having a tough week at work. You've just ended a call with your mother, who's still grieving the loss of your father two years ago. As soon as you hang up, you receive a text from your partner saying they'll be working late again tonight. Write down what goes through your mind in that moment.\n\n**Response:**\n\"Absolutely ridiculous. Here I am, juggling staff shortages and bed occupancy rates like some sort of bloody circus act, and my partner has the audacity to spring another late night on me without so much as a by-your-leave. It's not like I've got patients waiting for their dinner trays or anything. And Mum, always with her endless sob stories about Dad. Two years gone, and she still expects me to drop everything to hold her hand over the phone. I suppose it's my duty, isn't it? After all, I'm the one who's supposed to keep everyone happy. But does anyone ever think about what I need? No, of course not. It's always about them, isn't it?\""
    }
]