[
    {
        "Triggering Event": "**Event Scenario:**\n\nIt's 10 PM on a Friday night, and you're still hunched over your microscope in the lab, squinting at samples that refuse to yield their secrets. Your eyes are gritty, your back aches, and you can feel the tension headache starting to pound behind your temples.\n\nYour phone buzzes on the counter - Sarah again. She's been calling for hours, leaving voicemails filled with concern, then frustration, now resigned silence. You've ignored every call. You don't have time for this shit right now.\n\nYou sigh, running a hand through your greasy hair. You haven't seen Sarah in days. Hell, you haven't slept in days either. You were supposed to be at her place hours ago, but these damn samples... They're not cooperating, and neither is your goddamn life.\n\nYou grab your phone, scrolling through the missed calls, voicemails, texts. The last one reads, \"I can't do this anymore, Sam. I need some space.\" You feel a pang of something - guilt? Annoyance? You're not sure, and you don't care right now. You toss the phone back onto the counter with a curse.\n\nYou lean back in your chair, staring at the ceiling tiles, trying to ignore the lab equipment humming around you like some goddamn white noise machine. This is what you wanted, isn't it? To be a big shot scientist, making groundbreaking discoveries? Fuck relationships, fuck sleep, fuck everything that's not this goddamn research.\n\nBut as you sit there, alone in the sterile glow of the lab lights, you can't shake the feeling that something just slipped through your fingers. Again. And it wasn't a damn sample this time.",
        "Sex": "Male",
        "Age": 24,
        "Occupation": "Scientist",
        "Relationship Status": "In a Relationship",
        "Negative Emotion": "Unhappiness",
        "Cognitive Distortion": "Discounting the Positive",
        "Generated Assessment": "**Writing Prompt:**\n\nImagine you're Sam, the dedicated scientist who's been burning the midnight oil at the lab for days. You've just read Sarah's text message saying she needs space. Your immediate reaction?\n\n**Text Example:**\n\n\"Hmph, 'space,' she says,\" I mutter to myself, leaning back in my ergonomic chair with a squeak of protest against the late-night silence. \"As if I haven't earned every minute here. She doesn't understand; no one does.\"\n\nI glance at the voicemails flashing on my phone - five missed calls from Sarah today alone. Her concern was endearing at first, but now it's just... noise. Interference.\n\n\"I've barely slept this week,\" I grumble, rubbing at the grit in my eyes. \"And she wants me to drop everything for some 'quality time'? Preposterous.\"\n\nMy gaze falls on the samples arranged neatly before me - each one a testament to my dedication, my intellect. They're not perfect, no, but they're mine. My work.\n\n\"And what about these?\" I gesture at them, as if Sarah can see through the phone screen. \"Do these not count? Because I've been here for days, making progress, pushing boundaries. That's worth something.\"\n\nI pick up my phone, scroll past Sarah's messages to the emails from colleagues congratulating me on my preliminary findings. I scan them briefly before setting the phone back down with a dismissive sniff.\n\n\"See?\" I say to no one in particular. \"This is what matters. Not some relationship drama. This... this is real life.\""
    },
    {
        "Triggering Event": "She'd been at it for hours, her eyes glued to the microscope, adjusting the focus every few minutes to keep her specimen in view. It was Friday night, for crying out loud! Where was everyone? She could've used a break, maybe some coffee.\n\nHer husband had promised to pick up dinner on his way home from work. But here she was, hunched over this damn slide, and it was getting cold. Again. She checked her phone—no messages, no \"I'm running late\" texts. Typical.\n\nJust then, the lab door creaked open. She turned, expecting to see him, but it was just one of the grad students, munching on a sandwich. He didn't even notice her, too busy chatting with his friend about some sports game she couldn't care less about.\n\nShe felt her irritation grow like a fungus under the microscope. She wasn't even supposed to be here tonight. She'd taken time off to prepare for their anniversary weekend away. But no, they'd found some new bacteria that needed identifying immediately, and who else could do it but her?\n\nShe took a deep breath, trying to calm herself. Maybe she should just call him. Ask where he was. No, scratch that. She didn't want to sound like one of those nagging wives. But seriously, what was taking so long?\n\nShe tried to focus back on her work, but the specimen seemed to blur before her eyes. Great, now her contacts were bothering her too. She rubbed at them, feeling a familiar gritty sensation. This was ridiculous. She stood up abruptly, knocking over a pile of papers.\n\n\"Oops,\" she muttered, bending down to pick them up. As she did, something caught her eye—a text message notification flashing on her phone. It was from him. \"Stuck in traffic,\" it read. \"Won't be long now.\" She sighed, dropping the papers back onto the floor. Well, at least he'd had the decency to send a message this time.\n\nBut irritation still gnawed at her. She knew she should just wait patiently, maybe even try to enjoy the quiet lab time. But all she could think about was how hungry she was, and how tired she was of waiting on him hand and foot while he ran around like some bigshot scientist.\n\nShe sighed again, sinking back into her chair. This wasn't how she'd planned to spend their anniversary eve. Not at all.",
        "Sex": "Female",
        "Age": 34,
        "Occupation": "Scientist",
        "Relationship Status": "Married",
        "Negative Emotion": "Irritation",
        "Cognitive Distortion": "Magnification/Minimization",
        "Generated Assessment": "\"I've been here for hours! Friday night, and I'm stuck under this microscope. Where's everyone? Especially him. Promised dinner, didn't he? Now it's getting cold again. Typical. No message, no 'I'm running late'. Not even a courtesy text. I could've used a break, some coffee. But no, it's just me and these blasted bacteria. I'm not even supposed to be here. Anniversary weekend away, remember that? But no, lab can't function without me for one night. And now my contacts are bothering me too. This is ridiculous. Stupid traffic! Always his excuse. I should've known better than to expect anything different from him. Always running around like he's the only important one here. I deserve more than this. I deserve better.\""
    },
    {
        "Triggering Event": "\"Damn it all to hell! I've spent hours hunched over these blasted test results, and for what? Another dead end! My career's spinning down the drain like some clogged-up lab sink. It's been five years since the big breakup, and I'm still drowning in this godforsaken sorrow. Every time I think I'm finally moving on, something reminds me of her - a damn beaker, for chrissake! She'd laugh at this mess, tell me to take a breath, but she's not here. And now, neither is my fucking motivation. It's like I've lost the key to my own goddamn lab. Everything feels pointless, just another experiment gone wrong.\"",
        "Sex": "Male",
        "Age": 50,
        "Occupation": "Scientist",
        "Relationship Status": "Single",
        "Negative Emotion": "Sorrow",
        "Cognitive Distortion": "Mind Reading",
        "Generated Assessment": "**Writing Prompt:** \"Alright, you've just spent hours working on a project that's suddenly hit a wall. Your partner's been quiet all evening, typing away at their laptop. You're feeling frustrated and exhausted. What do they think of me now? Probably think I'm an idiot for getting stuck again. They're probably just waiting for me to ask for help so they can show off how much better they are at this than me.\"\n\n**Text:**\n\"Fucking fantastic, another goddamn roadblock. Hours down the drain, and for what? To watch my career swirl around like some lab waste. Five years since she walked out, and I'm still stuck here, drowning in memories. Every damn beaker reminds me of her laughter, her encouragement. But now, it's just another reminder of how far I've fallen.\n\nShe'd say 'Take a breath, love,' but she's not here to say it. And neither is my fucking motivation. I can feel it, the weight of their judgment. They're probably sitting there, thinking 'Here we go again, another failed experiment.' I can almost hear them, smirking at me from across the room.\n\n'Hey, need a hand?' they'll ask, all fake concern. Like they're doing me a favor. But I know what they really think: 'Finally, my chance to show him up.'\n\nBut not today, asshole. Today, I'll figure this out on my own. No need to prove anything to you.\""
    },
    {
        "Triggering Event": "In the grimy, fluorescent-lit newsroom, I slumped over my desk, staring at the blank screen like it was a fucking Rorschach test. Another goddamn deadline looming, and here I was, drier than the Sahara, brain fog thicker than London smog. Christ, even the coffee tasted like shit today.\n\nMy editor, old gruff bastard that he is, leaned over my cubicle, his face a thundercloud. \"Still on it, huh?\" he grunted. \"We need this by end of day.\"\n\nI ran a hand through my greasy hair, feeling that familiar gnawing in my gut. \"Yeah, yeah,\" I muttered, \"just... just give me a minute.\"\n\nHe snorted and stomped off. A minute. Like that was gonna fix this fucking mess. I felt the anxiety clawing at my throat, each breath shallower than the last. Christ almighty, what if I couldn't do it? What if this time, the words really didn't come?\n\nI glanced around the newsroom, everyone else typing away, faces lit up by the soft glow of their monitors. They seemed so... happy. Or at least, not like they were drowning in a sea of 'fuck this shit'. My stomach churned. Was I the only one feeling like this? Like I was stuck in quicksand, and every fucking word pulled me deeper?\n\nI took a deep breath, trying to calm myself. It's just writer's block, I told myself. Happens to everyone. But even as I thought it, I knew I was full of shit. This wasn't just writer's block. This was... this was something else. Something darker.\n\nAnd fuck me if that didn't scare the hell out of me.",
        "Sex": "Male",
        "Age": 41,
        "Occupation": "Journalist",
        "Relationship Status": "Single",
        "Negative Emotion": "Unhappiness",
        "Cognitive Distortion": "Blaming",
        "Generated Assessment": "I stared at the blinking cursor, each flash mocking me like a tiny, digital taunting face. My heart pounded against my ribs, anger simmering beneath the surface. How could they do this to me? I was a fucking professional, not some amateur hack. And yet, here I was, drowning in this goddamn blank page, all because of their ridiculous deadline.\n\nI mean, who sets a deadline on a Friday? Who? Some sadist, that's who. They probably sat there, smug smiles on their faces, thinking they were doing me a favor. Well, fuck them. Fuck every single one of them and their lousy deadlines.\n\nAnd don't even get me started on the coffee. How was I supposed to concentrate with this shit swirling around in my stomach? It tasted like they brewed it in the same pot they'd been using since the Nixon administration. Jesus Christ, couldn't they spring for a decent brand?\n\nI glanced at the other reporters, their fingers dancing over the keyboards like little typing ballerinas. They were probably churning out Pulitzer-worthy articles left and right while I was stuck here, wrestling with this... this... thing that used to be my fucking job.\n\nIt's not fair, I thought, feeling the familiar heat of resentment building behind my eyes. It's not fucking fair at all."
    },
    {
        "Triggering Event": "In the quietude of my classroom, after the last echo of laughter from my students had faded into the closing door, I found myself alone with a desolation that was becoming all too familiar. The silence was oppressive, each tick of the clock resonating like a hammer against my heart. I slumped onto my desk, the cold wood providing little comfort against the chill that seemed to have seeped into my very bones.\n\nI picked up the photograph that lay there, its edges worn from being handled so often. It was taken at last year's school picnic; me, beaming at the camera, sandwiched between two rows of smiling faces - my students. But today, those smiles seemed like mocking reminders of what I'd lost.\n\nI'd received another email this morning from the principal. \"We regret to inform you...\" It wasn't the first, nor would it be the last. Another school was cutting their teaching positions due to budget cuts. The competition for jobs was fierce, and with my age against me, I felt like a drowning woman grasping at straws.\n\nMy thoughts drifted to her - Emily, my best friend since college. She'd found love, got married, had two beautiful children. Her life was a tapestry of warmth and joy, each thread woven with carefree laughter. And here I was, alone in my classroom, the only sound the relentless ticking of the clock.\n\nI felt a lump form in my throat as I looked at the empty desks before me. Another year without a permanent position loomed ahead, another year of uncertainty, another year of watching my friends advance while I seemed to be stuck in place. The sadness was overwhelming, a crushing weight that made it difficult to breathe.\n\nI took a deep breath, steeling myself for what lay ahead. Tomorrow was another day, another chance to face this reality head-on. But for now, I let the tears fall, each one a silent testament to my struggle, each one a quiet plea for things to change.",
        "Sex": "Female",
        "Age": 31,
        "Occupation": "Teacher",
        "Relationship Status": "Single",
        "Negative Emotion": "Sadness",
        "Cognitive Distortion": "Magnification/Minimization",
        "Generated Assessment": "**Writing Prompt:**\nImagine you're a teacher who has recently been laid off due to budget cuts. You've applied for several jobs but haven't heard back from anyone yet. Today, you found out that your best friend from college just got a promotion at work. Write about how you feel as you sit alone in your empty classroom after school hours.\n\n**Text:**\n\nJesus Christ, not another fucking day like this. I slump into my old chair, the one that's seen better days, just like me. The room's a goddamn echo chamber now, no little shits running around, no pencils tapping on desks. Just silence. Fucking brilliant.\n\nI look at the photos on my desk - last year's picnic. Me, smiling like an idiot, surrounded by kids who probably don't even remember me now. And here I am, still fucking unemployed. Budget cuts, they say. Bullshit. It's just 'cause I'm getting old, isn't it? Nobody wants to hire a dinosaur.\n\nEmily, though... She got that big shot job at some fancy firm. Promotion, raise, the works. Her Facebook's full of her smiling face, holding champagne glasses with some fucking suit. And here I am, staring at an empty classroom, wondering if I should start selling my lesson plans on eBay to make rent.\n\nI mean, sure, she deserves it. She's always been smarter than me, worked harder too. But fuck, couldn't the universe throw me a bone once in a while? It's not like I'm asking for much - just a job that doesn't involve wearing a name tag and asking if people want fries with their order.\n\nI look at my phone. No new emails. Not even a 'no'. Just nothing. I guess that's what I get for expecting something good to happen, huh? Fuck this shit. I'm going home, grabbing a bottle of wine, and watching some depressing movie about a guy who loses everything but learns to love himself or some crap like that. Because why the fuck not? It's not like my life could get any more pathetic."
    },
    {
        "Triggering Event": "\"Damn it all!\" she muttered under her breath, slamming down the phone receiver so hard it rattled in its cradle. \"How dare they?\" Her heart pounded like a freight train, anger surging through her veins like wildfire.\n\nIt had been two years since Bob passed, and these bastards at the hospital still couldn't get their act together. They'd mixed up his records with some new hire's, and now they were accusing her of fraud for using his pension benefits. As if she'd take a cent that wasn't rightfully hers.\n\nShe could feel the heat rising in her cheeks, her breath coming in short, sharp bursts. She wanted to scream, to throw something, anything, just to make them understand how much this hurt. They were desecrating Bob's memory with their carelessness, their stupidity.\n\nHer hands trembled as she lit a cigarette, something she hadn't done since Bob was alive. But right now, she needed the jolt of nicotine, needed something to keep her from marching down to that hospital and giving them a piece of her mind they'd never forget.\n\nShe took a long drag, the smoke burning her lungs. She knew she should calm down, but how could she? This was their second mistake this month alone. Didn't they have any respect for Bob's service, for what he'd done for that godforsaken place?\n\nHer eyes welled up with tears, but she wiped them away angrily. No, she wouldn't cry. Not today. Today, she was pissed off, and she wasn't going to let anyone take that away from her.\n\nShe took another drag of her cigarette, her resolve hardening. She'd show them. She'd fix this mess once and for all. And if they didn't shape up after that, well, she'd just have to make them.",
        "Sex": "Female",
        "Age": 57,
        "Occupation": "Nurse",
        "Relationship Status": "Widowed",
        "Negative Emotion": "Anger",
        "Cognitive Distortion": "What if?",
        "Generated Assessment": "\"What if they decide to press charges? What if I lose everything Bob left behind?\" she whispered into the empty room, pacing back and forth like a caged animal. Her mind raced with scenarios, each one worse than the last. She'd seen it happen before, people accused of fraud, their lives ruined in an instant.\n\nShe took another drag of her cigarette, her hands shaking slightly. \"What if they find out about that little slip-up I made last year? The one where I accidentally used Bob's card to pay for that dinner?\" Her stomach churned at the thought. She'd never meant any harm, but what if they didn't see it that way?\n\nShe sat down hard on the couch, her head in her hands. \"What if this is just the beginning? What if they start digging into our past, looking for more ways to accuse me?\" Her heart felt like a lead weight in her chest. She could feel panic rising, but she pushed it down. She wouldn't lose control, not again.\n\nShe stood up abruptly, determination etched on her face. \"I won't let them do this,\" she said aloud, her voice steady despite the storm raging inside her. \"I'll find a way to fix this. I always do.\" But even as she said it, doubts lingered, like shadows at the corners of her mind. What ifs, waiting to pounce."
    },
    {
        "Triggering Event": "In her decade-long tenure at the grand old department store, Emily had seen it all. Yet, today, she felt an unfamiliar heat rise in her cheeks as she stood by the cash register, watching the young sales associate, Jamie, flit about with an irritating air of nonchalance.\n\n\"Jamie,\" Emily called out, her voice laced with a frost that could chill the late summer's day outside. \"Would you mind attending to Mrs. Thompson? She's been waiting for some time now.\"\n\nJamie looked up from his phone, feigning surprise at the sight of the elderly woman patiently holding a pile of clothes in her arms. He sauntered over, his lazy drawl dripping with insincerity, \"I'm so sorry, Mrs. Thompson. I was just...restocking.\"\n\nEmily's anger boiled over as she watched Jamie's performance. She snapped, \"Restocking? Or were you busy counting the minutes until your shift ends?\" Her voice echoed through the quiet store, startling a few customers.\n\nJamie's eyes narrowed, his smirk replaced by a scowl. \"What's your problem, Emily? I'm doing my job.\"\n\nEmily stepped closer, her tone dropping to a dangerous level of calm. \"Your job, Jamie, is to serve our customers with respect and efficiency. Not to waste time on your phone while they wait.\" She gestured towards Mrs. Thompson, who looked uncomfortable at being the center of attention.\n\nJamie crossed his arms, his chin jutting out defiantly. \"You're just jealous because you've been stuck behind that counter for years. I'm young, Emily. I have a life outside this store.\"\n\nEmily's anger morphed into a cold fury. She leaned in, her voice barely above a whisper, yet cutting like a knife. \"This 'life' of yours, Jamie, is built on the backs of people who respect their jobs and the customers they serve. You're nothing but a spoiled brat playing dress-up in a uniform.\"\n\nThe store fell silent except for the soft hum of the fluorescent lights overhead. Jamie's face turned red, his hands clenched into fists at his sides. But Emily was already turning away, her duty done. She had no patience for laziness or disrespect, especially not on her watch.",
        "Sex": "Female",
        "Age": 40,
        "Occupation": "Retail Worker",
        "Relationship Status": "Single",
        "Negative Emotion": "Anger",
        "Cognitive Distortion": "Overgeneralization",
        "Generated Assessment": "**Writing Prompt:**\nIn your own words, describe how Emily feels about Jamie's behavior after witnessing today's incident, reflecting her tendency to overgeneralize.\n\n**Emily's Reaction:**\n\n\"I've seen this before,\" Emily muttered under her breath as she watched Jamie saunter back to his phone after helping Mrs. Thompson. \"Always on that thing, never bothering with customers unless I make him.\"\n\nShe crossed her arms, her expression souring like milk left out too long. \"It's not just today, either. It's always the same with him. He thinks this job is beneath him, that we're all beneath him.\"\n\nEmily shook her head, her voice laced with disdain. \"And he's lazy, too. Never willing to lift a finger unless it's for himself. I've seen him leave stock untouched on the floor, whole aisles left a mess because he can't be bothered to clean up after himself.\"\n\nShe gestured towards Jamie with a nod of her head, her eyes narrowing slightly. \"He thinks he's too good for this place, too good for us. Well, I've got news for him. This 'whole' store doesn't run itself, and it sure as hell doesn't run on his lazy attitude.\"\n\nEmily huffed out a breath, her cheeks flushed with anger. \"I've had enough of his nonsense. It's always something with him, never any improvement, never any change.\" She paused, then added with finality, \"He'll learn soon enough that I won't tolerate this kind of behavior, not on my watch.\""
    },
    {
        "Triggering Event": "In her bustling kitchen, Emma chopped onions mechanically, her mind elsewhere. Divorce had left her heart as raw as the garlic sizzling in the pan behind her. She missed his laugh, his warmth. The house was too quiet now.\n\nA sudden crash startled her. She turned to see a shattered plate on the floor, remnants of her favorite dish. Her breath caught, panic rising like bile in her throat. It had been his, a gift from their first trip together. Now it was gone, just like him.\n\nTears welled up, threatening to spill over. Emma took a deep breath, trying to calm herself. She didn't want the staff seeing her like this again. They were already whispering about her moods, her late-night baking sprees. She was their chef, not some emotional wreck.\n\nBut damn it, today felt harder than usual. Every task seemed insurmountable, every sound too loud. Her hands trembled as she swept up the shattered pieces, each one a reminder of what used to be.\n\nShe needed to pull herself together. Tonight was the grand opening of their new restaurant. She couldn't afford to fall apart now. Not again.",
        "Sex": "Female",
        "Age": 45,
        "Occupation": "Chef",
        "Relationship Status": "Divorced",
        "Negative Emotion": "Sorrow",
        "Cognitive Distortion": "Emotional Reasoning",
        "Generated Assessment": "Emma, hunched over the broom, muttered to herself, \"Seriously? Today of all days?\" The shattered plate seemed like a bloody metaphor for her life - broken, beyond repair. She could almost hear it laughing at her, \"See, even your favorite things can't survive you.\" She sighed, feeling every fragment as heavy as her heart. \"Guess who's crying over spilled porcelain now,\" she mocked herself, wiping away a renegade tear. Her emotions were screaming at her that everything was falling apart, just like the damn plate. But hey, wasn't that always the case? Emotions never lied, did they? She straightened up, resolve hardening in her eyes. \"Fuck this. I'm not letting some stupid plate dictate my life.\""
    },
    {
        "Triggering Event": "In the suffocating silence of her too-quiet apartment, she sat, fingers clicking on a keyboard like tiny, angry pistons. Another day, another bug to squash. She was good at that, wasn't she? Squashing things.\n\nThe doorbell rang, shrilly, like it had a personal vendetta against her eardrums. She considered ignoring it, but it was already past midnight. It could be an emergency. Widows don't get many visitors after dark.\n\nShe stomped to the door, yanking it open with more force than necessary. Standing there, bathed in the harsh glow of her porch light, was a young woman. Too young, too perky, with a smile that seemed permanently etched onto her face.\n\n\"Hi! I'm sorry to bother you so late,\" she chirped, \"but we've just moved in next door and we wanted to introduce ourselves.\"\n\nWe? She hadn't seen anyone else. But sure enough, from the shadows of the neighboring doorway, a man emerged, equally smiley, equally cheerful.\n\n\"And who's this?\" the woman asked, peering past her into the apartment. \"Your husband?\"\n\nShe felt it then, the familiar surge of irritation, threatening to boil over like a pot left on the stove too long. She wanted to snap that no, he wasn't. That she was widowed, and they were intruding on more than just her sleep.\n\nBut she didn't. Instead, she forced a smile, the kind that doesn't quite reach the eyes. \"No,\" she said, voice tight as a drum. \"He's not here.\"\n\nShe slammed the door in their faces, leaving them standing there, smiles frozen, confusion etched on their faces. She leaned against the door, chest heaving, heart pounding. It wasn't their fault, she knew that. But she was tired of explaining, tired of being alone.\n\nThe phone rang then, shattering the silence. Again with the noise. She considered letting it ring, but it might be work. They were always working, weren't they?\n\nShe picked up the receiver, snarling into it, \"What?\"\n\nIt wasn't work. It was her mother, checking in, like she did every night. And just like that, the irritation bubbled over, spilling out in a torrent of words.\n\n\"I'm fine, Mother!\" she snapped. \"I don't need you to call me every night! I haven't seen him in five years! It's not healthy!\"\n\nShe slammed down the phone, leaving her mother stunned into silence on the other end. She stood there, breathing hard, hands shaking. She was alone again, in the suffocating silence of her too-quiet apartment.\n\nBut this time, she welcomed it. Anything was better than dealing with people tonight. Anything was better than explaining why she was still here, and he wasn't.",
        "Sex": "Female",
        "Age": 41,
        "Occupation": "Software Engineer",
        "Relationship Status": "Widowed",
        "Negative Emotion": "Irritation",
        "Cognitive Distortion": "Labeling/Global Labeling",
        "Generated Assessment": "\"Oh great, another pair of 'perky' neighbors,\" she muttered to herself, slamming the door behind them. \"Just what I need. More cheerfulness to contrast with my perpetual gloom.\" She rolled her eyes, leaning against the door. \"Guess that's what happens when you're the 'grumpy widow' next door.\" She picked up the phone, snarling into it, \"What is it now, 'Concerned Mother of the Year'?\""
    },
    {
        "Triggering Event": "\"Fuck me sideways! I've just spent three hours on my feet, delivering another goddamn miracle in this shithole ER. And what do I get? A fucking 'Thank you' from some ungrateful prick who's more worried about his damn smartphone than the fact he almost died an hour ago. Then, I clock out and find a goddamn letter from the hospital admin. You know what it says? 'We regret to inform you...' Fuckin' 'regret', my ass! They're cutting my fucking hours because some pencil-pushing bureaucrat in HR decided we're 'overstaffed'. Overstaffed, my widowed, aching balls! I'm a goddamn doctor, not a fucking traffic cop. And to top it off, I get home to an empty house, with nothing but echoes of her laughter and the fucking silence that's been screaming at me since she left. Fuck this shit!\"",
        "Sex": "Male",
        "Age": 53,
        "Occupation": "Doctor",
        "Relationship Status": "Widowed",
        "Negative Emotion": "Suffering",
        "Cognitive Distortion": "Blaming",
        "Generated Assessment": "\"Christ almighty, it's like I'm the only one busting my ass around here! Three hours on my feet, saving some guy who was more worried about his damn phone than his own life, and what do I get? A half-assed 'thank you'! And now, they're cutting my hours too? Overstaffed, my ass! It's not like we're running a goddamn McDonald's here. They must've hired some new admin guy who doesn't know his head from his ass. And don't even get me started on that empty house. She left because I'm never home, right? If they'd just give me the hours I deserve, maybe she'd still be here. Fuck this shit! It's like everyone else is to blame for my life falling apart.\""
    }
]